{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=com.beakerapps.instameter2&rdid=com.beakerapps.instameter2&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "Cool app but more and more features are becoming paid. I bought the premium for a month and it didn't work at all. Scam! If you download the app, don't buy anything. They never responded to my complaint. Thankfully Google play refunded me.",
        "This app doesn't account for many of my unfollows, sometimes I reload it and there's no new unfollows even though there are on IG. So it doesn't so its job consistently.",
        "I like the features available in the free version. However, I paid for the upgraded version and the data doesn't load for the paid features, just the free ones, so it was a waste of money. After adding the free version, my Instagram was compromised and locked as well, so I had to reset it. I would not recommend the paid version, but would recommend the free features.",
        "not the worst but i bought the subscription and none of it even works. none of the app really works, unfollowers and new followers are inconsistent at best and the story view count doesnt work. it'll say my story was archived and not scanned properly while it's still active on my page. a waste of money tbh",
        "I love this app alot. It is very straightforward and easy. But you should make more of the items free",
        "I only like it because it tells me who's not following me back which instagram should already do but they don't because they suck. I give this app 2 stars because the unfollowed feature doesn't work. I keeps saying wait 24 48 hours hour the feature work on Instagram again but it never does.",
        "Besides the fact of , you know .... in app purchases this app is actually very good and useful I like it a lot. I recommend you download it , and if you are willing to buy the inapppurchases well then you would probably give it a 5 star",
        "It hardly ever works properly. It'll let you unfollow about 5 people before it tells you IG has put unfollow restrictions on your account (which is never accurate). I'd recommend Unfollow Pro for anyone with business accounts/large numbers of followers. Way fewer bugs.",
        "Great app to have!!! To many people follow you to get a follow back and then leave.... Some times it takes anywhere from 5 - 25 times for the app to open... started happening a few months ago...",
        "Well, the app does what it is supposed to do so I would give it a 5 on functionality. However, there is one huge and incredibly annoying characteristics. It is the stupid bell noise you get every time you open the app. It cannot be turned off aside from just silencing the phone and it is legitimately making me not want to use the app. In fact, that noise is the only reason I will not pay for the extra features... I want them... Just won't pay for something so obnoxiously annoying. Turn off the stupid bell and I will pay for the app, but until then I will look for another option.",
        "Actually pretty good! Professional looking, and works. Not being able to access some of premium features kinda sucks, but that can be solved 😈",
        "I unsubscribed from the pay feature today. This app just has way to many bugs, way to often, that take way to long to fix. I'm out.",
        "I understand that ads are necessary in order for us to use free apps. I support this. I do not, however, support the use of obnoxiously loud commercials. The commercials are loud, long, and cause me to not only use the app less, but it also causes me to not want anything to do with what is being advertised. They come up every time I open the app! If I'm not consciously thinking about the noise level, it can be problematic. Now, the developer has replied to me that they will look into the ads loading too often. That isn't even the issue! The whole obnoxious, video advertising system is the issue, and the feedback on here demonstrates that. Purchasing an app that is so disappointing is not an option. I would never purchase a product that I've tested that didn't offer decent quality in the first place.",
        "Logged in and says that my 16K followers number is too large and is not supported by this app. They should mention that on the PlayStore description, even on the log-in page of the app as a warning. I don't like that they had me log in & give out my password first.",
        "This app legitimately works. As someone who has seen fake app upon fake app for social media, this is quite refreshing. Been using it for 3 months now, zero complaints.",
        "After about a week, it stopped updating the list of followers and unfollowers. The manual refresh button would play an ad, but wouldn't even try to update anything. It was buggy at best when it did work since it would only let me unfollow a few people at a time before it just ignores every command and thinks I'm clicking on a different user while navigating around",
        "I'm honestly shocked at how well this app works! I mean there's a ton of apps similar to this, but they all seem to glitch and fail and lag, and just don't feel worth using at all. This app puts all the others I've tried to shame, I'm highly impressed with its performance. It's definitely worth it to just pay the one time and have the features unlocked forever! 10/10 would and will be recommending!",
        "This app is a total waste of time. I just downloaded it today and after waiting 5 minutes nothing happened. I tried to refresh the page only for it to say that my daily limit has expired even though I only tried it once. This happened at least five times in ten minutes. Very disappointing. Update: I logged into the app today and it doesnt update. Also My Instagram account was locked out because of uspicious activity or phishing.",
        "I love the list layouts and how it works. It has been working great for months but for the last week everytime I refresh it all it says is Error:Instagram servers are busy so I uninstalled it until they fix whatever issues it's having. It had just updated when it started this issue. I've uninstalled it and found a better app.",
        "Not worth your time without paying, not worth your money once you have. The most recent updates completely broke the app. There was an in app note to users stating they were working on an update however after a week it is even worse off. I cannot access most of the features at this point and the features I can still access are inaccurate. Besides that one in app note there has been no update or feedback from the developer. Prior to this issue the app was fine.",
        "The app was working great for me over the summer when I wanted some more insights on my account. And the new UI look is much nicer than the old one.... but ever since it rolled out I have not gotten the app to work once, constantly getting pop ups saying \"error couldnt connect\" or that my internet connection is \"bad\" it's really unfortunate there are some major bugs in the new version. Hope it all gets fixed soon. I havent been able to use this properly in over a month.",
        "Scam. Upgraded to pro, there was no difference in speed and most importantly none of the pro functions works. NOTHING. I contacted the app developer and they said they were fixing bugs and a new update was coming out soon. I waited for 3 weeks and still nothing. I contacted them again for refund, and they said they don't provide refund and for me to contact Google play. But Google doesn't refund after 2 days. Everything was a waste of money and time. So don't bother buying the Pro stick with the free version, there's no difference. I would rate the free version 5 stars though.",
        "***Update:It refreshed it today but it takes awhile for it to update it! When I refresh the page like you said it doesn't always update the likes and comments. It usually takes awhile. Other than that though I have had no problems with this app.*** I like this app. My only problem is it doesn't update my likes and comments. It's not that big of a deal but it would be nice if you could fix that! Other than that the app works pretty well!",
        "It was helpful with showing me who wasnt following me back but it did limit how many I could do at once. No problem right? So I waited and waited and it never let me do anything else even after waiting the time frame, even tried the next day so uninstalled and reinstalled and now it won't even let me log in without saying to wait 30 mins...I waited a whole day and still cant log in",
        "I sm very disappointed in yhis app. It is not reliable and only partially working. It takes forever to scan with each login. The slowest of all apps. I bought an Engagement Package weeks ago that has not worked once. Support is non existent and does not reply to bug reports. Asked for refund repeatedly. Nothing.",
        "Upgraded to PRO. Complete waste of money. It does not scan faster and all the other things you should be able to see don't work. I've been trying to see my ghosts for over a week now and it keeps saying I've hit my refresh limit and to try again in 30 mins...which never works. Don't waste your money. They keep saying they are fixing things, but nothing ever gets fixed.",
        "It used to be a good app but in the last month or so there have been a ton of bugs and all of the information is just wrong. So it has become pointless.",
        "Love this app! I am a lot of groups that host \"follow for follow\" trains on Facebook/IG but many people don't actually follow you back. Or they follow and then unfollow. Fortunately, this app helps me detect them and act accordingly. I gave a 4* review because it always gives me a message saying that IG won't allow me to unfollow anyone else through their app. It says come back in 24-48 hours. Once I come back, I get the same message. Fix this and we'll be in GREAT SHAPE.",
        "It definitely gets the job done, have been using it for nearly 2 years. Unfortunately I can't afford the premium features so I don't know how they work/most of it is locked which is a bummer as it doesn't leave much to do but the basic set is nice. Love the layout, it could use some adjustments but otherwise great app if you want to check your followers and stats.",
        "I gave this a three-star, middle of the road rating. When the app actually works, it provides some very good analytical data for your site. It also allows you to avoid those that follow and immediately unfollow just to build their own numbers. The app has not worked on my iPad for 3 months. I cannot get any current data and customer support has been non-existent.",
        "Fantastic app with a few weaknesses that I am anticipating improvements on. Pros 1. Gives fairly accurate unfollower/follower data; check, but usually right. 2. Love the most recent photos likes, makes it clear who is attending and who isn't. 3. Nice ghost following and who you follow who doesn't follow you. First, I like knowing who I'm following who doesn't like what I've posted, and, second, I sometimes follow others I don't expect will follow me back; and it's nice to see them separate from others. Cons 1. Refresh is terribly slow and not quite consistent with the error message. Example, today (I have currently 692 followers, following 385, so not a huge amount) I cannot get an update on my my \"Top Likers.\" The most recent time before this afternoon at 3 p.m. that I attempted to update it was the day before at 3 p.m. (I wait 24 hours). But the error message is that I'm checking too often. How can 24 hours be too often? This makes no sense. Improve this and you get 5 stars! dl",
        "I used to love this app and found it to be incredibly useful. I'm not sure what recently happened but it's no longer functioning. I've tried uninstalling and reinstalling. When it was functioning properly before, it would take about 30 seconds or so to populate my results. Now, it takes about 1 second but doesn't work and nothing changes, even though I can see on my Instagram profile that my numbers are significantly different.",
        "Don't waste your Money! I used FollowMeter one time to unfollow those who didn't follow me back and immediately got blocked from using this feature. The message says Instagram has blocked me from being able to use that feature however I can go to my Instagram account and follow/unfollow people all day. It says wait 24/48 hours and try again. Its been almost a week now. On top of that they offer no customer service at all in cases like this. I'd honestly like to get a refund.",
        "System is so glitchy lately, shows 2000+ unfollowers, they say its fixed but Ive tried uninstalling and reinstalling, nothing changes, when I delete my data and refresh, it says I've refreshed too many times and I need to wait 30 minutes, 30 min later I refresh, same message, wait a day, cycle starts over, 2000+ unfollowers...it used to be way better even if it was slower. I want something that actually works.",
        "It's useful, but Instagram blocked my use of it when I used it to unfollow other accounts. There's an easy workaround but it takes slightly longer to unfollow accounts. Also, not fond of the attempts to lure the user into a paid version. Periodically the program begins to routinely malfunction and must be uninstalled and reinstalled. That said, it tends to work better than the other similar programs that I've tried.",
        "So far I am really loving every feature of this app. I got the 1 year subscription for $24 and I tell you it was worth it. Not only it gets rid of the ads but i can also see accurate statistics of other readings in my business accounts. Love it had to give 5 stars. If I find anything wrong with it I will update this review. But so far my first 2 weeks owning it I am very satisfied! Keep it up developers!",
        "I paid for the pro edition so I could use multiple accounts, but the app is barely functional. It still takes forever to see who followed/unfollowed even on accounts with just 300 followers, and I get loading errors where it says almost everyone unfollowed me when I know that's not true. This is one of the slowest apps of this type, and I'm sure there must be a better way to program it. As for seeing top likers/commenters/ghost followers? No one has the patience to sit there to see them load.",
        "App shows 92 people not following me back, but I go to my IG and cross-check to see that they ARE following me back. When I first downloaded the app, it worked just fine, but ever since about 2-3 weeks ago, it has been reporting erroneous information. If it is not fixed soon, I will have no choice but to uninstall the app and discontinue using it, unfortunately.",
        "The Unfollow function is broken. I was only able to unfollow 17 people before it just stopped working. And before that, I could only unfollow 5-10 people at a time before it stopped me, saying I was doing it too fast. Developers, try programming it so we can queue follows/unfollows and the program automatically does it slowly for us. Who wants to log on and wait for your ultra-slow refresh so they can unfollow 5 people at a time?",
        "This app is amazing! I'm enjoying it so much!! Unfortunately I can't give you 5 starts because for the passed two weeks it is showing that all my followers unfollowed me and later says that they started following again... No idea what it's happening... maybe a crash that you are not aware of? I installed this app on my boyfriend's cell and he loves it also."
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": null,
    "appId": "com.beakerapps.instameter2",
    "url": "https://play.google.com/store/apps/details?id=com.beakerapps.instameter2&hl=en&gl=us"
}