{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=com.redcherry.hotquotes.hot.followers&rdid=com.redcherry.hotquotes.hot.followers&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "Won't let me do anything. Everytime I try to follow someone or like someone - to get coins, it just tells me \"we restrict certain activity\" then gives me a timer. If I wait til the timer goes down and try again, it just shows me the same message again and won't let me do anything and repeat the cycle of message and timer. So I literally can't do anything on the app or earn any coins for some reason.",
        "At first glance it looked as if it was one of those fraudulent apps but I installed it and to my surprise it worked like a charm. I instantly got big time followers in a span of only 10 minutes. I recommend this app. I am not a bot and purely found out about this app through my curiosity. Trust me, it's not the most amazing app but it can guarantee you a good amount of followers.",
        "This app is solid. I've never used something better and I'm glad I came across it. Everything is simple to understand and you get what you asked for in no time. And these people are absolutely real!!",
        "This app is AMAZING and the reason i say that is all you have to do is download the app like peoples photos and follow people on there, you can also choose if you want to follow the people on there or not.Thats how you get enough coins to get likes,comments, and followers and the followers are real people.",
        "Pretty good app, you do have to work for the coins if you dont want to pay for the coins.. takes a while but its pretty nice, i use it for more likes, i dont really care about the followers but just by opening the app it gave me 5 free followers so I'm not complaining, the followers showed up pretty quick ngl",
        "This app works pretty well and I am overall satisfied. You cannot like/comment/follow too many times or else IG flags you, but that isn't the apps fault at all. I've been able to grow multiple pages and gain a following with the help of this app.",
        "I personally love the content just maybe tweak a few things or add any other features. The quick add coins button takes a few minutes to reload so because it makes you wait for your hourly coins and that's all there is to do people will say it is not engaged enough and not keep the app.",
        "This app does work, what you have to do is like posts that get sent to your feed and you earn coins. The more coins you obtain the more chances of getting likes or followes increases because they show up other people's feeds and they are free to decide if they want to like your post or not. It is similar to promoting your post! 😊",
        "Ok 👍 Pretty good compared to those other apps. Gave me the followers, likes and comments I wanted but after a while it will refuse to give you coins which sucks. And then you have to watch tons of ads to get coins.",
        "For some reason my review keeps disappearing 🤔 but the app is good. You get followers quickly, you do have to work for the coins. I did notice though that even if you pay for followers even if their the gold followers, alot will unfollow you after getting their coins for following you it seems like...🤨",
        "Amazing app, worked very well in comparison to other apps of the same style. There are still a couple of things to improve but so far a very solid app👍 Update: still a great app, very good for getting followers 👌",
        "The app does what it says it is going to do. There are some minor glitches here and there but I still appreciate the opportunity. You can't really get a bunch of likes or follows without paying, so you have to watch a lot of ads.",
        "A good functioning app with not many ads while flipping through pages to earn coins, and it's an enjoyable app.",
        "The app is pretty good.. what i like most about it tho is that we can easily earn coins to get REAL followers, likes and comments without being constantly interrupted by unnecessary ads",
        "It actually works! This is overall an very impressive and not scam app. Though coins are a bit hard to earn and it takes time if you don't want to pay, it's still good!",
        "It's a great little app. Not in your face at all. And whereas I had steeled myself for another scammy app, my surprise was palpable. Wow. Nice one guys keep it going",
        "It works really well! There's no ADS you want to get money for the ads and their short and simple! And the prices for the coins aren't high!",
        "Definitely does what it says it does. Best to get golden users. Much more cost efficient than other, more popular, online services. 5 stars.",
        "I love this app it does give you followers and is pretty easy. You can spend your money if you want to make it faster. The follower's are real so it's up to them if they want to stay and follow you but it's so cool!!",
        "Great app, it deserves a 5 star rating. Very user friendly, works fast and easy. Definitely recommend it and give it 5 stars",
        "Really helpful! They helped me grow my account! It's pretty easy to get coins and the followers come in so quickly!",
        "I really love this app I rate it as a five star because it is one the most fastest ways to gain your followers and likes great way to grow your content I'm definitely recommending it to a few .",
        "Good aff I get my followers faster than I imagined lol, but sometimes I don't hey the actual amount I bought while it'll show on the app I've gotten them , that needs to be fixed.",
        "It's a great app, but needs to add custom comments. The comments are lacking, to put it nicely. Or have a comment categories section to choose from, or keywords. I would spend thousands a week here for these additions.",
        "So far, so good. I'm loving the app... no pop up adds or anything... very easy to use.",
        "This app surprisingly works, the Golden followers, the followers, and the way to get the followers is to do tasks like follow them, watch ads, or like a photo! And it's not like those other apps where ur required to use ur money to get followers.",
        "It's a pretty good app, I just wish you could earn coins faster or at least the amount needed for likes would be lower.",
        "First time trying & it actually worked! The likes came in immediately. I've had other apps where it take long to get, or u don't even get all u asked for. So definitely going to keep trying this 👏🏼 👏🏼 So far... ⭐⭐⭐⭐⭐",
        "I totally love this app. Not only is the process fast, but it also convenient and 100% accurate.",
        "This app is amazing, I get a lot of followers quick, but you do have to earn the followers though, I'm okay with that because everything in the world does not have to be free, nothing is free in this world . Thank you !",
        "Really good app and it's legit works really fast too my recommendation for it is very high most definitely a 5 out of 5 Stars",
        "This app deliver so fast and quickly, I an so in love with this app. I recommend this because it works so well and it's really helpful, good start for ig growth",
        "This is a good app to use ! Love that we can get free coins from watching ads and etc I would recommend all the people to use this app 😊🤝",
        "So far it does exactly what it came to do. It gave me followers. Yes it has ads but like it's work if you work it. I do like that a lot of pretty normal people seem to get added so, thank you for that. Great job",
        "This app is for real, I love it, I don't usually comment on apps stuff but this one deserves a 5 star, this app is really worth it.",
        "It works! It takes a while to get a lot of coins but it's super helpful! :D",
        "It definitely does work!!!my followers Increase I just wish you get more coins for the ads",
        "It's a good app if you have stars to get Stars you have to pay for them obviously but for free you can watch videos and rate the app",
        "Pretty good app I would definitely recommend just so you can keep a good track on who's following and viewing your page",
        "I like it..it's pretty interactive. Keeps me doing more. I'm running an experiment.👍👍👍"
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": null,
    "appId": "com.redcherry.hotquotes.hot.followers",
    "url": "https://play.google.com/store/apps/details?id=com.redcherry.hotquotes.hot.followers&hl=en&gl=us"
}