{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=com.mystalker.profile&rdid=com.mystalker.profile&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "I'm so glad I've been using this app these days. Because each feature of the application provides very important information for me individually. The feature I like the most and enjoy it is the one that shows those who look at my profile on Instagram. With this feature, I can effectively track people who are looking at my account. An app that anyone who wants to get this kind of information about Instagram can be used reliably.",
        "I recommend downloading the app instead of recognizing it by constantly reading it from the comments here. Because viewing profiles that don't follow on Instagram is a section that is much more than what is described here. I think this app is a great app to find accounts that don't return to you, especially if you're an account trying to increase the number of followers on Instagram.",
        "Every time I go into this app, I get excited. Because the ability to view those who look at my profile on Instagram constantly informs those who are entering my current profile. At first, I didn't believe it, so I made sure that the app, which I also tried from different accounts, was working properly.",
        "It's really simple to be able to follow my Instagram users through this app as I like. Before using this app, I had to keep my users under control to review them one by one. This process was making me work so hard because I had so many followers. When I started using this app, I started to experience convenience in this regard.",
        "An Instagram app where I use every feature in quality. Using this app really benefited me a lot. I used different apps either for reporting or for their features. That means I had to use a lot of apps at the same time. Now I can easily use all the features on this application without the need for any of them.",
        "Before I started using this app, I didn't think it could work so smoothly. The application can run very successfully above what is expected of an application. The first thing I used was the ability to see users who unfollowed my Instagram account, so I was able to view them without errors.",
        "I have been using this app for an average of five years and it is an Instagram app where I have no problems at all but can clearly get the right information. I used a lot of apps before and stopped using them because I never got the right information and I was constantly having problems. This app is really successful.",
        "After I started experiencing this application, I started to use the app continuously as I got used to the information I received from its features. There are useful and professional features specific to instagram account within the app and I didn't want to stop using this app. I couldn't access this information through normal practice.",
        "A free usage was offered in the name of user satisfaction in the application. Although I initially thought I was being charged for using the app recently, I have been using it for a month and have used every feature of the app perfectly without any charge from me. I can watch Instagram stories privately through the app.",
        "This app is an Instagram app that is full of innovations for me. Since this is an application, even the slightest complaint about the application is immediately listened to during your use and you are provided with a quick return. I use the app's ability to increase followers on Instagram in this way to increase the number of followers of my own profile in a short time, and so far I am quite satisfied with everything.",
        "I think there is a more effective application on top of this app to increase followers on Instagram. Like other systems, the bot does not increase followers with accounts. Instead, it sends follow-up requests within its own infrastructure, and then unfollows that person when the follow-up request is approved. Thus, we get a rapid increase in followers. Therefore, I can recommend this app to anyone.",
        "I think the app is a very clear app where you can find all the information you want to get about Instagram. As you start using it, you'll already get a better understanding over time whether you're going to use it to view what's already looking at your profile on Instagram or to increase your Instagram follower count.",
        "Among the Instagram analytics apps I tried, this was the first app that could work for me without really problems. When I wanted to be able to see users visiting my Instagram account, I tried a lot of different methods. I was only able to get accurate and complete results through this application.",
        "When I saw that it wasn't one of those poor quality and fake Instagram analytics apps, I realized that I was starting to use my time in value. After downloading the app, I was able to view accounts that I had not seen correctly until now, blocking my Instagram profile. The app works more flawlessly than I expected.",
        "In my opinion, if you want to use the Instagram app in a quality format, you will definitely like this type of application. The app has features that every user will want to use for a long time. I use it mostly to increase the number of followers on Instagram, but anyone can use it in different ways. It depends entirely on the user's wishes.",
        "I've never used an app with such detailed and improved features by working for free. After installing the app, I was able to view in detail the users who unfollowed my Instagram profile without charging me any fees. While Instagram profile apps in general work for a fee, I did not have a problem with my use of this app for free.",
        "I deleted all Instagram reporting apps that were constantly problematic on my phone. This app has contributed a lot to me for every Instagram profile. I've only been using this app continuously for a year. I have accessed every information I want to access on Instagram without errors. All the features of the app are the kind of features you will need for Instagram.",
        "I see the app as a complete entertainment app. Because every time I wonder about something, I just have to get it in practice. As a result, watching a hidden story on Instagram or viewing those who look at your Instagram profile also turns into a simple process that takes only a few seconds.",
        "I easily used the app in personal information that I couldn't view on Instagram. I was able to see clearly from the app the accounts that visited my Instagram profile. The application's smooth operation system has benefited me a lot. Other Instagram analytics apps I used were constantly making mistakes. But this app is very professional.",
        "I started to spend a lot of time in this application. When I wake up in the morning and pick up my phone, the first thing I do is log into the app and check who blocked me on Instagram. I can't help but look at the application to see what kind of activity has happened on my Instagram account in one day. These impressions encourage me to use the application.",
        "I've viewed many similar applications. I uploaded and reviewed all instagram apps. I had the opportunity to examine its features and operating systems in detail. I've found more features in this app, and the operating system can run in a higher-level state than any other application. I was able to see all their secret Instagram accounts and posts in this app. I will use this application continuously.",
        "You don't need to use the app for long periods of time for its features to benefit you. I was able to see users viewing my Instagram account for a short time immediately after downloading the app. You can use each feature at any time without restrictions. A convenient and professional working app.",
        "There were several different Instagram reporting apps I used before, but I couldn't analyze my Instagram profile when I wanted to. I downloaded this app two weeks ago. With this app, I was able to analyze my Instagram profile at any time. Also, the app gave me a lot of useful information by doing every Instagram analysis in an advanced way.",
        "It has become an app that I can actively use for my Instagram profile. You can quickly see confidential information in the app that you'll never be able to view on your Instagram account. I will continue to use the app functionally and error-free along with my Instagram profile. The application can work without problems.",
        "Since I opened my Instagram account, I have been able to use the app without problems. I have used all the features of the application and they can all work without errors. I use it quite actively as I need to. The app is a functional Instagram app that works automatically.",
        "I didn't encounter any problems using this app. Every feature of the app works really well and gives me all the information I want. It's a quality app that allows me to see confidential information that I can't see on Instagram. It's very helpful to me that fake followers on Instagram give information.",
        "In addition to having many Instagram features, I also liked the working system of the app. When I try to use a feature, it works fast and doesn't bother me. For example, when I need to see those who don't follow my Instagram profile, I can see it in bulk with the app in a short time.",
        "It's a cheerful app. Because while I loved watching stories on Instagram, I was sending some people a follow-up request, even though I didn't like it just to see their posts and stories. However, thanks to this app, I also secretly follow the stories of people I do not like without following them.",
        "The values that this application adds to me are so great that I can't end up telling it here. I found out that anyone around me is blocking me with the blockers feature on Instagram. Now I choose my friends more accurately. Almost all of them blocked me by telling me I didn't have a social media account. People you didn't expect could have blocked it. It is worth checking from this application.",
        "Since downloading this app to my phone, I have been able to see important information and transactions that I could not view on Instagram without problems. I didn't know before I downloaded that the app could be so useful for my Instagram account. Shortly after downloading, I was able to see users who visited my Instagram account.",
        "I think the most important and logical application, even in the short term, is the app that views my profile on this Instagram. Because even when you use the one-time hidden story tracking feature on Instagram, there's immediate access to all the information of the profile you want to track.",
        "I saw this report app in the store. When I saw that there were many professional features in the app, I started using them at no cost. The app has become my favorite app. I was able to see the accounts that have been viewing my Instagram profile for a week without errors from this app.",
        "It has many different features compared to other Instagram apps. Other applications were constantly feature-packed. This app is constantly being renewed and a wide range of improved features are being added. Through this app, I was able to achieve every feature I wanted perfectly.",
        "With the features in the app, you can access a lot of extra information on Instagram and do your Instagram operations. After downloading the app, I started to see those who were looking at my Instagram profile. Every day I check my Instagram profile without the app. I've never encountered any mistakes.",
        "The features of the app are quite improved, the kind of apps that Instagram users will need. I never had any trouble using the app. I was able to use every feature of the app without problems. The features I used gave professional results. The app can work really well.",
        "I started using this app to use features that Instagram doesn't normally offer. In response to other applications, this app provided me with the correct information I wanted. The information of those who looked at my profile on Instagram was what I was most curious about. The fact that this application is of such quality also gives absolutely accurate information.",
        "For about two months I have been looking for an app with such features and accurate information. With the start of using this app, my life literally changed. Because what I saw in the block section on Instagram was extremely surprising. It was the most surprising thing that my girlfriend blocked me from Instagram saying I don't have a social media account. One piece of advice from me is to check this feature.",
        "You can access advanced features that you won't find on Instagram from this app. When I first saw this app, I didn't think it would work so well. When I started using it, I was able to delete my Instagram profile by seeing those who didn't follow it and those who unfollowed it in direct lists. An advanced app that provides convenience for Instagram.",
        "The first time I used the app, I didn't think it would work so problem-free. However, with the app, I was able to access fast information as I wanted by using the app's profile reporting feature on my profile. The app's fast working system makes me happy.",
        "According to alternative Instagram reporting apps, my favorite thing about the app was that I could easily use its features. When I want to use the features of the application, I can get very improved and important information. I was able to constantly follow users who visited my Instagram account on any day."
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": null,
    "appId": "com.mystalker.profile",
    "url": "https://play.google.com/store/apps/details?id=com.mystalker.profile&hl=en&gl=us"
}