{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=com.instagram.android&rdid=com.instagram.android&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "I haven't been able to post or access my page in over 2 months. Instagram sends me emails about comments on my page but refuses to respond to my emails about my page not working. They couldn't suck any more than they already do. I've done everything they recommend and absolutely none of it works. At all. I'm seeing here that I'm not the only person having these issues with the app but clearly they don't care at all. Nobody's even here responding to the countless people here! IG U SUCK!",
        "Please fix the app. It's not loading anything on Wi-Fi and I have to keep resetting it to get it to work. Once I close the app, it's back to square one with the images, videos, reels, messages and stories not loading and it's getting really annoying. Please fix this, I can't communicate properly with my friends because of this.",
        "horribly unreliable and dysfunctional , just found out the infinite processing bug has been ruining other accounts in edition ours since november/december of 2021 and apparently despite being aware of this instagram has done nothing to fix it. this is not only impeding on everyday users but business acounts like ours are suffering. PLEASE FIX THIS!!! to make matters worse my original review was deleted off here for being \" negative\". Howre y'all gonna censor bad reviews but not fix the problem?",
        "Honestly this review would have more than 3 stars if there was reposting (photos, multiple photos, and video), built in to the app, so I wouldn't need to deal with all the shortcomings of 3rd party apps. And also, can there be a slightly more diverse color palette for font/drawing in stories? Maybe a color wheel that you can actually use to find just the right color. That would be great!!!",
        "Been using this app since 2013 and it has not crashed this frequently ever. This is really ridiculous. I just want to keep up with my art page and look at memes. Each update they have been rolling out in attempt to fix this crash is not working. I've been down since the beginning of February 🥲",
        "The only complaint i have is about the video calling feature, its too small because it's split screen. Other than that, i love this app and use it daily. Edit 2/13/2022- this app has given me LOTS of issues. It's been twice where i open it and it says \"can't refresh feed.\" I've tried uninstalling it and restarting the app but that didn't work. I've also had previous trouble logging in though that seems to be fixed now. I don't know what to do to get it to work.",
        "I love the Instagram app. However, recently I've been having issues on the \"Pixel 6 Pro\". I've had the six pro for a few months now and I've had no issues until recently. I noticed that I cannot open the application. When I open the app it shows the splash screen and then it closes again. I've restarted the device to the same issues. I will now try to uninstall and reinstall. Hopefully that fixes it. For now I'm using the PWA and it's working well for me so far. Good job to the team!",
        "I have been an Instagram user for over 8 years now. They were always my go-platform, but I've been unable to post for nearly a month now, and posting before that was like pulling teeth. Its absolutely unusable for an android user its ridiculous. I've reported this issue before with no response. If this isn't fixed I may just have to get rid of it and move onto other apps. Incredibly disappointing.",
        "I enjoy Instagram however I feel like my particular account has bugs or glitches. I'll try to upload a Reel or do certain things and it will time out or not let me post. It makes me crazy. I've tried reporting things a ton of times but nothing is ever really fixed. I'm at 18K followers so I don't want to start a new account and lose everything I've worked at to build. It's frustrating.",
        "Haven't been able to use my account at all. Just keeps saying \"can't refresh feed.\" I can't upload, talk to anyone, or look at anything. Hell even the filters don't worm. This needs to get fixed or I'm just going to leave the app until it does.",
        "Added a nonprofit business account and constantly freezes after processing forever. Can't even put up a story. Apparently from other feedback this has been an issue for some time. None of the four updates o er the course of the last 2 weeks have corrected it. I have to uninstal to do anything.",
        "The issue creating reels is getting to be more consistent. Once you try to add a second clip, the system goes weird. You can't edit the length of the second video/photo. You can't add any additional videos. You also can not trim the second clip. Since original audio isn't stored in an order which you saved them, ...ur stuck trying to remember the audio creator name or find the audio again.",
        "Never had a problem with this app until now!! It was working fine but all of a sudden my news feed never loaded, nor my profile, or anything else i tried clicking, it just said \"cant refresh feed\" or \"try again later\" I've already uninstalled the app and reinstalled it, I restarted my phone, i logged out of my account and logged back in and the same thing comes out.",
        "Horrible service. For about a week for 2 I haven't been able to send or receive messages or post on my account. Whenever I open Instagram it always says \"can't refresh feed\" or \"unable to send message.\" Update: STILL CRASHES-2022 Update: my account was hacked couple days ago and I've reported and emailed to Instagram with no response.",
        "Cannot post, whatsoever. It's been about one week for me, 3 months for others. Posts, stories, AND sending pictures/videos using the instagram camera in DM's does not work at all. It gets stuck on 'processing' and never moves. Vanishes when the app closes. UPDATE. re-installing did fix it, and the app looks different. It's like the recent update brought a bunch of bugs and it got stuck somehow.",
        "Poorly programmed and designed to look good rather than to work well. I keep clicking links and it hides 90% of the video. just shows this sliver of screen and then the video \"about\" text on an opaque background hiding the rest. Instagram has also started doing this thing where if it thinks you've been watching the same video for too long it starts nudging the next one up in the frame. **** off Instagram, I will decide when I'm done.",
        "I feel like Insta's quality of customer service has gone down after this metaverse thing. Lots of bugs on my alt account, no responses when I submit a report, no way to update other accs, logs out randomly when you dont have service, ect. But, there are good things about Insta & thats what makes me so frustrated about the bad things. It could be so much better if it had a little more personal attention.",
        "The kast few months I get problems when trying to make a post, where it says I just can't, and yesterday my business account reverted back to an older version of the app so I can't post reels, which is important for a small business to gain traction. I've also had issues trying to open a shop on there with no help. I've reached out and have not gotten a response",
        "What's irritating is that all of the good features suddenly disappeared on my accounts. The only emoji reaction I have is the red heart now. I can't watch reels, the reels option disappeared. My Chat Themes no longer show up. I've deleted and reinstalled the app, I've logged out and logged back in, and I even restarted my phone. Nothing happened. So I'm assuming the app is the problem and not my phone.",
        "The ui is overloaded. Muting on/off and play/pause seem to require the same action. Frustrating. Also, when I try to read long captions on reels, the screen bounces up to encourage me to swipe up to the next reel. It's as if the app doesn't believe I know how to swipe up. (I know the issue here is that they really just want me to consume more content, but the app itself is preventing me from consuming the content I'm trying to!) I can't click links in captions, either. Why?? That's ridiculous.",
        "This app is always glitching in some way, but most obnoxiously, it won't let me log in after logging out... all I want is to avoid getting a million useless and unnecessary notifications a day (which won't stop even if i go into the settings and turn off all notifications??), but now I'm locked out of my accounts and will probably have to eventually uninstall and then reinstall the whole app in order to get back in",
        "used to work fine. dms and everything else is fine, but I can't post. I cannot make a single post because it won't let me see anything from my gallery, it just says \"unable to load\" and all my pictures are gray. fix this please",
        "I was using Instagram for a while, and I updated my android os. After the update instagram was working fine for a couple of days, then when the app was COMPLETLY up to date, the app was outdated meaning some of the most recent features were missing. The themes for messages was missing, I couldn't react anymore, and the shop button was replaced with the original like button (before the like and add button were at the top right). Fix your app",
        "Its functional. Has people you can follow, message, interact and a decent search algorithm. Dont lose access to your account though. Had an account for about 5 years, lost the phone number and no sort of pictures resembling me or any other mode of verification gets me access back to my account with the absolutely USELESS support they offer. Nothing but \"sorry nothing we can do.\" Coming from Facebook, what else can you expect though.",
        "I am also experiencing the same issues with the feed not refeshing and taking forever to upload my posts. It just started happening all of a sudden in the last few days, and logging out/in did not fix it. I tried reinstalling the app last night and it was working, but when I checked this morning it was broken again. Please fix",
        "Terrible Months prior to today 2/11/22 on this Friday night . This is my new rating. Instagram has improved a whole lot. But it has room to get better. It has improved to schedule live shows , and a lot of other great things. But you need to improve on more hackers. So people can keep their accounts open and private at the same time. So as of February 11th 22 the store has increased to 3 star. Yes it also should be room for instance live shows like Facebook has. This will help IG improve as we",
        "It was working fine , then began to lag heavily 2/5/22... Now on 2/14/22 my account froze on me. I tried to log out then log in again and it said error couldn't refresh feed... Tried uninstalling and updating it an erasing history and catches date etc.. still no difference (can't load can't refresh feed ) smh",
        "Way to many ads, and page recommendations. I see more content from people I dont follow, than the people I do follow which to me is ridiculous because I follow 800+ people. In addition, these new feed changes are terrible. I miss the old days of instagram when the feed was in chronological order. This platform is slowly going down hill just like facebook.",
        "I notice others are having the same issue- any time i go into the app it says \"cant refresh feed\" with a black screen. Customer support has clearly done nothing, even though this has been going on for almost a week. Sad",
        "Whatever the most recent update was, it killed insta. Remember that time it went down for like a day and everybody was freaking out? This update is like that except it sometimes gives you one new reel or lets you loads your own profile and it's like a light in the darkness and then you realize the light was just a hallucination and everything is still dead.",
        "Solid app for the most part. The only frustrating thing I found was the inability to edit cover photos (thumbnails) for videos, although the feature is physically there. I can't understand why it doesn't work. Hope this is fixed sometime in the future. There also seems to be a hacking issue going around recently, which I find highly concerning.",
        "I can't access my account or start a new page and it never sends a code for verification. This app is trash. You can't speak to a real person to resolve the issue. Very frustrating and no one seems to care to address the issue. I have received multiple warning for violations that other people got passed by. I have received a warning for posting to my story what someone had on theirs. The algorithm is way too sensitive and perceives things as violations and it's not and it flags you.",
        "I love this app but it's been four days since my most used/most popular account stopped loading pictures, and despite reporting a problem numerous times, nothing has been done to fix it. My other two accounts are working fine. The lack of help is outrageously frustrating. I'm seeing some other recent reviews that also talk about loading problems, which makes it even worse. I can't even load the issue by \"shaking\" and have to do it manually - that's how stuck it really becomes. HELP",
        "I've been having issues with the app for the last 24 hours. It will load my feed ONCE, and inevitably crash a few minutes later; then, it won't load anything, not even my own profile. I have to uninstall and reinstall whenever I want to use the app. It isn't an issue with my wifi or account, so it's probably with the app itself, and none of the reports sent have resulted in any changes.",
        "Instagram is great but app is just okay. Could be so much better if you could save drafts and be able to access it from another phone or computer and not devise specific. Also it's annoying how if you ate posting multiple photos that they all have to be the same size! It would be nice of you could post vertical pics and horizontal pics without having them distorted. Also not a fan of their algorithm, before the big change a little while back we use to get sooo many more people seeing our posts.",
        "After I put in my password the app tells me it's incorrect. So I put the same PW in again. And AGAIN the app says incorrect PW. I put the same PW in again and then it logs me into Instagram. Other than that the app has NO PROBLEMS. I can post images/pictures, watch videos, leave comments and reply to someone else's comment. No issues at all. Thank you to those that developed the app.",
        "refresh!\" I'm not even able to log out, I was still pretty new to Instagram when this happened, it was so frustrating that I gave up months ago! My niece told me to try & uninstall the app & start it again, I've been hesitant because I forgot my password but a few minutes ago I decided to go ahead & do it & I came across all these reviews, I'm relieved to see that I'm not the only one having problems because I seriously thought I just didn't know what I was doing being new to IG & all, I see all",
        "I have really enjoyed IG until Monday. Ever since Monday when I go to open IG it pulls up and gives me circles where the story SHOULD be, but they are blank. Sometimes I get blurry pictures down below on the feed where people have posted things but I can't see them thank you very much. This has been going on for 4 days now. Finally today I can get on there if I delete the app and then reinstall it, but I have to do it each and every time that I want to get on Instagram. NOT OKAY!!",
        "I think this is the second review I have written, but this app goes more and more downhill every day. They need to stop adding stupid updates, and start fixing the problems they already have. I have to uninstall and reinstall the app at least 3 times a week because if I dont it won't let me post, I have an acc that needs to be posted on constantly and its like instagfam doesn't want me to use them. My drafts get deleted after a couple hours, and nothing works.",
        "My app stopped working. I can see stories and send messages but my main page won't refresh. I even get the \"new posts\" alert but nothing new will load. Has been stuck on the same post for like at least a day or 2 now. I tried completely restarting the app, restarted my phone a couple times, disconnected my phone from wifi and tried using data, I even deleted the app and tried reinstalling it. NOTHING happened."
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": [
        "com.instagram.layout",
        "com.instagram.igtv",
        "com.instagram.boomerang"
    ],
    "appId": "com.instagram.android",
    "url": "https://play.google.com/store/apps/details?id=com.instagram.android&hl=en&gl=us"
}