{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=com.post.maker.for.instagram.socialmedia.creator.postplus&rdid=com.post.maker.for.instagram.socialmedia.creator.postplus&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "App is helpful for Instagram use but the templates that they provide you cannot modify the way you want them there's only select things that you can modify on them what makes it difficult",
        "Barely used to make a few posts,all uploading my own images and using the basic blank template,and after making only a few posts now I'm prompted to have to pay for the pro version even though those are not options or templates I was trying to use",
        "Ugh...IG has been useless lately in loading my photo library. Saw this and wanted to try. Library loaded great, was all excited. But, it wouldn't let me select any pictures to add. Oh well 🤷‍♂️",
        "I've used this a couple of times now. It allows you to make the necessary changes to your satisfaction and once you save it you can then go ahead and post it from the App as well! I absolutely love this App and it's many different templates to download and use! I would recommend this App to anyone and everyone! What do you have to lose, it's free and if you try it and don't like it then you can just uninstall it, so what are you waiting for?",
        "I like it. I think it would be nice if you could layer photos so people could swipe through them on instagram, via one post. Other than that, I'm very happy with this application.",
        "My first time using it. it's easy to navigate & create posts. it's on the to subscribe list because what they're offering for free I can only imagine the templates for subscribers to use.",
        "The quality is super low!! I put a high resolution and high quality picture in one of your templates and after I saved it, its the most low quality pic Ive ever had!!! Thats unacceptable",
        "🎆An app that works easily (for us less tech savvy crowd) and makes my IG account pop with color, fun and uniqueness. I use it daily..such a vast selection of \"frames\" to choose from.✨",
        "Lots of templates even with the free version, and the pro version is fairly cheap too! A little hard to maneuver stuff around sometimes but definitely worth it",
        "I like it a lot. I'm building a brand on Insta and I want to leave a consistent looking feed on there, and this has helped me build that.",
        "This is a great fun app it's great for talking to friends and for getting to know each other it's absolutely perfect",
        "Just signed in not 5 minutes ago, already saved my first post. Very easy to use, easy to understand application. Must-Have",
        "Most (95%+) of styles are either locked or require the pro edition aka a paywall. Immediately uninstalled",
        "I wish the text could be animated!!! and i wish I could go back and edit something I saved! love it tho",
        "Easy to use. You have so many free templates to choose from. I would recommend 👌",
        "Kinda rubbish really. No background colour to your text. You can't try out their images to add colour to your post. It's just like writing with a pen on a white background. No thanks. Atleast make the writing text area more colourful.",
        "Please make it possible to use more images in a custom template or at least make it so that we can change background if the text fields so that text is more easily readable against the image background. But it would be preferable to be able to switch opacity on the text background without affecting the opacity of the text.",
        "Great app, easy to use, my only issue is that when am making adjustments on a poster the background changes an other item dissapeared but it doesn't happen often",
        "It's not working and I purchased the lifetime edition. I'd love a refund.",
        "Excellent app . I could make so many Insta posts thanks to the app. Where easy to understand and use.",
        "Great app but there's no way to save the templates.",
        "you can't resize the original image to default instgram post size",
        "Ads are annoying",
        "simple and easy",
        "Lovely app but can't change subscription from monthly to yearly :(",
        "amazing experience best is we get allot templates for free to use thanks team",
        "I'm loving this app. Little gem 💎 ❤",
        "Don't waste your money it doesn't work",
        "I pd for a template which popped up after paying never saw it again",
        "easy-to-use and nice background",
        "The App is amazing, but plz help out at the earliest coz since 1 week post update I'm not able to open the app itself. Whatever I do the app doesn't open. Plz help asap.",
        "Poor experience. Even for blank page we have to pay for it. Highly disgusting. Yesterday only I used black page & now when I opened it. It was paid. This is not acceptable. Make it available free. There are lot of inconvenience with app. Other templates u can hv paid but not the blank one. Make it free. 😠😠😡",
        "I’m having trouble reaching all my photos in my internal storage. App shows me only a few of my folders whenever I want to choose a photo. This problem started almost a week ago, before then I was able to reach all the photos in my gallery over the app. I must say, as a premium user this is very unsatisfying. I do like the app, but now I can not use it almost at all even though I paid for it :(",
        "Excellent free stuff. Looks professional. Only thing I would like to see is an additional image box option (like how You can add a text box to any template, it'd be nice to be able to add an image for adding logos / contact info / profile pic to templates). Otherwise I am throughly enjoying it & have received compliments on my posts asking which designer I am working with! Whooo hooo!",
        "tooooooooooo many ads",
        "This is the real game 🎯 Good work John 😊",
        "Really helpful app, I used it sufficently to create a theme within my business instagram account. It offers a variety of nice templates for free, and it would be worth it to consider the paid features in the near future as it's helpful and inexpensive! Also, you get featured when you tag their account, so that's a really cool plus!",
        "Just gave this app a try but it does not work well. Right after i download, the app run so slooooow. It took a few minutes before i get to see the preview of the themes. Downloading the themes took longer. Then when i was saving the photo, the app crashed. And now, i can't open the app.... Tried re installing it but the same thing happened.",
        "it's the best app I've been used",
        "I wish I was able to type more stuff. Like the posters can hold lots of information. It's a great app other wise better than alot that I have tried using. But I have spa menu's and to put all the information I need at a time the space isn't available to type."
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": [
        "com.circle.profile.picture.border.maker.dp.instagram",
        "com.highlight.cover.maker.for.instagram.story.creator.storylight",
        "com.greeting.card.maker.design.wishes.free",
        "com.scroll.post.for.instagram.panorama.caro",
        "com.no.crop.app.for.whatsapp.instagram"
    ],
    "appId": "com.post.maker.for.instagram.socialmedia.creator.postplus",
    "url": "https://play.google.com/store/apps/details?id=com.post.maker.for.instagram.socialmedia.creator.postplus&hl=en&gl=us"
}