{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=com.instagram.igtv&rdid=com.instagram.igtv&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "The main problem and the biggest problem this application will always have is not having the ability to upload in the background like a YouTube video would it's the reason why I don't use this application as much as I do YouTube.. fix the crashing and update it so that way I can upload videos in the background of my day-to-day life without having to start over from the beginning and then we'll talk igtv",
        "The app lets me search tags a few times before it times out and I have to restart the all. If I put the igtv app in the background to open another, I can't go back to igtv without it blacking out. My \"following\" section doesn't update to share latest uploads and there is no way to sort newest to oldest. I'll get the same videos under following for days before it updates. Even when going through \"following\" I'll get videos from people I'm not following. Also, PLEASE allow videos to pop out.",
        "It hasn't let me upload any videos in quite awhile. Plus when you open the app at the top rt is a +sign if you don't hurry up & click on that to add a video you need to go back out & come back in the app. But like i said it won't allow me to add a video anyway.",
        "I used to be able to upload videos with no issues .And as the past 2 months it's not letting me .They get clogged up .I have to uninstall and install it again .It's pretty annoying.",
        "Why does this exist? Before you could watch igtv through the normal Instagram app. Why do we need two separate ones? And why is there only 6 live videos available because no one wants to use this garbage app...",
        "I used to be able to upload videos to Instagram and Instagram Reels. All those features have been removed for some reason. Now it's just a spam you with what IGTV wants you to watch. It's a no, for me.",
        "I'm experiencing the same issues as many of the other users. Each time I log in, it logs me in then seconds later kicks me out back to the log-in screen and that continues in this loop. I want to use IGTV for content creation but I hope the hardworking team at IG gets it worked out soon as I'm sure they want it to work for us all as well. I also have a Note 8 if that helps at all with problem-solving. Thx!",
        "The audio isn't in sync at all!!! It makes most videos unwatchable! Fix it 🤦‍♂️",
        "IGTV SUCKS!!! I keep trying to upload a one minute video and it keeps crashing at 90%. Also, though in theory, you can add a link in the description, there is no way to see the descriptions of the videos. I don't get it. Why are they lying? The UI is terrible. Uploading is between slow and impossible. Take it down, go back to the drawing board and stop wasting peoples time with this garbage!!! I wish I could give it zero stars.",
        "I been having trouble uploading a video and it's been more than a hour and it's still not even uploaded, It's takes forever, fix this app!!!",
        "Not a very useful app for video-watching. I downloaded it hoping it would have a pop-up player feature, making it more convenient than the Instagram app for watching longer videos while doing other things on my phone. Seems like it's missing a lot of very basic features. It doesn't even give the date of when videos were posted, so you have no idea how old any video is. As it stands right now, I really don't see any benefit to using this app over the main Instagram app. 🤷🏼",
        "There is plenty of room for improvement, especially because this app has great potential! It already has many wonderful features, however it would be nice if it let us edit videos on the app it self, instead of having to download another app to edit videos. Since IGTV is a video app the app would be much better if it contained more video making aspects to it. IGTV is a nice app with a lot of potential and already great features, I hope you keep improving it though.",
        "Needs some serious overhaul. Whenever I got into the \"HOME\" page anymore it is constantly saying \"unable to load\". There is no search function and basically it just shows you what it thinks you will like based on what you have watched. I have uninstalled the app twice now and it's not fixing the bugs. There needs to be some functions added and the bugs fixed in order for this to work properly.",
        "I like the idea but the app is set up so bad. There should be a way to look up topics. Why can't I skip backwards in landscape view but I can skip forward. When in landscape view you can't do half the things you can in portrait, which sucks because most the stuff I watch is already in landscape. Also I should be able to follow accounts only on igtv and not have it show up on normal insta. Just is lacking some basic things",
        "I like the concept of put videos on a separate app however when videos come in I might not have time to watch right that second. I'd like to come back but when I go to the person's video libray I can't search for the most recent video they are ALL out of order. This is very frustrating to miss a video because they're not sorted. Please fix this on your end by giving user away to sort their uploaded videos to the most recent to oldest. Thank you!",
        "These glitches with Audio since 8/20 don't add reels if you can't. Basically some of us use IG for business not just to scroll and it's just not reliable. Am not going to upload video in one app to then transfer to another to have it have sound on IGTV. I have a life. We all do. If you are going to offer something and sell ads and what have you. At least provide something decent not glitchy not something that makes you waste 3 or more hours to out up a 6 minute video. Thumbs down ATM",
        "The app only allows me to view videos on the explore page. I try to play videos from ppls pages in the app but it plays random videos by other unrelated accounts. The screen does not stay on while playing videos. The app closes everytime I tap to try and comment on or like a video. Also, sometimes, it doesn't let me post a video I've recorded and it doesn't save so some of my videos have just been lost and I've had to re-record them. Edit: the app crashes and won't open now. *Sigh*",
        "UI so bad .. More importantly search results only show channels , not related videos .. but may be forgiving for just 4 month old.. but big company like Facebook should've implemented this carefully before releasing into public .. there are many more critical drawback like playing videos in the background of search results ( wth , it could cost tons of data charges ) .. navigation confusion , only vertical vids .. should release a new app a new name with everything fixed and more incentives for creators too",
        "The app is extremely glitchy. It doesn't like to work. At first it was fine but the longer I used it the more problems I came across weather they seemed to be there since I downloaded or were never there when I first used the app and just appeared and this stuff happens with apps but with igtv it completely ruins the experience and my opinion of the app continues to decline as my ability to use the apps features decline as well.",
        "Unfortunately, I had to uninstall this app. I thought it would be a seamless process to assist me in reposting and uploading video content coming in over the one minute margin. However, the app would not even perform the request to create a channel, which based on instructional viewing is the only way to begin sharing IGTV video. I do not recommend this app as yet until Insta or which ever entity is responsible for the dynamics of the app functionality workout the techs. Ergo, it's low rating.",
        "Won't load long video. I specifically select video over 60 option and when I select the video says it needs to be 0-15 seconds. Boo.",
        "The app is missing the most important feauture. I want to see videos of my friends replays when I first log in. Also my friends are extremely difficult to find in this. 3rd party apps know how to do thise mentioned features better. As a developer I am very disappointed in this app and all of its potential. I understand it is not the devs fault but the BAs and PMs.",
        "First install of this app and I can't even login. The current version is the first one I've used and it immediately kicks me back to the login page. EDIT: I finally got it to work. I installed an old version first (79.0.0.21.101) and then updated to the current version. I was able to login to the old version and I'm still logged in after the update.",
        "I started posting a video on IGTV at about 4 am,, and it is about 12:30 pm now and it STILL hasn't posted. My wifi is pretty good so there is no reason for it to not post, other than the app being faulty. Please fix this, I have some videos I would like to share with my friends.",
        "It's alright. It tends to get super laggy and for me at least, brings down the original video quality. Since I don't use it often I don't have much else to say other than the complaints about the constant lag and lower quality (and no the lag is not because of my phone)",
        "Instagram itself is definitely a five star app! I use it myself, mostly to keep up with what the world posts. There is absolutely no excuse for the lack of volume on IGTV! I'm just disgusted about it right now! Instagram needs to fix this stuff or just dismantle IGTV! I'm sad to say bye but I don't keep bugged apps!",
        "Pain in the a** I constantly have issues when trying to post videos. Once, it took almost 100 tries (no exaggeration) to post 1 video. It was a longer video so I guess that's why. And I'm not the only one with this problem. It is extremely difficult. If you post a video and it actually posts on the first try, consider yourself lucky lol Buttt, it's the only way to get lengthy videos on Instagram.. so it's either deal with it or just don't post long videos, I guess? Sucks.",
        "Ever since I had to get this app to upload videos, it won't work. I've tried to upload the same video 6 times now. It gets all the way to the end and then it says video cannot upload. My Video meets all of the requirements especially the fact that it is under 15 minutes long.",
        "Immediately gave me issues. When I scroll down the next video loads with previous videos thumbnail before switching back to the correct thumbnail. These kinds of simple glitches are enough to show the quality of the app. When you get to Tik Tok level I may consider .. and besides, what is the point of this app?",
        "So this app allows you to actually see some of your IGTV history, basically all videos you've just looked at, even from scrolling. I was hoping to be able see the IGTV videos that I've liked. Why is this feature not available? Especially since you can like the videos. Why can't we even see them like the liked posts in the regular app?",
        "It worked when it was first launched but subsequent updates have made it unusable. Videos get stuck on 99% and go no further despite how long I leave it. I may try this app again in the future but my experience has been less than desirable.",
        "Can't take heavy load , it crashes in one plus 8..... It happens multiple times , now I need to re write all the description and everything again",
        "Keeps repeatedly crashing immediately after opening. It let me sign in, and then crashed. Every few minutes I get notified the app has stopped, even when it was not active or in open apps. Had to uninstall the app within 15 minutes after installing. Edit: Using an LG V20",
        "Everytime I want to upload I need to unusual and reinstall the app. Pain in the arse. Theoretically a good app, but it only let's me upload 1 video. Anything after that I get a bogus notification, \"Will upload when there's a better connection.\" I got full bars, dumbass. Call me when it's realistic.",
        "IGTV is too picky with the videos it allows you to use. It gets hung up at uploading with any video from my go pro. It only basically allows for videos from my cell phone camera. I am going to stick to YouTube for videos and photos for Instagram. Also YouTube will pay me where IG trys to charge me.",
        "My videos keep skipping & gets worse overtime. I keep sending request to fix the problem but to no response or help. Very disappointing👎",
        "I uploaded a landscape video on IGTV and it only plays in portrait mode cutting out more than half of my content. I think there should be an option for content creators to choose the orientation they want their media to play in. And after all these months IG still has no response for this!",
        "Just downloaded today. Uploaded a video. Absolutely no sound. Like, not even a whisper of audio. Plays fine on IG, until it exceeds the time for the IG platform. Crazy about all the glitches, on the most up to date version of the app.",
        "It crashes all the time when I try to edit a post. Once a post is up you can't edit it. I also can't upload from my Google photos anymore so if a photo isn't on my phone, I have to download it to my phone to upload onto instagram. Annoying",
        "I've uninstalled the app and given up hope of it ever getting better. Everytime I log in it kicks me out, seems like this is a common problem with other users. No point in downloading this app if all it does is take up space. Fix your app please."
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": [
        "com.instagram.android",
        "com.instagram.layout",
        "com.instagram.boomerang"
    ],
    "appId": "com.instagram.igtv",
    "url": "https://play.google.com/store/apps/details?id=com.instagram.igtv&hl=en&gl=us"
}