{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=instasaver.instagram.video.downloader.photo&rdid=instasaver.instagram.video.downloader.photo&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "Tried other apps that worked well enough to purchase them, after purchase the appz went bad. After thousands complained updates were made but problems were not fixed. I had to look for something new and great. This is the one. There are a lot of ads in the free version but this app is still usable, I did however buy the lifetime subscription and so far no issues. Over all I give it a 4 star only because some basic options aren't available like choosing a default D/L directory.",
        "Can download from links you generate from Instagram. Despite logging into your Instagram account, you can't navigate to your friends account to then try to download. Some stories don't have the \"share to\" option, so can't generate a link. Holy ads. I understand the ads to generate the number of downloads you can do. But the forced ads just from navigating menus is just greedy and atrocious. Uninstalling based on that alone. $20 price tag to get rid of ads. Not worth the price tag.",
        "Great app! The only thing that would make it better would be if it saved items with the poster's name in the file name like similar apps do. And if the premium prices were lower I might stop CONSIDERING paying for premium and actually PAY for it.",
        "It's good seems to work well not issues with logging in. When saving it makes two folded one for video other for pictures. The main issue I have is I wish it would include the account name in the saved file.",
        "Garbage. Filled with ads. You need to watch ads after every 12 downloads. The downloads are filled with shady buttons to make you click on them. Terrible app. Im uninstalling.",
        "It works, but when it saves the pic or video it puts like tons of letters in stead of the person name? Instagram still detects their app as a third party browser and after so many time it bans your account? This app has potential but needs more work.",
        "So far so good. I let go of one app that started great but bugs kept me from using properly. This app doesn't have those issues. Thank you.",
        "Had my account hacked and thought all my progress had been lost forever 😩 this app made it possible to retrieve all my lost photos, videos, etc. Great job 👍🏿",
        "Paid $12 for Premium to remove adds. Still have adds. Edit: Ads went away after opening and closing app several times as suggested by the editor.",
        "Horrible! Tons and tons of ads and it would not log me into Instagram even though my connection is perfectly fine! Trash, don't waste your time.",
        "At first, the free version had the annoying advertisements. The paid version is free of that. Does what its supposed to do.",
        "So far so good. You have ads but then 6hrs of free use. I think that's a fair trade for free use.",
        "Great app. Would like to have naming options though, like adding the name of the account to the file name.",
        "This is an awesome app cuz it does exactly what it's supposed to with no issues. In addition it's quick and easy.",
        "Login to Instagram doesn't work. I get a password error even though the password is correct.",
        "I gave 5 stars because this app is nice. No problems and the videos download with the same beautiful quality. Plus they devs deserve it. 🤟😎",
        "It's been a couples months since I installed I can honestly say I use it almost everyday. It's very efficient. Ads are annoying yes but it's not that bad especially for all the services I've noticed you're getting for free. It's the best Instagram downloader app I've come across in some time I've been trying a few",
        "Used to be great. Then the bugs got worse. Downloads started failing with \"server is unstable\" errors randomly. Now you retry the download due to the server unstable errors and it gives you an error that the requests are too frequent. Yeah they're too frequent because your app is broken and won't download on the first try. What a disaster.",
        "This is a great app, you share from Instagram to this app and it downloads. The adds are a bit of a pain but they have to make money for their app..and once you watch one fairly long ad (30 secs?) you get 4 hours with no adds so you get a few commercials then one longer one then no commercials for 4 hours . The adds are a fare trade off for the functionality you receive and of you wish you can pay 2 bucks a month for no adds. Can't beat that value, I highly recommend this app.",
        "There are so many ads & they each last so long. Then the caption wouldn't copy.",
        "It is easy to use, I wish they had a purchase link so I don't have to deal with the ads all the time it is very frustrating I changed my comment from 5 to a 2 because... Some days there are four or five ads right in a row and then other days it'll allow you to download one or two times till you continually see ads and aren't able to download very frustrating looking for another app",
        "Reliable, unobtrusive advertising. Works as expected every time.",
        "Used to work flawlessly. Now it keeps prompting me to login even after I already have multiple times, it doesn't stick. Doesn't even download anymore now so it's essentially useless.",
        "Love this app no water mark and not a lot of ads like it used to be loving this app",
        "Share to app doesn't work at all. Copy and paste of URL works sometimes.",
        "Been good experience after buying it but After downloading to many in bulk it says I'm downloading from null. Don't know how to fix",
        "Pretty good app. I can download videos and post them anywhere I want. It is an awesome app to use.",
        "Pretty good and the ads aren't always all over your face🤭👊🏾",
        "Jan 14th, This app works great, it downloads where other fail. 5 stars Nov 29th update: developer seems to have worked on the Ads hijacking the phone, I will up my review to 4 stars. App Works fine but some Ads hijacks the phone. Avoid if possible. Update: Nov 13/2021: Gave 3 stars as the developer promises to manage Rogue ads to avoid hijacking the phone.",
        "Great app but too much ads!! I understand the Dev needs the ad revenue but there should be a limit to how many ads are being displayed. There are two to three ads showing in average with each download. Please fix this!!",
        "It's ridiculous that I am inundated with ads when trying to just look at things, but when I try to watch a video to get the 12 downloads, all I get is loading failed. I have tried for minutes on end, several days in a row, and still get loading failed.",
        "Was worki g great. But now keeps saying failed instagram is unstable. Not sure what to do. Hopefully someone fixes this. First review below: Absolutely the best video downloader. Does what most say they can do and a whole lot more. Recommend highly to anyone. Thanks for a great app.",
        "Excellent straight forward app. Lots of ads, but even so, it works perfectly. Even tradeoff in my eyes.",
        "It works... but SO MANY ADS make it unusable. You have to wade through ad after ad after ad. The app is too annoying to use.",
        "So far never failed me, very excellent application. Again and again never failed me, i love it. Why every time i try to download a video, a message pop saying (Detect failed: Instagram Server is unstable. Please try again later)",
        "This was working fine in the beginning but now I have to use the copy and share button twice and now I can't download anything . The response here was pretty weak check your internet connection. Now it's saying the server is not available?????",
        "The ads have recently become increasingly annoying, but still a good app overall. I especially like the feature where if you leave it running in the background while you copy the link to a post, then it will automatically download it.",
        "Best reposting app so far! Edited Upgraded phone from a Note 9 to the Z Fold 2. Love my (paid) app, but now I'm seeing ads. 😡 UPDATE 12-06-21 NOT SURE WHAT HAPPENED TO MY/YOUR APP, BUT EVERY TIME I USE IT I MUST VERIFY MY ACCOUNT, WHEN I DO, I END UP BACK AT THE FIRST PROMPT SAYING I NEED TO VERIFY MY ACCOUNT. IVE ABSOLUTELY TRIED EVERYTHING TO GET THIS {{ PAID }} APP WORKING AGAIN. A LITTLE HELP?!",
        "$20 for lifetime premium is ridiculous and that being the only option thats not a monthly payment is also ridiculous. Other than that, if you dont mind the annoying ads, this app is ok.",
        "Wow the ads are numerous to say the least! It's complicated because of the number of ads popping up you hit the wrong thing! Don't waste your time!"
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": null,
    "appId": "instasaver.instagram.video.downloader.photo",
    "url": "https://play.google.com/store/apps/details?id=instasaver.instagram.video.downloader.photo&hl=en&gl=us"
}