{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=instagram.downloader.download.videos.photos&rdid=instagram.downloader.download.videos.photos&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "Really great app for Downloading and managing Instagram Photos and Videos. The ads aren't too obtrusive and only pop up once you open the app after already copying the link from Instagram. It does the downloading itself once you open the app if you enable it in the settings, and all you have to do is watch the ad for like 5 secs. Not bad at all. They have a ad-free premium version but I don't see the need to get it. The ads aren't that bad.",
        "This app will only download about half of the IG videos that I try to download. About 50% of my attempts result in this error message in the app: \"It seems that Instagram has modified their code again and the response could not be parsed. Try to download again. If it still doesn't work, please report this link to us and we'll fix it as soon as possible.\" I have since found another app in the app store that works 100% of the time.",
        "This app was nice in the beginning. Now it's not letting me share videos to Instagram. It says the owners shut down the platform and people have to log in. I was already logged in I should not have to re log into the app. I'm gonna search for a better downloader app and delete this one.",
        "Going to give it a 5 +...... With this caveat.. ..we'll see what I rate it in a few weeks .. because it seems like Everytime you find a great app, somewhere down the road it will, or they will change/update it and it will make it worse.... Time will tell",
        "Fantastic App! Makes saving a series of Instagram posts, or Stories a breeze. I especially like that the file name it outputs includes the IG account name so I can remember where the image came from. Thanks to the developers for a most excellent tool for those that love saving images for inspiration... 👍",
        "Absolutely love that I can retrieve any of my insta posts when needed. Since after I post i remove them from my phone. Amazing app. Works super smooth.",
        "It's a curious little piece of code. It so far SEEMS to work consistently, how it holds up after a few months we'll see.",
        "Great App Love It ,It's Fast And Really Easy To Use.I would recommend this app to everyone who want a fast and Easy to use app to download Videos and Pictures With High Quality Resolution From Instagram.",
        "Great app! Very quick ads, easy to access. Don't need to provide hardly any personal information! Downloads images spectacularly. Definitely recommend this app!",
        "Too many ads, that the download ends timing out constantly. If you don't mind trying again it ends up working",
        "This app is horrible after I download the. Video it takes like 3 whole hours to download and show the video on my phone like what fix it now",
        "Love Love Loveeeeeeee this app! It's been consistent and reliable for me since installing years ago. I'm in for the duration",
        "Too many ads. The app is good and easy to use but the unskippable/ timed ads are really annoying. Overall, a good app though. Gets the job done 👍",
        "This app is the best thing. Just copy the link and paste it to the thing and you'll have in your camera roll,but there is too many ads but it's still a great app ❤❤👏👍",
        "I definitely recommend it for stealing memes lmao. It surpassed my expectations of it and it's way more streamlined than other apps, I would prefer if there were less ads though.",
        "Works well, especially in spite of what Facebook ( meta ) has been doing to Instagram lately. 02/08/2022",
        "Enjoying the ease of use. One step to download a pic is great.",
        "For some time, this app keeps getting rejected by Instagram. Shame. It had been till recently, the best I had found. Guess I need to go looking for another one 😔",
        "It's definitely worth it. 5 second ads which is not hard to stand.",
        "Great app easy to use and fast as all hell. I don't know why it took me so long to find this app 🤦 now I'm always using it. Highly recommend it 👌",
        "The previous Downloader I was using stopped working so this app really helped me out. Super easy to download Instagram posts",
        "I like it, it can download pics and videos with no problem, and it's also easy to use.",
        "So far beyond my expectations, well done dev team, I can download any type of content without login, that's terrific 👍",
        "All I can say that this app is great and it make can things easier for you just like that it like clicking your fingers",
        "This app isn't perfect since it restrict you from downloading from private accounts or restricted url stories.",
        "I am beyond impressed. This application is far better than I hoped and expected it would turn out to be. The quality of the images and video clips are absolutely outstanding. My compliments to the developers.",
        "This very cool doesnt have many ads and it is easy to use",
        "This app is ok but it wants $3 a month? That's a little ridiculous when you can get similar apps that work just as good for $4-$5 one time upgrade. The free version of this app plays an ad every time you want to download something. That's a little excessive.",
        "I thought I was the only one having that problem but apparently many people are running into the same issue about network problems all of a sudden. This app worked flawlessly but two days ago something happened and I thought it was your new one but evidently not",
        "Sometimes It's working, sometimes not! It says network problem, It's not reliable.",
        "2 issues I had before I unistalled it. 1: if there are multiple pics on a post it won't let me choose which one I want. 2: I had so many spam likes and comments on my repost less than 5 minutes after. I'm still blocking spam accounts. Ridiculous!",
        "Legit really good app. I really like the features and ease of use of this app. Even the ad version is tolerable. 👍",
        "Love this app!! One of my go to downloads when I need to reset my phone. Easy to use and pics come out great. Highly recommend",
        "It works well. Tried the free trial and the \"Auto-Download\" didn't work as expected (I thought it would ripban account). Actually, Auto-Download doesn't work at all. Every single time I get a network or connection error when it's enabled. Canceled the auto knew on the subscription, cuz this definitely isn't worth subscribing to. If it was a one-time payment for a few bucks, 𝙢𝙖𝙮𝙗𝙚. But only if the auto-downloader actually worked.",
        "Good enough. I had an earlier version. Now the ads are too much. I get it, one needs to get paid but man, it sucks.",
        "This app is amazing! The interface is awesome, I really love that it groups downloads by photos and videos,or by the account that posted it! As well as you don't have to sign in. To anyone reading this, definitely prefer this instagram downloader over others,with its ease of access,and convenience,it's a must download!",
        "Worked absolutely fine the first few weeks. Now it doesn't download the videos even after saying \"download\" complete.",
        "A life saver!! I have multiple accounts and it helps that I can pull old videos and post them elsewhere. Same for photos, but I mostly use it for video. I love it, and I've never had any issues. 10/10 would recommend. ♡♡",
        "Awful. Log in, can't download directly from the app. Had to switch over to Instagram, and share to the app. Share picture bt picture. Time consuming. Instead of the other downloaders that you download from the app, even search for users, and grabs a cover picture from a video. Lame.",
        "Awesome app, easy and straight forward. I will rate it five star in few weeks..."
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": null,
    "appId": "instagram.downloader.download.videos.photos",
    "url": "https://play.google.com/store/apps/details?id=instagram.downloader.download.videos.photos&hl=en&gl=us"
}