{
    "title": null,
    "description": null,
    "descriptionHTML": null,
    "summary": null,
    "summaryHTML": null,
    "installs": null,
    "minInstalls": null,
    "score": null,
    "ratings": null,
    "reviews": null,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": null,
    "free": null,
    "currency": null,
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": [
        null,
        null,
        [
            [
                [
                    [
                        null,
                        [
                            [
                                0,
                                "USD",
                                ""
                            ]
                        ],
                        null,
                        [
                            null,
                            "Buy"
                        ],
                        null,
                        1,
                        [
                            null,
                            null,
                            null,
                            null,
                            null,
                            [
                                null,
                                null,
                                "https://play.google.com/store/apps/details?id=instagram.video.downloader.story.saver&rdid=instagram.video.downloader.story.saver&feature=md&offerId"
                            ]
                        ],
                        null,
                        [
                            "CAE="
                        ],
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        null,
                        []
                    ]
                ],
                [
                    "Install"
                ],
                null,
                [
                    "CgYKBENBRT0="
                ]
            ]
        ],
        null,
        [
            [
                null,
                [
                    [
                        600
                    ],
                    null,
                    [
                        604800
                    ]
                ]
            ]
        ]
    ],
    "androidVersion": null,
    "androidVersionText": null,
    "developer": null,
    "developerId": null,
    "developerEmail": null,
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": null,
    "developerInternalID": null,
    "genre": null,
    "genreId": null,
    "icon": null,
    "headerImage": null,
    "screenshots": [],
    "video": null,
    "videoImage": null,
    "contentRating": null,
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": null,
    "updated": null,
    "version": null,
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "A lot of ads, but that isn't the problem. It'll work fine for a week, then boom. \"You need to login to download this post, because it's a private account\"... But, none of the accounts I'm saving videos from are private accounts. What a very obvious attempt to steal my account information. Don't fall for this stuff and give these people your account info! If you do, change your password asap!",
        "This app actually works (at least at the moment) unlike 3 other Instagram downloaders on my device (all of which I actually paid for) but the adware has become much more aggressive and sometimes long pop-up advertisements are difficult to close after you sit through them. I was really tempted to give this a lower rating because of the frustrating adware but since the app is still working and being updated I decided to be generous even though I normally avoid Adware apps.",
        "I really like this app. I'm able to download my favorite kpop idols stories. It's super easy to use. I highly recommend.",
        "I have had many downloading apps for Instagram and this is far the best one no hassle no glitches just pure download an easy irate this up 100%",
        "Ads ads ads Please offer a paid solution and you will make more than serving ads. I work in IT for a buisness website and it works better than this. Why do you serve 2 ads everytime I download a video. Some have 3close buttons one after another.",
        "Its great until it informs me i cant copy vid from private acct. And need to need to log in to copy vid from somebody who has a private acct. Even though i am logged in and a accepted follower of said private acct already....it's lame as all get out. But when it works it is ok . Lets see what the big improvements are that come with update.",
        "Great app! The ads are a bit annoying but it does what it says it will do and I always have a lot of success with it.",
        "Really amazing easy to use, no stress app. Still using this app after a year now and it's still just as good as the first time.",
        "There's too many ads and it won't let you get back to the downloader after they are over. Annoying",
        "All saved reels are non retrievable! Makes running a business on this really hard now I need another app to save videos id like to post as reels!",
        "I really appreciate Apps that make my life easier... I've been using this App and probably the version before with no issues. Yep, the free version has ads, but for the quality and effectiveness of this App, I can't complain. Really easy to use, great App, love it! 👌",
        "Even when I log in, it gives the error \"Instagram Eervers Are Unstable\" while they are working properly",
        "This app is so wired. As you rate them, they start to kick you out of the app. Or stuck you in downloading. Make sure not to rate this app.",
        "Perfect; beter than past versions, where you had to do the downloading yourself. This version does the whole thing automatically for you. Kudos to developer (s). Thank you!",
        "Used to be very convenient and worked well. Now it requires login, which is fine, but gives errors once you login. Developer doesn't respond to hero requests.",
        "Usually works great but past few days it says 'instagram server is unstable' even though instagram is working fine. Please fix soon!",
        "Just tried this app for the first time and it's claiming every video \"was deleted\" and won't let me download it. I tried different posts and different hashtags and refreshing my page but it keeps saying everything is deleted when it's not????",
        "Works well, has ads but great fubctionality. I just watched a ton of ads at once. Thanks for the solid program.",
        "I found out that with this new version of the app, I have to click on the Instagram photo/video link, copy the link then click on the downloader app to download. Before, I just click on share and then click on downloader app.",
        "So far so good, we'll see how far it goes. of course I have an issues. When after download failed, there's caution it said \"it seems that Instagram has modified their code again and the response couldn't be parsed. Try to download again. If it still doesn't work, please report this link to us and we'll fix it as soon as possible.\" I won't give you five stars until this issues doesn't appear anymore.",
        "This is my first review of any app. This is the best app if you want to download reels, videos from Instragram It doesn't ask you to login to your account, you just need to copy the video link and it will be automatically saved in your gallery. There is minimal advertisement, like one if you open app 4 times in a day. Best & user-friendly app it is. Kudos to the team who have created this.",
        "The app worked neatly until a couple of weeks, now even with the recent update everytime i want to open a feed item being a photo or video it says 'failed to get data', also when sharing from insta to the app being a feed or a reel it shows the same message and it cannot be saved. Besides, when trying to watch igtv it says 'network error'",
        "Used this app, a week later i get a \"suspicious activity on your account, you've been locked out of instagram\" warning. Had to reset the password. Since then my account has also been @mentioned in a load of spam posts/accounts, i think they were trying to use my account to click farm.",
        "Its amazing app download completed within 1min but the biggest prob is in this app is lots of ad which appearing to ruin time , i hope you will understand the value of time and concern to make less ad in this app...",
        "I really love this app i wish it can download video thumbnail. And also images with the user id. The problem i have with this app is that it has too many ads and it doesnot automatic download the video after coping the link in background sometimes i have to coppy the link twice or more to get it download, imagin you copied a link and it didn't work so when you tried to coppy it again and the home page refresh and you don't know which page was that post from.",
        "I rly like this app it's free and easy to download in other insta vid downloader apps I can only download 3 vids and then I had to buy the premium which takes money from my account . But then I found this app and its brilliant it's totally free I didn't have to pay just copy link the vid I want and paste and then boom I have the vid In my gallery but the thing is just that it always shows one ad for one vid but its worth it . If u want to have free insta vid downloader I highly recommend u this",
        "Need to change the log in rules to download the stories and highlights and many more. I guess log in details should not be the priority for downloading ones own stories or highlights or reels.",
        "I wish l could give this app quarter star because l tried downloading a video and it came as a picture and l was thinking it could be a mistake but it still continues the same way.This app is really bad.",
        "I've used it once and it's already asking me to rate it, but just the fact that I can 2-click download a post inside instagram, is deserving of 5 stars.",
        "Another update. I was able to log in to Instagram so now l can copy and download video's off Instagram. I did have to enter my password but hopefully it's ok!!!",
        "It's perfectly working. ads are little bit annoying. Downloads are easy and quick.",
        "the best app where ads come but it works smoothly and for me it is best , i don't think you should update this more.",
        "I've tried some other apps but this app has a great feature of catching the copied link and auto download. You can use it for hassle free downloading and sharing of Instagram Videos.",
        "It's very awesome app but after updating, app is not working. This app is not opening whenever I touch the app icon it opens but after few seconds it closes automatically.🥴 Please help",
        "It is an amazing app.....When I was not knowing about this app I had problem with downloading my reels but now I can easily download my reels......U should definitely download this app🙂",
        "Its a very nice app. I have used many other apps to download instagram stories but none was better than this. I am really happy.☺️",
        "What the heck is happening with this app?! I wanna download the video and the app download only the image... Gotta be kidding me. This is a bugs, please, fix it.",
        "Great 👍👏 but 1 thing i don't like the thing is - first copy the link and and go to the app and download very lengthy and other app only copy the link and download started! Please update soon as possible",
        "The app was good ... But after few days.... It won't work anymore.... When i try to download.. It shows error or retry.... Plsss do something",
        "it's a great app i can't complain and it downloads faster..the issue is that i does not allow me to download story"
    ],
    "editorsChoice": false,
    "similarApps": null,
    "moreByDeveloper": [
        "facebook.video.downloader.savefrom.fb",
        "tiktok.video.downloader.nowatermark.tiktokdownload",
        "all.video.downloader.etm.videodownloader"
    ],
    "appId": "instagram.video.downloader.story.saver",
    "url": "https://play.google.com/store/apps/details?id=instagram.video.downloader.story.saver&hl=en&gl=us"
}