{
    "title": "blue",
    "description": "The sequel to my 'yellow', 'red' and 'black' games is here!\r\nCan you make the screen blue in 50 levels?\r\nEach level has its own logic.\r\n\r\nDo you need help? Use the light bulb button that will appear after a while in the top right of each level to get a hint. \r\nThere are multiple hints for each level.\r\nWith the premium unlock in-app you will not get ads before the hints.\r\n\r\nA Bart Bonte / bontegames puzzle game.\r\n\"Mobile Game of the Year\" winner at the Belgian Game Awards 2020.\r\n\r\nEnjoy!\r\n@BartBonte",
    "descriptionHTML": "The sequel to my &#39;yellow&#39;, &#39;red&#39; and &#39;black&#39; games is here!<br>Can you make the screen blue in 50 levels?<br>Each level has its own logic.<br><br>Do you need help? Use the light bulb button that will appear after a while in the top right of each level to get a hint. <br>There are multiple hints for each level.<br>With the premium unlock in-app you will not get ads before the hints.<br><br>A Bart Bonte / bontegames puzzle game.<br>&quot;Mobile Game of the Year&quot; winner at the Belgian Game Awards 2020.<br><br>Enjoy!<br>@BartBonte",
    "summary": "blue, another puzzle game for you!",
    "summaryHTML": "blue, another puzzle game for you!",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.700422,
    "ratings": 15524,
    "reviews": 801,
    "histogram": [
        587,
        130,
        195,
        1502,
        13110
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$1.99 per item",
    "size": "17M",
    "androidVersion": "4.2",
    "androidVersionText": "4.2 and up",
    "developer": "Bart Bonte",
    "developerId": "6731838628059519714",
    "developerEmail": "bontegames@gmail.com",
    "developerWebsite": "https://bartbonte.com/",
    "developerAddress": "Bergstraat 17\n9880 Aalter\nBelgium",
    "privacyPolicy": "https://bartbonte.com/privacy_blue.html",
    "developerInternalID": "6731838628059519714",
    "genre": "Puzzle",
    "genreId": "GAME_PUZZLE",
    "icon": "https://play-lh.googleusercontent.com/GNb54czIXuuZ4UFCmBbXJt7abXFWhp42MyEZUOdjcwz735Fk_O467E9lTuoRmz5XvdI",
    "headerImage": "https://play-lh.googleusercontent.com/e9No4hFzmOgrPqmP5Qe1fRT4QrHDxFxguhXLFW_hAPuJFR0o31wJ9IuyD7t_StG5KPY",
    "screenshots": [
        "https://play-lh.googleusercontent.com/sPqvqlKGo_xSP6i_FNpseggJc4yyqV5FIqJaQ7OxIG2L9cc1HophlPb02YsAjwrhRlE",
        "https://play-lh.googleusercontent.com/QD_V1G1Y0c1VRVAfGHVaYlaHpxZilQ7YJRt_bNfxZXBKmlTezSZV56r4H8Dh_HcPzXk",
        "https://play-lh.googleusercontent.com/SMmIDMSUbM20ahWvufeE31M7htVE7YZg_q9DVuKVPbdpP1fLVhyDootalhGdt7Np2J4",
        "https://play-lh.googleusercontent.com/qKQtZs-tl78CeZ7VZC8T7vR90HAalLrUNRBe3SE3c_e7di6hy4myOutTbWJS69uQg_0",
        "https://play-lh.googleusercontent.com/BSURcBXNUnmsBAmMTeyC3wiQuL9Gr1aAY9y2IS8q0My_SEO5Lr8-KoY_HrgS7lgadgb8",
        "https://play-lh.googleusercontent.com/RAEHrv8YhZDNUufdx3gViV857Cy_iHfDEZRId4xyIy0xWu8JmQueUGsvm6ek4X0lGEiO",
        "https://play-lh.googleusercontent.com/aWimIQ714g8Q2gu_xmsWBgtYWCoNeLjKOPA3s7g0psTysfqVBw3CaHvxBZWdCzvE8lI",
        "https://play-lh.googleusercontent.com/9pZSTPUZVFtCoTdaaAPlBmY4ykvI-Na159P32n3Ml-SZZTtaWRxRGb9L7ULT3ZrXNWU",
        "https://play-lh.googleusercontent.com/nKp94KyX-eXZh-u_a6xSpkz3AB7L4ZWxIQnfzlkpcKYxq6dq_xfNwNlClvrmhbefCVk",
        "https://play-lh.googleusercontent.com/diCxRibTf6Sce792F3hFCXqLnBNu21ARUxhPxxF-tjxsbFWME0dVnVcaHGHig2_R9Dg",
        "https://play-lh.googleusercontent.com/N8EuF6hlJN1J2uu67J6PiI5YfNGJOdCKs0QkVhrav88vQynfcp5c3Wo6o_5BacY2IJY",
        "https://play-lh.googleusercontent.com/_4ETn3ARgTMETEJBO8_d1Lq0FbMsNj3JApCwyLqyYsb0aLhk0WhmD5m6HQOdibSccug",
        "https://play-lh.googleusercontent.com/qIeohqP3UbGIqNgX0pQeqxRJZNfsQqbdaJp9l54mIRyQdEZJLFchXOpvYSv-Es778r4",
        "https://play-lh.googleusercontent.com/hLTkSfM8n8d1xPO8DookDtp5CUuxfguDx1fnRSGVEEZsvRjS2QJUFPC5r_Y_UVQYRlc",
        "https://play-lh.googleusercontent.com/m3e2dODngpgZd5NzlhTCNX4J_G_sQcyLNEorhdZbVpuZAQ3jpjI8ZxfEXuvH4S9D0jI"
    ],
    "video": "https://www.youtube.com/embed/mxej_j8i4o8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/e9No4hFzmOgrPqmP5Qe1fRT4QrHDxFxguhXLFW_hAPuJFR0o31wJ9IuyD7t_StG5KPY",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Jun 17, 2019",
    "updated": 1638179736,
    "version": "2.6",
    "recentChanges": "A blue puzzle game for you!",
    "recentChangesHTML": "A blue puzzle game for you!",
    "comments": [
        "Original and thoughtful game. Puzzles get harder and harder but there are only 50 Puzzles which is a good thing since the game does not burn you out. Highly recommended.",
        "Another wonderful game by Bart Bonte. Thanks so much for your creativity! As with all of his other color puzzles, it is definitely challenging and requires you to think outside of the box. Sometimes the levels have a theme which helps! The only time there are ads is when you use a hint. Overall, great puzzle game and I can't wait for the next color!",
        "Really not sure why people have such a problem with this. The levels are each unique and challenging, but not \"broken\". None of these levels require hints to be solved, you can figure most of them out with a bit of experimenting. The ads are non-intrusive, only showing up when you tap the hint button, and most of them are skippable after 5-10 seconds. If this game is challenging for you thats fine, but don't rate it poorly because you needed a few hints. I really don't understand the hate.",
        "Whenever bart bonte releases a game, I get so excited because they are so fun to play. It's filled with logic puzzles and there are even hints when you're stuck. Sometimes it can be frustrating since some levels are more difficult to figure out, but I can always solve it after I give my brain a rest. There are some people saying that there are many ads in the game, but there are none that disrupt the gameplay. The only ads that you see in the game are when you ask for hints, the ads aren't long.",
        "I finished blue and enjoyed it so much I had to play it again. There's an option to remove the game data and start all over. The levels are the perfect amount of difficulty and are fun to play as well. There's no ads unless you ask for a hint. There isn't even a pop-up asking for a rating and review. Bart really knows how to make a great gaming experience. Definitely recommend downloading the game. You won't be sorry. Also try red, yellow, and black. Black's music is my favorite so far. Ty Bart!",
        "A fun challenge! I noticed others complain about ads but I think they're reasonable. If you quit to restart a level, you watch a five second ad. If you ask for hint, you watch a 15 to 30 second ad that you can't skip if you want the hint. I never got an ad as I progressed through the game but perhaps I didn't play long enough at once. I didn't usually need to use hints but found them helpful when I did. You'll get multiple hints per level (that I experienced) and each gives you more guidance.",
        "A great game! A word to anyone trying to play: this game hardly requires hints, which is where ads actually come in. Experiment. Take some things as visual cues. I had some minor trouble on level 48, but other than that, it was pretty easy. Was about a 23 minute game going at a leisurely pace. Great job, BB! Thanks for the work you put in and for not being another VOODOO with the ads! For those of you complaining? It's a fun brain exercise, not a final exam. Don't get mad over it. Take it easy.",
        "Bart Bonte did it again! 💙 My daughter and I are working on this one together. We are only doing one per day to make it last longer :-) Level 11 was confusing because it didn't actually turn all blue. Is there a glitch? We are having so much fun and my 7 year old is always begging me, let's play blue! 😍 thank you Bart! You're the best!",
        "This series of games has always been fun and entertaining to play! The puzzles are interesting and the optional hints are a great touch! The music in each one is similar yet with it's own unique twist! These games have inspired me to make my own games, too! I love the minimalism of them, and I've been playing all your games ever since I was really young and it's always an amazing experience to find a new one! I've always wanted to say thank you for making wonderful games! I hope to see Teal soon!",
        "Very enjoyable. Challenging puzzles, just difficult enough to be interesting, but not frustrating. Watch a short ad for a hint. Multiple hints available each level. Some are less than helpful, but just ask for another hint. Easily completed in one sitting, but still very enjoyable. Just go download the next color when done. Unique puzzles every level. Some are similar, but include a new twist. I definitely recommend trying these out.",
        "Very fun and quick game. The app listing says their are ads and in app purchases, but I never ran into one. The game consists of a series of different puzzles using a dozen or so different mechanics and each is presented as a unique setup. It was 50 or so levels in total and was an hour or so of entertainment. The short levels made it a great time filler in the deadspace between meetings today. I can't see it offering any replay value, but I'll probably check out the dev's other games.",
        "I always get excited when I see a new Bart Bonte color game come out, and blue is no exception. All of the puzzles are difficult enough to make you think, but not so hard that you sirens a ridiculous amount of time on it. All of them vary in difficulty as well, so it's not just getting harder every level. Take that and apply a minimalistic theme of painting the screen one color and it makes a fun experience. I'm excited to find the next color already! Green? Purple? White?",
        "I love all the puzzle games they make. No matter where you are you can play any game they make and feel good and not bored. Please make more games so I can be entertained and other people can to. btw I love that you respond to all the positive feedback it makes my day when the creator of something notices there fans, so thank you.😊",
        "I hope you make decent money out of these games because you deserve it. Absolutely fantastic puzzle games. The ads aren't intrusive and only there if you need a hint which was a great idea.",
        "Always excited for a new game in this series. Blue, like the others is clever in each puzzle. Each game is just the right amount of difficult, so its still fun and rewarding to figure out while still not enough to make you quit all together. The music and the atmosphere all the games have just put you in a mood to go through the challenges. Blue is just the thing ive been waiting for and Ive shared it with my friends to play as well. I hope more keep being made, even if it take the whole rainbow",
        "I'm always excited when I see a new color game is out--Bart Bonte's games have never disappointed me! no matter what mood I'm in they bring a smile to my face, the whole experience is just plain fun. The music is snappy, the puzzles are challenging but not so difficult that you just can't figure them out (though I am am avid puzzler so your mileage may vary). Thank you for once again brightening my day--I can't wait for the next one! (no, really. please hurry ;-) !!)",
        "Absolutely engaging and fun puzzle game! There were a few levels where I had no idea what to do until I saw the hint (stuck on level with the reversed letters until I saw \"The name of the game\"). There are a lot of \"Aha!\" moments in this game and being able to solve the levels just by thinking and tinkering with them kept me engaged more than any other mobile game. Also, that last level was really fun",
        "tbh idk why people in here so upset. there are no ads unless you use hints and so basically as long as you're not goofy and need hints all the time then you're never gonna get ads. well designed game and the puzzles just take a little bit to figure out, good time passer. lowkey wish I could write some of the negative reviews back because they're all just a bunch of idiots who cant figure out a simple puzzle. like sure 15 is hard but do enough tapping and you'll figure it out. ✌😂",
        "Very fun, fast paced, and a cool puzzle game. Overall a great game although I do wish that there were more levels and different things to use other than just the touchscreen like using the camera, if there is something close to it, or if you shake your phone for a level where your volume had to be changed to affect it, or what could be really interesting is if there was a level where you needed a certain temperature an had to stick your phone in your fridge. Though the game has a great astetic.",
        "If you've played Bart Bonte's other color based games, you're not in for anything innovative. Still a fun concept, and I enjoyed playing it, but this one's not as polished as the others. The hints are just instructions, they bluntly gave away the answers to the ones I was stuck on, and the same puzzles are reused from time to time. Felt shorter than the other ones too. Honestly, five star game on its own, but taken as a set with Black, Yellow, and Red, this is the weaker of the series.",
        "YES!!! I've been waiting for another color in the series I'm excited for the next game to come out. I like how this one was different puzzles but the same concept. That's kinda been my favorite part of this series, but I do wish there were more levels but it's alright I've always kinda liked it being short and simple. I have a few questions though if you can answer them. 1.When will the next one come out? 2.Whats the next color? 3.How many more colors in this series? Its okay if you dont answer",
        "I love this new one! Loved Yellow, Red, Black and now this one. Each puzzle is fun to try and figure out the solution without using hints. I did pay to support the creator because he always makes good games. Keep up the good work. If you're reading this I suggest trying the other colors. They are all very well thought out and creative puzzles. If your looking for a fun game then look no further.",
        "As someone who has beaten this game as well as the whole series I can easily say this one is my favorite as it is just so much fun. I can't say there are many puzzle games that give me a real challenge but is games does it I really do get happy when I beat a level. If you enjoy puzzle games and like a good challenge this game is perfect for you.",
        "Another good puzzle by Bart, like previous games: yellow, black, and red, there are brand new levels (obviously). But after finishing the game, I feel like the levels are little more straightforward than require more thinking, which itself is not bad, but some level are quite easy to overcome, but still satisfying. Surprisingly, he still use the same song like the previous three which I thought he'll make a remix or something for this time but nothing to complain here. A good puzzle game :)",
        "I'm a big fan of puzzle games. The ability to challenge your mind with an approach. Most of them I have played have charmed me with memories but no other puzzle game have charmed me more than the 'color' game series by Bart Bonte. Each level while just having the simple goal to make the screen a simple color, have many different ways, and you are going to find each way how. Bonte never disappoints with little themes for the 'color' series. Which color is next... To be continued?",
        "Yaayyy! The next one is out! I love every one of these games. They are literally the only games I play on my phone. I have yet to check out Bart's non-colour games, but I'm sure they're great, too! The only thing I'm bummed about is lvl 50. I was a bit off, and the answer seemed a bit inconsistent, TO ME. That's literally the only thing I can say about this game. Keep making great stuff, Mr. Bonte! To be continued...? Purple...?",
        "Okay, so I'm not used to leaving reviews but I've played all the games and I absolutely adore the games. I find some a bit challenging but the hints always get me through (that and random clicking.) BUT on top of that while reading reviews I noticed Developer responded to a lot and even offered help to those who struggle. I really appreciate someone who interacts with an audience and clearly these games pull in a dedicated fan base. Absolutely perfect, not only in game but in the community also",
        "I rarely write reviews, but...I LOVE your puzzles, Bart Bonte. Whenever I see your name, I flip! 😁 I discovered your puzzles when I was 8 years old when I played \"sugar, sugar\", \"Factory Balls\", and \"40x Escape\". I love how your puzzles are hard, but not frustrating and how every level is different. Is the next game in the series \"green\"? 😂 The only bad thing is that the game never lasts long enough! 😂",
        "Great game, epically when you have nothing to do. It also doesn't require internet for the gameplay, but I feel like it shoud have more than 50 levels though. For me It took a couple days (not consecutively playing of course) to complete it. Im downloading the rest of them. Good luck!! 😁",
        "Blue is another wonderful game of Bart's color puzzle series. I just finished it up and can tell you it has many different puzzles from the others, yet has its own world of mini challenges that set it apart and make it fit neatly into his already fun series. Never have I downloaded something so fast. Thanks Bart for the good times from me and my family. Looking for that next color up, GREEN!",
        "Ive played through all these color games so far and they are all nice brain teasers for 50 level, free games. Most low star ratings are from those unable to find the pattern or fun in finding patterns. My only complaint is that levels like 38 and 26 often repeat across these game and only change in slight mechanics, also the last level i enjoyed the concept but in practice was not fun to play. Overall i liked the new puzzles from blue and await to see more unique variations",
        "4.5 stars. I think it is a fun game with really cool puzzles. It takes a bit of time to beat the game. However thats enjoyable because I can play it in my free time. I didnt give it 5 stars because this one felt a bit rushed and not as different as red or yellow. Its fun and im waiting for the 6th color game.",
        "Bart Bonte, the man, the myth, the legend, does it again! Yet another delightful color themed set of puzzles to complete. The puzzles are simple yet elegant and the music is great as ever. Safe to say Bonte's newest game leaves me far from feeling blue.",
        "Another great game from the \"color\" series. Last time I said I was expecting a blue next and it happened. I'm assuming green is next? Also I have an idea for a gray one where at the end it reveals that you've been colorblind and the last 5 levels it's rainbow cause you fixed the color blindness.",
        "Five stars, just like every other game of yours! It's been a while since I last played one of your games, so when I looked you up today I was pleasantly surprised by not just one but two new games! I quite enjoyed level seven, it reminded me of a big fish eating smaller fish. Anyway, great game, keep it up, I look forward to seeing what green holds!",
        "I don't wanna sound like a broken record but these games give me life. They're challenging, fun, and the music is amazing. I would definitely recommend these games to anyone who actually likes a real puzzle and loves works of art. Thank you for making these games, Bart! Keep it up, I'm curious what the next color will be.",
        "Its amazing! I just finished up red but I have completed yellow and black also! Its very unique and brilliant and fun to play around with! And my favorite thing is when I need the hint the ads are like...really short!! UwU Thanks so much for creating it. And I insist on you playing it! <3",
        "Love this series of games. Some may argue the not being given clear parameters on how to solve each puzzle. I like to think part of the puzzle is figuring out the controls. Its really neat and you get the hang of the style of puzzles after a while.",
        "Very well-designed. Five-second ads give hints, and the progression is a mostly even ascent. Certain levels are killers, though, and really highlight the need for an option to skip. Some players *will* find their play grinding to a halt with no recourse.",
        "This game is awesome. The 5th color of the series that I've played (mind you I played the colors out of order), but still, GREAT GAME. Each level gets more tricky as you progress which makes it that much more fun, a great feel of accomplishment after completing each color. Thanks for making a great series Bart Bonte!"
    ],
    "editorsChoice": false,
    "similarApps": [
        "air.com.bartbonte.red",
        "air.com.bartbonte.green",
        "air.com.bartbonte.black",
        "air.com.bartbonte.yellow",
        "com.smgstudio.onemoreline"
    ],
    "moreByDeveloper": null,
    "appId": "air.com.bartbonte.blue",
    "url": "https://play.google.com/store/apps/details?id=air.com.bartbonte.blue&hl=en_US&gl=US"
}