{
    "title": "Party in my Dorm: College Game",
    "description": "Hang with your crew in the best college game ever. Tear up a house party, collect swag, chat with cute girls, flirt with your favorite eboy, or just chill with your best friends. You can roleplay, send gifts, adopt a pet, decorate your room, or even start a relationship and go on dates!\r\n\r\nLove college chat games with avatars? We have tons of avatars! You can be a Kpop star, a muscle bound gym daddy, a playful brat kitten, an Emo DJ or just a house party hero and many more!\r\n\r\n✓ Decorate your college dorm room like your inner designer desires. Whether your style is Skate Park, Japanese Anime, VIP Lounge, or the Dark Arts - you can have it all and take part in dorm design contests!\r\n✓ Rent out dorm rooms and hire a squad, then upgrade their skills and challenge other squads to a dance fight.\r\n✓ 1000+ avatars to choose from - like Sorority Girl, Frat Bro, Vogue Fashion Fanatic, or the girl who loves Pumpkin Spice a little TOO much.\r\n✓ What’s your sign, baby? Aries? Gemini? Up your zodiac game with #aesthetic items in theme of your zodiac sign!\r\n✓ Start a relationship, then break up to find someone new.  Be single or date around and get personal. Your college love match is bound to be more exciting than any dating site or dating app!\r\n✓ Group chat is more fun with college chat games! You can roleplay, send stickers, ask the magic 8 ball, spin the bottle, and more!\r\n✓ Adopt a pet like a pug, a goose, or a rabbit. Dress them up in cute outfits. Sorry, Joseph Gordon Rabbit, do it for the gram!\r\n\r\nSchool is in session... Now let’s ditch class and have a house party!\r\n\r\nPLEASE NOTE:\r\nThis is an ONLINE casual MMO game! Tablet users must be connected to the internet or WiFi in order to play this game.",
    "descriptionHTML": "Hang with your crew in the best college game ever. Tear up a house party, collect swag, chat with cute girls, flirt with your favorite eboy, or just chill with your best friends. You can roleplay, send gifts, adopt a pet, decorate your room, or even start a relationship and go on dates!<br><br>Love college chat games with avatars? We have tons of avatars! You can be a Kpop star, a muscle bound gym daddy, a playful brat kitten, an Emo DJ or just a house party hero and many more!<br><br>✓ Decorate your college dorm room like your inner designer desires. Whether your style is Skate Park, Japanese Anime, VIP Lounge, or the Dark Arts - you can have it all and take part in dorm design contests!<br>✓ Rent out dorm rooms and hire a squad, then upgrade their skills and challenge other squads to a dance fight.<br>✓ 1000+ avatars to choose from - like Sorority Girl, Frat Bro, Vogue Fashion Fanatic, or the girl who loves Pumpkin Spice a little TOO much.<br>✓ What’s your sign, baby? Aries? Gemini? Up your zodiac game with #aesthetic items in theme of your zodiac sign!<br>✓ Start a relationship, then break up to find someone new.  Be single or date around and get personal. Your college love match is bound to be more exciting than any dating site or dating app!<br>✓ Group chat is more fun with college chat games! You can roleplay, send stickers, ask the magic 8 ball, spin the bottle, and more!<br>✓ Adopt a pet like a pug, a goose, or a rabbit. Dress them up in cute outfits. Sorry, Joseph Gordon Rabbit, do it for the gram!<br><br>School is in session... Now let’s ditch class and have a house party!<br><br>PLEASE NOTE:<br>This is an ONLINE casual MMO game! Tablet users must be connected to the internet or WiFi in order to play this game.",
    "summary": "Congrats ur accepted! The hottest college roleplay game's house party is on now!",
    "summaryHTML": "Congrats ur accepted! The hottest college roleplay game&#39;s house party is on now!",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 3.7641869,
    "ratings": 117420,
    "reviews": 22458,
    "histogram": [
        23769,
        6032,
        9384,
        13163,
        65072
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$0.99 - $99.99 per item",
    "size": "61M",
    "androidVersion": "4.1",
    "androidVersionText": "4.1 and up",
    "developer": "A Thinking Ape Entertainment Ltd.",
    "developerId": "A+Thinking+Ape+Entertainment+Ltd.",
    "developerEmail": "support@athinkingape.com",
    "developerWebsite": "http://partyinmydorm.com",
    "developerAddress": "200 - 1132 Alberni Street\nVancouver, British Columbia\nV6E 1A5\nCanada",
    "privacyPolicy": "http://www.partyinmydorm.com/privacy.html",
    "developerInternalID": "5801618728690151470",
    "genre": "Casual",
    "genreId": "GAME_CASUAL",
    "icon": "https://play-lh.googleusercontent.com/-A1nl9XFom-xH7Q8MOahY9bgdLnp8YinUpkveb1GIRl0KtNtC0K0eZxqEdgfaRJpbFBB",
    "headerImage": "https://play-lh.googleusercontent.com/FHNaDW2KNT0YHAmuMOKfBgldKt2X7rBUDnNanLeFgUzcR9kMAFpAK5u6qjDwxMtsz8I",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LRcMCTdlJFL4KlUmuWjTgabIG-vyFFb3qTzU74X_EGI5vQ82VmzwDo19Q6sCgRy6OcuN",
        "https://play-lh.googleusercontent.com/gIwWWSvOIqVbLfTD4B8cjm8znranfhHmOfIkYJ3EYn5nwJ03yyhYuybZ-K6ceLcuTA",
        "https://play-lh.googleusercontent.com/ZxZ9D0gQxcZpP30SIL-GK-jqihwujz7XM9bvzEkSobamB4_RDJANmSJxZ7rEdrZDTBI",
        "https://play-lh.googleusercontent.com/3GkX_PGmpRGr2p4lCGGz1P4eq73UjQ_DDV66AWuAqcHqQirgd-Y7-uSt03hjpfcVzco",
        "https://play-lh.googleusercontent.com/Bpg_4qUXWywvgvvZmpOL-TBfUytKluYv-tdyMnbl_SStcP8I90SqBh3flsnFcnhxscI",
        "https://play-lh.googleusercontent.com/KX96Cx31X6uiJ8W7BZ9tdQBHIz3SPYxk0WuZeEUIp5BiVJswRSmgAJJzUeJnW7Wfmw",
        "https://play-lh.googleusercontent.com/Wxr1FGNBmS8c-NvrO2_cIk8WM6nGvq_B56AeV5QnXwHsIJgcMtMr9_Gose0H_zVjln8",
        "https://play-lh.googleusercontent.com/TmZeXOmpkgRf1Y4ov1XqJHJMdCM5y9NxEkwQe2T8oJtqeWq4cS8anfyR5V-n_33rNIs",
        "https://play-lh.googleusercontent.com/TSLLByDOEMQ8q-48IFzgihBlcbi7gcQJhLlPapJit19VW6oia7i7zBN39D_Sq3rJiQ",
        "https://play-lh.googleusercontent.com/eAHLt-Gur9PZ5K6ytbDiVVsAwuQt8V8FIYzWnKTwrtG0751wewG3Sql1OqeOsZUR8EQ",
        "https://play-lh.googleusercontent.com/64LKufV-cT0QMPC851ykKlW1VCgRQdMT8ZjIl93rDFlNJw2Jbx3cCVGMko5weoeSB24",
        "https://play-lh.googleusercontent.com/DJssxbjDpLrj51HqTDNMSW1zroteyaHRpNgwFJTTrVU1sePbXPH0EuqSqyzOH74WmvY",
        "https://play-lh.googleusercontent.com/WPGFtTsbsZW9Hr4Pv8B-Px-N8baFvdPqQ0l7rbZUiSFNYS6jYtpRDfO5ImIBj2EH8-k",
        "https://play-lh.googleusercontent.com/C0j9ouzcSJrwQ8E57sQnBLXt4E7i6Up7MQIBSzx6OaJq9hbek2CwK9F9CZig8xmpIl3v",
        "https://play-lh.googleusercontent.com/Pn8wZt4zD6xPhMszQ-ZRRjejOq89S3IAAzFKxHdct1tdfxpZ6PMMvrKahHGq8i05HF_t",
        "https://play-lh.googleusercontent.com/7f4PiRchxo-udQWoLmgQIw_i1DsDuobi9vHw5A5qVz5WAEMC2pngDenjaHWknHokBHM",
        "https://play-lh.googleusercontent.com/0Ib-P25ujYR5wlrHGPr9aNkewVwq4zEgT-P4u2844ooX7hbIYdvzX9rrLGy9ZqWpRPU",
        "https://play-lh.googleusercontent.com/xxi-8SUf8Jjz3iRSxGF7vNk2j_xZZKgfs77LY_H-rTW4UThThe17T4g_7F7wwCuGGA"
    ],
    "video": "https://www.youtube.com/embed/qze_ZauVa-k?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/FHNaDW2KNT0YHAmuMOKfBgldKt2X7rBUDnNanLeFgUzcR9kMAFpAK5u6qjDwxMtsz8I",
    "contentRating": "Mature 17+",
    "contentRatingDescription": "Alcohol Reference, Sexual Themes, Strong Language",
    "adSupported": true,
    "containsAds": true,
    "released": "Aug 22, 2012",
    "updated": 1645738333,
    "version": "6.39",
    "recentChanges": "Here's what's new in PIMD:\r\n- We squashed some bugs that needed squashing and improved some things that needed improving. ¯\\_(ツ)_/¯",
    "recentChangesHTML": "Here&#39;s what&#39;s new in PIMD:<br>- We squashed some bugs that needed squashing and improved some things that needed improving. ¯\\_(ツ)_/¯",
    "comments": [
        "The biggest issue of the game is the bullying. I know of two other persons who are the target of the same person who pick fights with us daily. His CS is higher than hours but yet he's able to attack us and when we attack it says 'defender is too weak', WHAT THE HELL! Several reports have been made for the last 3 days and nothing came out of it. Why have the option to report if reporting DOES NOT WORK. Take time to address this issue like how you took time make this game extremely unbalanced",
        "Seriously broken in game economy, hard to play as a free player. Help will not do anything if you are being bullied, which there is a lot of in game. They will just tell you to find someone else to protect you. Blocking/reporting people does next to nothing. Would not recommend as a fun casual game.",
        "Game crashes and glitches too much. A lot of ppl have the same glitch happening. One of the known glitch is when everything disappears besides your furni and stickers. Haven't gotten decor boxes the last few hunts even though I was on LB. Also known to charge a bigger amount than authorized purchase price so a hassle to correct that. Avis seem like they're recycling the designs and you never get anything good from the spinner. Monthly spinner items seems rigged bc 1 out of 4 is always so rare.",
        "Pay to play. Just to completely decorate your room you need to pay $100+ for it. I have this game for over 2 years now. There is no good way to earn extra credits. Using the get free crefits options gave me spam emails and phone call. This game need to drop their prices down, it's not even 3D. Most 3D games with physics are 50% cheaper than this 2D game.",
        "Allow me to sum up this game in a few short words... (ahem) Incredibly toxic, pay-to-play popularity contest. Forget obtaining decent avatars and items for your dorm unless you plan to shell out major $$$. The majority of the tasks for this game require you to be in a club, and if you're not on this game 24/7 prepare to be kicked for \"inactivity\" because how dare you have a job or get some sleep. Takes \"horny on main\" to a whole new level 100% of the time. Basically, don't waste your time.",
        "Ive had an issue with bullying in the game become frequent too the point where it was almost impossible to play. Ive reported these players daily and yet the bullying persists. I play the game to have fun. Not for people who play longer than me to put me down, harrass me, and make my time in this game difficult. Added edit: after reading the response, ive lowered my rating. Theres a huge difference in PVP and bullying and the fact the devolpers cant tell the difference is baffleing.",
        "My phone updated and I now can't access either of my sccounts. My login has been disabled so I can't create an account to write a help ticket. I was using the built in disconnect feature to switch accounts and have been for a long time. Now I'm lo ked out and can't access help. Playing for 4+years",
        "This game sucks tons of people who just want sexual stuff a lot of 10-13 years olds nobody gets punished after being reported the dorm prices are high you cant get into ec partys without paying money to get a cat or pizza or money dog rare to get them through lite boxes takes a long time to get avatars not a lot of ways to earn money what happened to Wars? This is basically pay-to-win game I've been playing for 3+ years I uninstalled it for the past 1 and a half now I see why I did",
        "\"You have attempted attempted to use the same device to access multiple accounts. Your login has been disabled\" ...... I've never played the game before XD",
        "If I could give zero stars, I would. I log on only to find out my account has been \"expelled\". I don't even know what I did to cause it either! I can't send an in-game help message to figure this out.. 😡",
        "All right what can I start about this game oh it's pay to play. There's also the amount of horny people on this game that will try to get into your pants even though they live across the freaking United States. It's really hard to do anything in the game unless you have a lot of money. If you are not going to change how people talk to other people then you are going to lose everybody that plays this game so unless you change that then I'm not changing my stars I hope nobody downloads this",
        "Only problem is you cant buy anything with the money you make and the layout and graphic for the party feels cluster together. I try to pay for EC and DN and the game keeps rejecting my paypal and my visa because the atupid new google pay are having issue. I cant buy what i need",
        "The game is not very welcoming to new players. The game has a tutor system and it is set up in a way that allows veteran players to harass a new player by continuously hiring any tutor they buy.",
        "Too many people harassing me on there. The Dev need to take these problems very seriously! I've been playing for about a week, and if I friend anyone, I am pretty much guaranteed to be harassed or hit on, both of which are very disruptive to the game play. Edit: In Game Help is Literally BROKEN",
        "great game but the mods are horrible, got premenently silenced for nothing after I was already silenced if you're looking for something to roleplay on try zervo way better than this money grab pile of trash",
        "Well, it was good. For a while. I uninstalled it, and decided I wanted the app back. So,I try to install it. The installation stopped at 68%. I understand, that this may not be the app itself, that it could be my device, but...still.",
        "I'm highly upset a close friend of mine can't get their account back. He tried fillng out the info and don't understand his account is still hacked yet you make him waste his time filling out 10 damn questions? At least there are other games that can solve problems faster than this app. Not everyone has access to the purchase. Stop having him fill it out and give him his account he worked for 3 years on. Jesus.",
        "I started playing this game today and within the first 2 minutes of playing, I got NUMEROUS people asking for nudes, to pay for disgusting acts, asking how old I was, asking for personal information and snapchat name. There is no way to report a player. It's literally a front for sexual predators. Do not play it, do not let your kids play it. It should honestly just be taken down.",
        "You can't really do anything in this game if you don't have money for anything cool. This game is pretty boring if you don't spend money on it which is super dumb and unfair tbh.",
        "Leaving a 1 star because my account had been expelled for LITERALLY no reason at all .... I was hitting a party in my club and then the game tells me to force quit so I do . When I come back its says on the opening screen \" your pimd account has been expelled due to a violation to the terms of use \" so what ... is hitting parties IN A CLUB I OWN!!! BAD NOW !? please fix this problem 😐 my account is @temperance",
        "I got this app to be social, I personally recommend not installing. You will get silence for the most dumb reasons. People report me for saying or asking a simple question, yet whenever someone says something either the same thing or worse they go completely unpunished. The people on this app are very horned up, sensitive, hypocritical and toxic. I wish I could give the app 0 stars. I got banned for repeating what someone else says and they're still active. Devs. are on top of it. Pay to play :/",
        "Not only does it state that it's a singleplayer game here as I am reviewing but it's got people using alts and pretty much being toxic about how their alts are. If it weren't for the forced interaction between it's players and the fact that it states that its a singleplayer game where I am giving this review my review would most likely be higher. Otherwise it's decent for the content it's got.",
        "I've been playing this game for a while now. All together 7+ years. I do have a main account and several alt accounts. It used to be my favorite game on my phone. But after spending HUNDREDS of USD..I'm disappointed. Unless you spend money on shards (or take forever collecting them) you may not get the avatar you'd like. To give an example I prefer / want the female avatars. I personally have no use for the male ones. You no longer get both M/F avatar options. I keep getting male on the hunts.",
        "I love this game. I really do but the game has a bad problem with its players and a lack of accountability. I've decided to delete this game because in the past day or two I've had two other players harass me, try to intimidate me, and even threaten me. Blocking and reporting the accounts doesn't really do anything to help and this game has had a negative affect on my mental health no matter how fun it is sometimes. It's a very toxic community most of the time because of players like them.",
        "Ive been obsessed with this game for years! Dispite a lot of negative feedback, this game is super fun and really engaging. You DONT need to buy credits and a lot of higher players will help you earn in game currency and other things that help make the game more fun! Also compared to other games its fairly easy to earn valuable things worth trading to earn in game currency (chibis) you get free boxes, furniture, and you can even earn chibis with the spinner game! I forever will love this game (:",
        "I've not made any changes or updates, and this app keeps crashing at open. It was working this morning, but now, a few hours later, will not open. There have been no updates in the app store, so I have not made any changes between when it was working and now. Please fix. It says \"PIMD has stopped\" every time I open.",
        "I NEVER leave comments on apps like this but this game is a waste. Spent time and even a little money to enjoy it and get banned for no reason. No explanation. Can't even contact anyone or use the help button to figure out what happened. I regret ever playing this dumb game.",
        "until recently my experience over the years with different accounts even has been great. I recently got silenced permanently for an honest mistake on my first incident ever. I tried to appeal, but since im silenced or something I can not send an appeal through the in- game support even thought thats the only way to do it now. if there was another way to contact support for issues I would change this review",
        "Its fun, though sometimes its not very clear where you should click, but otherwise a good game. The visuals are clear and well designed, I haven't been bombarded with ads as of yet, and overall a fun click adventure game.",
        "I love the game but there are some men taking advantage of kids in a bad way like the player Rachs has asked little kids for pics. Also the game screen on my apple devices suck. I can't see my whole room and there is a margin on both sides of the screen that is blank of all picture. You have been told months ago and have yet to fix it. So I feel you don't really want our opinions to make changes. Just like earning free extra credits only Android people can earn them free apple people have to pay",
        "AMAZING! This game is really good. It's really confusing, don't get me wrong, but once you get it it's addictive :) well, to me it is.",
        "Uninstalled the app and the process to retrieve my old account was a lot of work, and was still unsuccessful. The game itself is okay, can get a little weird/creepy sometimes with weird people but if you find the right kind of people it's pretty fun.",
        "I was going to download this app but I saw all the reviews and most of them were about inappropriate behavior so I don't wanna get harassed and when I saw the ad and adorable baby's I thought \"Hey those baby's are cute\"but I always look at the reviews first so I'm not downloading it untill you guys fix all these horrible behaviors I'm sorry",
        "So far I'm loving it. The chat, clubs, campus and other socializing formats are helpful with figuring out what to do next. Still learning as I go, but definitely recommend if you're into college themed games.",
        "Good game but would give 5 stars if the moderators actually enforced their TOS on bullying and people being sexually inappropriate. I have filed tickets which have been ignored. Love the game otherwise.",
        "This game sucks first when I just downloaded the game it seemed fun then people started being rude and my other problem is that I don't a have much money and when I asked my parents for money they said no car as I said we don't a have much and I had to pay for jewels witch was the only way to buy decor for your dorm and I had 0 so they should have a way to earn jewels but over all my experience in this game is a 0 stars but you can't do that so a 1 star rating",
        "It's good but boring 🙄 I like it kinda it's really confusing 😂 I would recommend it if you like these kind of games or try something new and download it see if you like it or not because I am new to this still and it's really good so far so I rated it a for I hope this helps you a little bit I know this comment is kind of confusing but yeah it will be confusing the game yes it will but once you get used to it it's kind of not that confusing bye now",
        "This game is awesome!!!! I've been playing it every day one thing I wish there was tho is that it would be dope if your club could go against other clubs and there be a ranking system for that like who could party the hards idk lol",
        "Love this game, but can u please bring back where the activity, under managing a person in a club, comes back red if they're inactive for too long?? Thank you!",
        "I don't know what people are talking about, it all depends on who you talk to and which clubs you join. The more you play, the more you can get stronger and see the players who care and who are kind. This game always has something new up their sleeve and manages to make the community better than ever. I love this game and I probably spend a lot of money if not, more on this game. It's something you should definitely download and play. Its a good game to relax and enjoy."
    ],
    "editorsChoice": false,
    "similarApps": [
        "air.com.smeet.smeetmobile",
        "ata.kraken.singlecity",
        "world.playme.mechat",
        "com.ludia.lovelink",
        "com.woozworld.woozworld.app"
    ],
    "moreByDeveloper": [
        "ata.kraken.heckfire",
        "ata.kraken.singlecity",
        "ata.squid.kaw"
    ],
    "appId": "ata.squid.pimd",
    "url": "https://play.google.com/store/apps/details?id=ata.squid.pimd&hl=en_US&gl=US"
}