{
    "title": "iExit Interstate Exit Guide",
    "description": "iExit tells you what's at upcoming exits when you're on the highway. It uses your device's location to determine where you are on the highway, and then displays upcoming exits in real time.\r\n\r\niExit Search is powerful and dead simple. Search the next 100 exits for businesses (like Starbucks, Cracker Barrel, or KOA Campgrounds), amenities (like WiFi, Playground, or Truck Parking), rest stops, hotel deals, and much much more.\r\n\r\nYour GPS will tell you how to get there. iExit will tell you where to stop along the way.\r\n\r\nDon't believe iExit will change the way you travel? Ask The New York Times, USA Today, Consumer Reports, CNET, MacWorld, The Today Show, ABC News, and many more. Here's what CNN had to say about iExit:\r\n\r\n\"Do you have enough gas to wait until the next town? Is there a bathroom coming up any time soon? Need to buy a tent at Wal-Mart? The iExit app will tell you exactly what lies ahead.\"\r\n- CNN.com\r\n\r\nDon't take another road trip without iExit!",
    "descriptionHTML": "iExit tells you what&#39;s at upcoming exits when you&#39;re on the highway. It uses your device&#39;s location to determine where you are on the highway, and then displays upcoming exits in real time.<br><br>iExit Search is powerful and dead simple. Search the next 100 exits for businesses (like Starbucks, Cracker Barrel, or KOA Campgrounds), amenities (like WiFi, Playground, or Truck Parking), rest stops, hotel deals, and much much more.<br><br>Your GPS will tell you how to get there. iExit will tell you where to stop along the way.<br><br>Don&#39;t believe iExit will change the way you travel? Ask The New York Times, USA Today, Consumer Reports, CNET, MacWorld, The Today Show, ABC News, and many more. Here&#39;s what CNN had to say about iExit:<br><br>&quot;Do you have enough gas to wait until the next town? Is there a bathroom coming up any time soon? Need to buy a tent at Wal-Mart? The iExit app will tell you exactly what lies ahead.&quot;<br>- CNN.com<br><br>Don&#39;t take another road trip without iExit!",
    "summary": "iExit tells you what's ahead when driving on the interstate.",
    "summaryHTML": "iExit tells you what&#39;s ahead when driving on the interstate.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.91,
    "ratings": 805,
    "reviews": 349,
    "histogram": [
        113,
        56,
        88,
        80,
        468
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$1.99 per item",
    "size": "4.6M",
    "androidVersion": "4.0.3",
    "androidVersionText": "4.0.3 and up",
    "developer": "iExit Software",
    "developerId": "iExit+Software",
    "developerEmail": "info@iexitapp.com",
    "developerWebsite": "http://iexitapp.com",
    "developerAddress": "iExit\n151 Ted Turner Dr NW\nAtlanta, GA 30303",
    "privacyPolicy": "http://www.iubenda.com/privacy-policy/791687",
    "developerInternalID": "6839688408210284011",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "icon": "https://play-lh.googleusercontent.com/FSkTVbpf3ljAWppJ90a6dTa_S7o0BrzFcANT-cE_z6YuLDqMikuBwKrDb3nXwL5WMw",
    "headerImage": "https://play-lh.googleusercontent.com/jAOiGgguwNA6BWR4ltmEwzB7F8bjwFqlmpfXfXSj5HU8bGOvxc3vwSc26rOSVk9fROQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/CJRYB4mdt9YKR5KU2YpEGhVsGUsZT1SpyyvWNF7yIHJ2wu3hvcr0PZymCBvSWZujk9Tq",
        "https://play-lh.googleusercontent.com/9bxxHWcPYnENAcBeKGXiVbhUxLxHAlShRn7JWug0jG9NSKoINAK7IFGvGts8NeP4hxK4",
        "https://play-lh.googleusercontent.com/D5REK_rLxK9pdKa-z2WF3LyrtlYtEN55F91mzUz1eIa0osZY867ni-QIs4Jk4ktvOTk",
        "https://play-lh.googleusercontent.com/drIbHjCbwZBgdheD1wBQYmLBNrgEaoGErq8nPMJ-JuxRi3BzbTskJJd3G0awjfFX0a0",
        "https://play-lh.googleusercontent.com/GpPrgF5fXuJFihJ2QIak2X_synYC3l8ELLp1CvZLYMTsMwEg_lpxlPYTBAQTi3hKVg",
        "https://play-lh.googleusercontent.com/znBj1GgFQZJ2ssmI2URCmxoTTVEpWRfzaEWaNwmoMYI54l9lXN-mzRdJSx58SwbjbNY",
        "https://play-lh.googleusercontent.com/DV_HgDA21gbp6qFqjeDDE9VyR-7vFdgP4GLZPbCz_9LdAeLR7nVrlZXRKi_dZBWvnw",
        "https://play-lh.googleusercontent.com/NCwKnTPqI0EgmPmq_-HwjcCglBz_VBNJEVrLXYp-UJFKxHqrGnO9GFSPDHk750bgliw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Mar 26, 2013",
    "updated": 1550763711,
    "version": "4.5.1",
    "recentChanges": "Fixing a bug for Android devices where iExit's location permission is turned off. For these users, the app will now request to use your location each time it is opened.",
    "recentChangesHTML": "Fixing a bug for Android devices where iExit&#39;s location permission is turned off. For these users, the app will now request to use your location each time it is opened.",
    "comments": [
        "I just love that I can find out the best exits before I get there..Planning a trip you want to find places that are clean,friendly,helpful and where exactly they are.. This has been a great app!! Recommend this 100%!!",
        "This app is invaluable. As a trucker, a traveler, or pilot escort for heavy haul trucks, you should have this app.",
        "Google Play won't even display app to an android tablet - even tablet with GPS and SIM card. Supposedly works on iPad but haven't seen it.",
        "We used this app to find some emergency Wi-Fi while on a road trip. It definitely went beyond Google maps for this.",
        "This is by far the best road trip companion that I have found to date. It might not have a ton of fancy bells and whistles like live-updates on exit closures, but it's almost exactly the same as the old book \"The Next Exit,\" a road map and guide that we no longer have to keep in the car. Thank you for a great, ad-free app that doesn't require pointless registration and is light on data when we are in low-coverage areas.",
        "I found this app very helpful. When I first used it, the gas prices at the upcoming exits were available. Next time I went to look at gas prices, they were blocked. I paid $0.99 for the gas prices to appear. I'm OK with that, Just wondering if others found themselves in this situation, and also, I'd like to confirm that this is a one time charge. Couldn't find this info on the site or in the reviews. Any comments would be appreciated. Other than that, This is super helpful for travelling and comparing diesel fuel prices on the road.",
        "Update! This review was from using it in an iPhone. I'm not happy that on Androids I cannot get the map option. When traveling with a 5th wheel I need to see the satellite image to know if the exit is trailer friendly. Fix that and you'll get 5 stars again! This is the best for trip planning I have ever used. I work for a travel company and am on the road with multiple buses.",
        "I happened on this app's website two days ago as my husband and I were returning home to Pennsylvania from Iowa. It was a godsend! Not only were we able to find a motel and call to book a room a few hours in advance, we also got the room at a discounted price because of a coupon included on the site. I was so impressed that I looked to see if there was an actual app, which I have now downloaded onto my phone, so we can use it next time. We will be sure to use it next time we travel, and I will be recommending highly to all of our friends. Two thumbs up!",
        "I LOVE this app. It is so great for finding out what gas stations, rest stops, or restaurants are up ahead. It tells you what exit and how far away you are from possible destinations. It also has a feature for knowing your current location so that you don't have to figure it out on your own, which is great for when you're in the middle of nowhere!",
        "Dang, how cool! Been using the book \"NEXT EXIT\" and it works great but, alas no gas prices. This app solves everything. installed on my S8, works perfect! (DOES NOT WORK ON MY VERIZON TAB \"A\" actually used as my GPS device) Only minor complaint is the icon looks really bad with the \"PIE\" update on the S8. Not a big problem, I have several apps that the icon needs to be updated; I'm sure it will come along.",
        "On road trips, this app is a MVP. iExit does everything I need in an app when traveling long distances on the interstate...including the BEST at showing where the next rest areas are coming up (along with gas by brand, restaurants, lodging, etc.) and showing how many miles to them. Love it.",
        "Love this app! Gives great guidance as to where to stop for gas and hotels on our road trips, and even gives gas prices for a nominal fee. Vert user friendly. I'd used this a few years ago and it's improved leaps and bounds since then. Can't recommend highly enough.",
        "Extremely useful. Recently completed a cross country trip and this was our go to app for finding gas, food and facilities near highway to minimize time away from travel. Allowed for planning on distance to ideal exit that offered what we required. Great to know when gas was low where we could make it to",
        "an xcellent app, but it can be hard to read when the sun is shining brightly. .. a dark mode would make this a five-star app!",
        "I luv this app. Im a cc truck driver. I use it to gauge my time n stops. I saw u had a trucker version on apple, please cross it over to android. Also, we need a reset password here. Help Triqxee approved",
        "this app has been excellent and accurate. even has in app coupons for hotels that provides them. saves time by letting you know in advance jf getting off the highway is worth your time. lets you plan which exit you want to stop at. includes all major highways/interstates",
        "Is mileage to destination inaccurate? Haven't used the app yet, but the mileage to my favorite exits along I95 are way off. Exit 121 in NC is 750 miles, but app says it is 645 miles. What's up ? Certainly makes planning my route difficult. Using an android phone.",
        "This app could be absolutely wonderful. However, the exit numbers do not coincide with exit numbers on my Google Maps directions. And it doesn't help to change the direction in which it runs. Huge waste of time.",
        "Just used this app on vacation and it was so helpful. When we was looking for some where to stop to eat we could look what was on the up coming exits instead of getting off at an exit and there not being much to choose from.",
        "Two restaraunts at the Michigan City exit on I-94 that are listed under food are no longer open. There may be more errors , but those were the 2 I was looking for.",
        "so easy to use! this is one of those silent keepers. you don't think about this app until you're on the road and then it's 'thank goodness for iExit'! keep up the good work!",
        "I got sick driving across country this app helped me out so much. Being able to see all the rest stops and how far away they were was a lifesaver. 5+++ stars.",
        "Traveled from Florida to Tenn through Ga, NC and SC and back. Used this app all the way on all the different interstates and toll roads it was great. Gave me more information than I even needed. Highly recommend.",
        "I love this app, helps us look ahead for rest areas, gas and food. So useful, thank you!",
        "Wow! Great app for highway driving. The paid app features gas prices which totally justifies the cost of the app. This beats GasBuddy all to heck",
        "Love the app. Simple interface and useful functions. It seems it was well thought-through.",
        "6357 mile journey with iexit as my copilot! I saved over $200 in fuel costs on my trip from Albany NY to Chico CA and then back. The app worked amazing. One hiccup where we arrived in Salt Lake city to find the gas station closed down. Otherwise, I am super impressed and will use it at work as well.",
        "Great app for finding how far away you are from rest areas and to see what types of businesses are at the exits",
        "Won't install on my Android head unit. I have used the app before on my phone and it's great, but really wish I didn't have to use multiple devices to get what I want.",
        "This app is very helpful! It helps locate services, distance between services, rest areas, etc. THANK YOU!!",
        "Slightly out of date. I checked a few area fast foods and restaurants. Ones that have been around for a few years weren't there and others that have closed were still there. Please update this app.",
        "I found it is also useful around town, mot even near an interstate highway. Great for planning ahead where to eat and fuel up.",
        "love this app we found awesome places to eat that were not fast food and otherwise would have never known about them while traveling",
        "Love this app! Makes finding restaurants, gas stations, lodging, etc. super easy!",
        "Downloaded and use the app on our trip from Houston to hot springs. Absolutely loved it. Would like to see camping or national / historic marker information",
        "Love this app. We travel all across the country in our RV and use it extensively.",
        "Love this app! We travel a lot and this really helps plan breaks.",
        "When it wirks it's great. Quit working this morning, just circles back to home page. Can't find me on I 40 with internet in my vehicle.",
        "This app is stuck in install mode and blocking all other apps from installing. I've tried cancelling the installing but it goes right back to install mode. 😡",
        "it need to be comparable with Android Auto or Apple Carplay for be a perfect app. hope they upgrade soon"
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.roadtrippers",
        "com.sunlandsoftware.gotowell",
        "com.overlandbound.ob1",
        "gov.caltrans.quickmap",
        "com.thedyrt.wayfinder"
    ],
    "moreByDeveloper": null,
    "appId": "com.metrocket.iexitapp",
    "url": "https://play.google.com/store/apps/details?id=com.metrocket.iexitapp&hl=en_US&gl=US"
}