{
    "title": "Jackpot Magic Slots",
    "description": "You must be 18+ to access this game. This game does not offer gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at gambling.\r\n\r\nDo you love playing virtual slots?  Are you looking for 100+ big win mobile virtual slot machine 🎰 games that you can play anywhere? Download Jackpot Magic Slots to enjoy free social casino-style slot games, virtual 777 reel slots, exciting virtual SCATTER slots, virtual progressive JACKPOT slots 🎰 and virtual slots TOURNAMENTS for FREE! With new games added every month and over 16 BILLION in virtual chips rewards 💎 daily, there’s something magical for everyone playing free social style casino-style games at Jackpot Magic Slots!\r\n\r\n***ALL new players receive a welcome offer of 1,000,000 FREE BONUS VIRTUAL CHIPS in the Jackpot Magic Slots FREE social casino-style game**\r\n\r\nWhy Jackpot Magic Slots™?\r\n⭐ Play the best mobile virtual slot games like Raging Reels, Big Fortune Valley, & Jackpot City\r\n⭐ Enjoy virtual 777 reel slots, virtual scatter slots, virtual progressive jackpot slots and bonus games that give you more ways to win\r\n⭐ Have fun playing free social casino-style slot games like Bison Blitz, Aztec Gold & Lightning Wheel\r\n⭐ Love bonus games with your slots?? Each virtual slot machine comes with a BONUS GAME FEATURE – like Ultra coins, FREE SPINS, Hold and Spin and more\r\n⭐ We add new slot-style games twice a month\r\n⭐Go VIP! Gain access to premium virtual slots and tournaments with VIP status.\r\n\r\nWin rewards and prizes!\r\n♦️Win one of 35,000 virtual jackpot rewards EVERY DAY!\r\n♣️Join a club to complete DAILY CHALLENGES. WIN MORE virtual chips and REWARDS, send virtual gifts, compete in club tournaments and chat with friends\r\n💎 Play LIVE mobile tournaments with and against your friends! Play daily FREE and VIP tournaments that offer bonus rewards to winners\r\n🎰 Daily Spins – Spin the wheel every day to receive FREE VIRTUAL CHIPS\r\n🎰 Bonus Games! Each mobile virtual slot machine comes with a BONUS GAME FEATURE – like Ultra virtual coins, FREE SPINS, Hold and Spin and more\r\n\r\nDaily Tournaments\r\nAt Jackpot Magic Slots™, we’re ALL about social play! Join daily tournaments to play against friends or compete with rivals. Create virtual private tables to chat with your pals or join a public tourney to meet new friends. Create your very own custom AVATAR to make an even BIGGER impression.\r\n\r\nJoin a Club!\r\nClubs are a great way to play with friends, meet new ones, chat, share, and compete as a team. All Club members will earn extra virtual rewards 🎉 each time your Club completes a Daily Challenge. Don’t just play alongside your friends…play WITH them!\r\n\r\n***Welcome Offer***\r\nNew players receive 1,000,000 FREE BONUS VIRTUAL CHIPS to play with.\r\n\r\nJackpot Magic Slots™ brings you exciting social casino-style games & virtual slot 🎰 fun so you can take your mobile slots excitement with you! Enjoy lucky spins and big wins – it’s free virtual slot-style action at your fingertips! Download today to make a splash and enjoy the thrill and excitement of huge virtual REWARDS 💎, and jackpots, FREE daily games, BONUS mobile slots and much, much more.\r\n\r\nFor all the latest info on freebies, tournaments, new mobile virtual slots and more, follow our social pages:\r\nFacebook: facebook.com/jackpotmagicslots\r\nYouTube: youtube.com/jackpotmagicslots\r\nTwitter: twitter.com/jackpotmgcslots\r\nInstagram: instagram.com/jackpotmagicslots/\r\n\r\nQuestions? Suggestions? Contact us at http://www.bigfishgames.com/help/jackpotmagicslots\r\n\r\nBy downloading and using this app, you agree to the Terms of Use at http://www.bigfishgames.com/company/terms.html and acknowledge the Privacy Policy at http://www.bigfishgames.com/company/privacy.html",
    "descriptionHTML": "You must be 18+ to access this game. This game does not offer gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at gambling.<br><br>Do you love playing virtual slots?  Are you looking for 100+ big win mobile virtual slot machine 🎰 games that you can play anywhere? Download Jackpot Magic Slots to enjoy free social casino-style slot games, virtual 777 reel slots, exciting virtual SCATTER slots, virtual progressive JACKPOT slots 🎰 and virtual slots TOURNAMENTS for FREE! With new games added every month and over 16 BILLION in virtual chips rewards 💎 daily, there’s something magical for everyone playing free social style casino-style games at Jackpot Magic Slots!<br><br>***ALL new players receive a welcome offer of 1,000,000 FREE BONUS VIRTUAL CHIPS in the Jackpot Magic Slots FREE social casino-style game**<br><br>Why Jackpot Magic Slots™?<br>⭐ Play the best mobile virtual slot games like Raging Reels, Big Fortune Valley, &amp; Jackpot City<br>⭐ Enjoy virtual 777 reel slots, virtual scatter slots, virtual progressive jackpot slots and bonus games that give you more ways to win<br>⭐ Have fun playing free social casino-style slot games like Bison Blitz, Aztec Gold &amp; Lightning Wheel<br>⭐ Love bonus games with your slots?? Each virtual slot machine comes with a BONUS GAME FEATURE – like Ultra coins, FREE SPINS, Hold and Spin and more<br>⭐ We add new slot-style games twice a month<br>⭐Go VIP! Gain access to premium virtual slots and tournaments with VIP status.<br><br>Win rewards and prizes!<br>♦️Win one of 35,000 virtual jackpot rewards EVERY DAY!<br>♣️Join a club to complete DAILY CHALLENGES. WIN MORE virtual chips and REWARDS, send virtual gifts, compete in club tournaments and chat with friends<br>💎 Play LIVE mobile tournaments with and against your friends! Play daily FREE and VIP tournaments that offer bonus rewards to winners<br>🎰 Daily Spins – Spin the wheel every day to receive FREE VIRTUAL CHIPS<br>🎰 Bonus Games! Each mobile virtual slot machine comes with a BONUS GAME FEATURE – like Ultra virtual coins, FREE SPINS, Hold and Spin and more<br><br>Daily Tournaments<br>At Jackpot Magic Slots™, we’re ALL about social play! Join daily tournaments to play against friends or compete with rivals. Create virtual private tables to chat with your pals or join a public tourney to meet new friends. Create your very own custom AVATAR to make an even BIGGER impression.<br><br>Join a Club!<br>Clubs are a great way to play with friends, meet new ones, chat, share, and compete as a team. All Club members will earn extra virtual rewards 🎉 each time your Club completes a Daily Challenge. Don’t just play alongside your friends…play WITH them!<br><br>***Welcome Offer***<br>New players receive 1,000,000 FREE BONUS VIRTUAL CHIPS to play with.<br><br>Jackpot Magic Slots™ brings you exciting social casino-style games &amp; virtual slot 🎰 fun so you can take your mobile slots excitement with you! Enjoy lucky spins and big wins – it’s free virtual slot-style action at your fingertips! Download today to make a splash and enjoy the thrill and excitement of huge virtual REWARDS 💎, and jackpots, FREE daily games, BONUS mobile slots and much, much more.<br><br>For all the latest info on freebies, tournaments, new mobile virtual slots and more, follow our social pages:<br>Facebook: facebook.com/jackpotmagicslots<br>YouTube: youtube.com/jackpotmagicslots<br>Twitter: twitter.com/jackpotmgcslots<br>Instagram: instagram.com/jackpotmagicslots/<br><br>Questions? Suggestions? Contact us at http://www.bigfishgames.com/help/jackpotmagicslots<br><br>By downloading and using this app, you agree to the Terms of Use at http://www.bigfishgames.com/company/terms.html and acknowledge the Privacy Policy at http://www.bigfishgames.com/company/privacy.html",
    "summary": "Get your welcome gift and play your favorite virtual slots!",
    "summaryHTML": "Get your welcome gift and play your favorite virtual slots!",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 4.3713946,
    "ratings": 126575,
    "reviews": 31394,
    "histogram": [
        10256,
        2792,
        6824,
        16509,
        90194
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$0.99 - $99.99 per item",
    "size": "Varies with device",
    "androidVersion": "Varies",
    "androidVersionText": "Varies with device",
    "developer": "Big Fish Games",
    "developerId": "8355317828905497231",
    "developerEmail": "android.email@bigfishgames.com",
    "developerWebsite": "https://www.bigfishgames.com/game/jackpotmagicslots/",
    "developerAddress": "906 Alaskan Way\nSeattle, WA 98104\nUnited States of America",
    "privacyPolicy": "http://www.bigfishgames.com/company/privacy.html",
    "developerInternalID": "8355317828905497231",
    "genre": "Casino",
    "genreId": "GAME_CASINO",
    "icon": "https://play-lh.googleusercontent.com/CT0K8Z9bgIgXrdzOez9XUxqMtbVomt5SSHcCyVM83mV7aFy1Oy0ji38bCBFooYOUGic",
    "headerImage": "https://play-lh.googleusercontent.com/4cZ17Ou3Tq5hMck6IPbbn6JMriCv_YXqSMImSZkha0Ct0Pv4Qf8KhK-rHxOfPCWIzo8",
    "screenshots": [
        "https://play-lh.googleusercontent.com/dgJxS1j2araZ27q_Ip511hwLtcq6bBMPRBrUQR5637dOJQNDYApXoN2rA7v-Fhuqwu4",
        "https://play-lh.googleusercontent.com/84bkZa-MPyIbF4dpd4xEuIlpQpmT3vH8CDIFD8NBXR6DqSFxzs1ZLNalEXw2j-yZeeE",
        "https://play-lh.googleusercontent.com/1F1IJ2ywmeGhQOEKdb62X5e4oA3kplqKkAyWgVj824FjpsXRtiM-HKs2H7ydbHiGCAE",
        "https://play-lh.googleusercontent.com/dq-3MluAUisdX-9c5thf-heprbGccpZ3J_kHCdl5e7h3ffsCo-DwZm5SvvpvThR-C4Y",
        "https://play-lh.googleusercontent.com/AuCY5bWAHW_kVkC-I5f3-G_FlzyA7PR1OVI6afIKL5i4nR9yUoPN_KVLs7xJn0wwDA",
        "https://play-lh.googleusercontent.com/xrk6ruQADnjzV1mTM60_WphvZzWtBgiToiFFr0dljdi_3hfHpa1ub4h0iIyQ8L_CzkU",
        "https://play-lh.googleusercontent.com/ukE5rqNUPZkGSPYoqxmBmXRIiTUdxfcValtfFL_MV756XlSZ0eGLMfI_NfR65dnDm87Q",
        "https://play-lh.googleusercontent.com/Pbe5cYgMrNZJ9q2JkTVtdqQiXai4NShM6SyeGlU4ShmjYFf0gXYwIwFRo8faLc9iQA",
        "https://play-lh.googleusercontent.com/9x7TvwrqgLRVmHn1wPaslDKOK2mbi40w43C6ebpeecsSvJv7muRs9eysXRzhhK20sZnN",
        "https://play-lh.googleusercontent.com/2gMaRMkJC58NiOR-0LIkYa1l8os0YKzraaKxSdVycesJ8u_hlkmos5FSsVJhLV-1Zbff",
        "https://play-lh.googleusercontent.com/4zghpNn-QrayCw-m38zPHJ7ITYcBuu3VAh3hcGH_bN-qcQBElAM9earu2PHl-nZ-qA4",
        "https://play-lh.googleusercontent.com/AN6p8fz4-fkcLg1O7xXdNTYIRUufjmkOlxCRUUscvWphm5QiWmCjvAvYAuni4DZVXXA",
        "https://play-lh.googleusercontent.com/c-YG2M-Ktj-HHq_pHHHhXq3uTWgFAP4DLhWZ7599spMtUwvL0CFtYe4lYEptzyinAA",
        "https://play-lh.googleusercontent.com/C7uxDvTFFX4cSgRwZLAY2ZPEBZ9wLul8PTCOTuaE0ZQTgONLErApCu9ouxTkHtZ3ziw",
        "https://play-lh.googleusercontent.com/5V4vFsB0U9ZvuJicjPa3wJlGQt-FG6lhzo28_qHYR2qIeNz58k4fXwia9ayGv8UNNw"
    ],
    "video": "https://www.youtube.com/embed/TR6livOvbMc?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/4cZ17Ou3Tq5hMck6IPbbn6JMriCv_YXqSMImSZkha0Ct0Pv4Qf8KhK-rHxOfPCWIzo8",
    "contentRating": "Teen",
    "contentRatingDescription": "Use of Alcohol, Simulated Gambling",
    "adSupported": true,
    "containsAds": true,
    "released": "Jul 15, 2016",
    "updated": 1640022412,
    "version": "13.4.0",
    "recentChanges": "New slot machine launches: Ribbiting Riches, Winner’s Wonderland, Jackpot Holiday, Holiday Blast, The Nutcracker Holiday, and Raging Reels New Year’s Remix\r\nNew Treasures Season: Slice of Life: 70’s\r\nNew Missions: Crown Rush, Reindeer Rendezvous, Winter Fortunes, Christmas Cookie Cook-Off, and X-mas Ventures, New Year Party\r\nBug fixes and performance improvements",
    "recentChangesHTML": "New slot machine launches: Ribbiting Riches, Winner’s Wonderland, Jackpot Holiday, Holiday Blast, The Nutcracker Holiday, and Raging Reels New Year’s Remix<br>New Treasures Season: Slice of Life: 70’s<br>New Missions: Crown Rush, Reindeer Rendezvous, Winter Fortunes, Christmas Cookie Cook-Off, and X-mas Ventures, New Year Party<br>Bug fixes and performance improvements",
    "comments": [
        "I am pretty disappointed with a feature within the game, where you watch videos for coins. I noticed around 1/31/2022 that I didn't receive any coins after watching a video. I even watched 3 videos in a row...still no coins! The following day I sent a message to BigFish and basically was told according to their logs I received the coins. I messaged stating that I did not receive the coins. I then made a video of me watching a video and NOT getting any coins. I feel like BF is saying im SOL!! 😡",
        "Great wins and exciting perks in the beginning but.... as with most apps like this, something changes and you always lose all your coins. Great games with poor odds. I hate to say it but its just like going to a casino, you always eventually lose! They throw you a few coins each day and quickly take them back. Just a warning, the more you increase your bet, the worse your odds. Just watch your jackpot come around the spin and suddenly disappear.... When you do win its so phony...",
        "You need to do something about your machines that trembling and the shaking especially when you get the coins I think that is cheating that machine is not running smoothly up and down it's shaking All over practically all of them especially jackpot magic in a few more so why don't you do something about having a good nice running machine and when you",
        "Loved this app when I first started using it but the more you play, the more it does not let you get free spins/bonus games even for paying players. I downloaded this app to waste time and have fun at the same time, but after a couple weeks it just stops giving you winnings and tries to make you purchase more coins, which I have done and it still doesn't help. Goodbye, uninstall",
        "Don't know what's up with this game guess it's trying it's hardest to get players to quit playing. First even after winning all challenges and helping teammates with credits I've still lost half my credits. Next while playing a game doing okay but not making credits, all of a sudden I'm kicked out of game during a spin?? And worst I don't get my credits back for lost spin, not knowing if I won or not. All I can say is when I'm out of credits there are plenty of other games out there.",
        "This unintelligent company doesn't value any of their players including paying customers. The games don't hit the way they should, and this company just makes lame excuses. It would be a good game if the slots would hit. It's a game: It should be playable. There aren't enough people playing this game anymore. I'm sure the company attitude and greed is why. All I find are rooms with a bunch of empty seats. Keep your fake chips and I'll keep my money! Enjoy the empty seats!!! UNINSTALLED.",
        "Not too happy with this game. I downloaded for the first time ever and see that someone has my account. I emailed devs and the only advice I could get was uninstall and reinstall. Well that didn't work so I guess I won't be playing this and figure out how to report the game. But my guess. The comment will be please email in game and we can help. Well I already did what was suggested and now I'm not happy. Good luck with playing this. I will not be trying anymore.",
        "After you play for a few months they stop letting you hit anything big. If you buy they just take your money and the coins. It really is fun at first but it gets worse and isn't fun anymore.",
        "Played a long time, other members have the same issues, paying low amounts, opening spins are set low, No large jackpots anymore, Techs seem to doubt your word, Ive emailed them about this, But lately it seems like, its a waste of time, Will update, if it gets better, Well actually has gotten even worse, Download other games, This one, not worth the aggravation, and they are NO HELP",
        "Have played here literally for years and years. Don't waste your time. The folks who used to own/manage the game several years ago were a lot nicer, and you could win a few coins. Now, you're lucky to play for five minutes and your coins are gone. It's a shame.",
        "Do Not Spend Money in this app! Coins disappear without play! I closed the app and had had over 1 million coins. Reopened app 20 minutes later checking vault times-which also change on their own- to find I went from over 1 million coins down to 131,411! I've only made one small purchase thankfully but the disappearing coins is as ongoing as being kicked out of a slot and asked if you want to rejoin. Just went back in after writing this and I only have 30,000 coins. What a rip off!",
        "Nothing good to say about this game. Give you small return bonus. Buy coins don't let you win. Just takes them just greedy bastards. Can't have fun. Cost to much. Won't buy anymore coins. They just take them. Don't download this game. Ripe off",
        "I am a long time player. Most of my friends are gone and I will be gone soon too. I can't play anymore like I use to because I don't win like I use to. I am lucky if I play more than a few minutes a day. Purchased coins don't win either. My New Year's resolution is to uninstall this app!!!!",
        "I don't know what's going on with this app but every time I try to play either the reel rivals or one of the games it freezes my phone or it kicks me off completely you all need to fix this bug other wise I will delete this game!",
        "This app is about nothing but forcing purchases. It is the only slot app that focuses more on taking all of your coins, rather than keeping you playing on their gaming app. The customer service is slow and it sucks.",
        "Their \"new\" games are old ones with different looks. They don't listen to their players. All we are asking for is fair game play not rehashed old games",
        "Not far, have pay to play and you still don't win. I will not be buying anymore coins untill bigger pay outs happen more, then it would be fun.",
        "This app is so bad that you will have to have a good credit catd because you will be buying a lot of coins just to keep playing. Becareful this app is a rip off!.",
        "love the slots but the odds have gotten terrible Too many zeros and if you do hit for something decent then it gets taken right back You need to loosen up as everytime you do maintenance slots get tighter Please bribg back the fun Wrote this almost three years ago and the odds are even worse Don't understand why you do this",
        "The teams are great! However, after a couple weeks you will not win if you do not buy coins. Now they want $50.00 (real money) to open my piggy bank. Thats a lot of money to throw at a gaming site!!, where you will Never Ever win any real money back.😱😫",
        "App will not open, and response is there is a bug, and once a fix is available, an update is needed.",
        "Your app is terrible. I have been trying to get on games for at least 2 weeks. App keeps stopping! No one can fix I guess",
        "Very disappointed..I enjoy playing but can't seem to win much.. a nd if I do BF takes it as fast as I get it..sad especially if you are a paying customer",
        "I love both App's ty JMS/BFC for all the freebies throughout the week, Events and all the fun etc. Don't miss out people download the Apps in play store",
        "Great app but getting kicked out of REEL Rivals,or would be 5 stars. Update will fix, but don't hv enough memory and wondering if a reinstall will fit bk in. Because it'll come with Update. Says I need 540mg",
        "If you like gambling then this app is great. Games are fun and new games are added all the time. Odds are tough but what do you expect from gambling.",
        "All this slot wants is your money! Your lucky to win once a month! These slots are way to tight. Not fun anymore.",
        "This app has fun and excitement down to a craft!! Fun games great challenges!! Never bored always fun !! Download and enjoy the fun and excitement!!",
        "I changed my review from 5 star's to 1. So disappointed in this game. If you are new, don't waste your time. You never win a jackpot. Just not what it used to be. They are just blood-sucking money-grabbing company. Sorry for the review, but I will stand by my review unless you change I will change my review. Always loved this game, good game just no wins anymore. Now this game won't let me collect my winnings for this reindeer game. It won't even open up for me to claim my prize",
        "Alright so this review is as real as it gets. First off, avoid this like COVID. They have to make countless fake reviews to keep it above 4 star. I have seen multiple Tier15 players broke playing low level pot share tables. Tier 15 VIP requires 10s of thousands of real money just to get to! The people are so toxic that the social aspect of the game is gone. Just read the profiles! Its beyond sad how the greed of owners destroyed what was once a great game. DO NOT PLAY. RUN AWAY!",
        "I used to love this game. I was honestly addicted lol but never to the point of paying for fake coins with my actual money. Theres lots of different slots but as of lately i can never get any wins. I mainly play reels for my club now. This game isnt too fun anymore because the odds are terrible. :(",
        "The experience of this game is really trash. When you spend real money...they make sure you lose so you can keep spending. I really do not recommend spending real money on this trash of a game. This game is ridiculous. I wouldn't even give it 1 star. They prey on you to spend your money just to rip you off. What a joke...🤨",
        "This app keeps crashing I'm tired of reinstalling with the same results..I use to enjoy playing this game now its a nightmare just trying to spin and this is why bf only gets one star.no sure what happen with this app but you guys need to stop updating so much. This game was fine until I updated the app on a brand new device.what a waste..far from being hsppy.",
        "Game use to be a lot of fun but over past few months it has gone downhill. Hard to win any big payouts. When you come close, the wheel stops and then skips so you don't win anything. The VIP games are the worse at payouts so not worth playing them. Also noticed for example, Kong, the jackpot amounts are the same on both a 125 and 250 bid. Why bid higher? Makes no sense. Very disappointed in Bigfish. Only reason I stay is because I love my club and the people in it.",
        "I put a ticket in and instantly it is closed out. So I put another one in, and it's closed out instantly. I put a third one in asking for a supervisor to look at the issue. It's closed out in less than 1 minute. Am I being blacklisted by the support team, or is there a technical problem?? I've been trying for a week!!!!",
        "I downloaded again and as before I played big bets and there was nothing. I received two payouts of 93000 after going through 5 million in bets. It has gotten worse. This site used to be a blast to play and it was fun.",
        "They don't value there customers just read there reviews I like there slots but there customer service is bad used to buy packages and lots in tell I found out what they were and that's \"A GREATY CORP\" I'll be losing but I soon as I buy packages my luck changes for 5 min I get wins then they go back to 0s now I understand why there was a \"BIG LAWSUIT\" against them",
        "Well I game is a lot fun . But don't get into buying ,cause your big wins are hard to come by , . Trust me I have spend alot and I am getting nothing Canceling my cards and moving on . No more money from you cheap",
        "I have 3 accounts..I would give more stats cause honestly I love this game but lately can't win AT ALL. I've spent over$500 in the past 2 weeks yes ik that's crazy... and I'll be honest I think I'm losing MORE.. if that's even possible. What the heck is going on.. can't even get 3 of anything why is the game acting like this 2 straight weeks off NOTHING. PLEASE FIX THIS.....",
        "Excellent fun graphics. Lots of different games ans bonus features. Could & should pay out more often. Addicting....."
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.slots.best.android",
        "com.bi.slots.casino",
        "com.superluckycasino.fortunespin.slots.vegas.android.free",
        "com.superluckycasino.epicjackpot.slots.vegas.android.free",
        "com.superluckycasino.viponly.slots.vegas.android.free"
    ],
    "moreByDeveloper": null,
    "appId": "com.bigfishgames.jackpotcityslotsf2pgoogle",
    "url": "https://play.google.com/store/apps/details?id=com.bigfishgames.jackpotcityslotsf2pgoogle&hl=en_US&gl=US"
}