{
    "title": "It’s Boba Time",
    "description": "The It’s Boba Time app allows you to order for pick-up and skip the line or order for delivery. Our stamp rewards have been digitalized so that you can start earning free drinks with every purchase. Link your gift card to the app so that you are able to check your card balance, add money and pay. At this time, participating store locations only.",
    "descriptionHTML": "The It’s Boba Time app allows you to order for pick-up and skip the line or order for delivery. Our stamp rewards have been digitalized so that you can start earning free drinks with every purchase. Link your gift card to the app so that you are able to check your card balance, add money and pay. At this time, participating store locations only.",
    "summary": "Order ahead, skip the line & earn stamps!",
    "summaryHTML": "Order ahead, skip the line &amp; earn stamps!",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.55,
    "ratings": 101,
    "reviews": 52,
    "histogram": [
        24,
        9,
        7,
        8,
        53
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "57M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Incentivio Inc.",
    "developerId": "6981004758908190295",
    "developerEmail": "support@incentivio.com",
    "developerWebsite": "https://incentivio.com/",
    "developerAddress": "575 Boylston Street, Suite 3L Boston, MA 02116, USA",
    "privacyPolicy": "https://itsbobatime.incentivio.com/termsofuse_android.html",
    "developerInternalID": "6981004758908190295",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "icon": "https://play-lh.googleusercontent.com/RutmYU9sgCThwVPnpLp5JAC3gLFY9KDcax5_pdrPfZLZGKDoWxV3fwsN0h1fNqJ6sQ",
    "headerImage": "https://play-lh.googleusercontent.com/jReCD29W0PsR9vOl9edHL1nCN1megcLXFYByvR6y4jBopvHhYtCJOMj_jBfYU003EQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8TrhrWFrksU43PsAGBsggw6pHpmkHwW-ls__7RfA4twv_sEQzMjEOkx__xbFhG97JekW",
        "https://play-lh.googleusercontent.com/4kKXCdod8F0t33EG4rHys3U4b6IY32Qe9r0nUE1rtE1uir_ww5csTse_VMd3E7mbaI23",
        "https://play-lh.googleusercontent.com/VB0NsUQsbLUgcDzNqfnHjayHk88VSJ8PGHyQZTmxSE0W7HKjoT06Qc8YsCzmAtz6tg",
        "https://play-lh.googleusercontent.com/aH3c7khOnRiwEhNK5coC-nLgWtPwA20NjQp-yKy-L8zb2XgkeNydBMDFCq-2We6YCw",
        "https://play-lh.googleusercontent.com/wRcn-5B3eoZzGbstqTSGYyNTc8jUQi6WwH-jtxMrzgGWWs_E8ktpbRJmK-pioTBrdA",
        "https://play-lh.googleusercontent.com/lXaDeQzA9YXC-h2jhrwFkVSGTEWt7B-SEUHbELeonPl5ea5h8jsCX7_48Qi4Pi_D_Bg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jan 30, 2020",
    "updated": 1634195184,
    "version": "1.1.4",
    "recentChanges": "- UI Improvements.",
    "recentChangesHTML": "- UI Improvements.",
    "comments": [
        "Works wonderful... when it works lol majority of the time, when you attempt to click a location to order, it will say that ordering is unavailable when it is not, and it works for other people. Definitely has it's kinks to work through.",
        "1: Doesn't include franchise locations so the app is useless for these places. 2: Map doesn't show user's location. 3: Order history is based on previous store purchases and not drinks previously ordered, so ordering at a new location (if you can find one) doesn't allow to simply add past purchases. 4: No way to save favorite drinks. 5: No recents orders list to be found. 6: Need to be more like the Starbucks app.",
        "Overall, pretty great. Except I can't even order a basic Thai Tea because it doesn't show up in the app anymore. I tried uninstalling and installing it again and it still doesn't show up. Please fix the menu in the app. It doesn't have every item on there. I would hate to use uber eats or postmates to order because I won't be able to use my stamps.",
        "App needs a retro credit function. When I was in store today it kept acting like I couldn't log in over and over so I have zero stamps for my in-store purchase. Update 03/2021 - Still needs retro credit function. App has issues working in store, which did occur during last visit. The staff @ K-Town&7th are the best! Their customer service is great! App's been working way better. I'm super happy the owner took my app suggestions! I can now order my blue sky for pick up and frosty milk add ons!",
        "This app has a lot of bugs. There are times where it won't accept any payment methods even when there is money on the accounts. Also the app says that the locations are closed when they are open and when asked if they take mobile orders the employees say they do. It won't let me order if the location is \"closed\". Please fix!",
        "Really need to rework the online ordering system. Placing the order is simple , but whatever logic is being used for timed orders doesn't make sense. I placed an order about an hour before pickup, fairly large, and they don't actually start on the order until 5 or so minutes before pick up time.Workers mentioned it just printed minutes ago. Ended up waiting ~40 minutes.",
        "Won't save my credit card information, therefore, I can't place mobile orders. After 3 attempts on different days, ive just given up on this app and this has lost my business over all.",
        "to think all this time I've been ordering boba time and not earning rewards... not anymore, I will forever use this app for my orders. it would be super great if they had a favorites section though where I could save my drinks and then add to cart with all my preset changes (size, sweetness, boba, and ice levels, or add ons) automatically.",
        "I've had issues with collecting my rewards. I've told the cashier about it and everytime I go and I keep seeing the same 2 stamps and I've gone approximately 9 times or more. The employers are new to this app as much as we are and I was only able to get the $5 off once! Yes I love going to Boba Time and since the app was reinforced I've used it since and I've been having troubles with maintaining my stamps. And it's quite upsetting.",
        "Ordering through the app works fine and accepts most major credit cards. My main complaint is stamps doesn't appear on your loyalty card after purchases and no way to contact them regarding this issue. It's been a week have still haven't received my stamp.",
        "Doesn't send the order always. First time worked great second time waited half an hour to eventually ask the worker and told me the order didn't print but they had it in there system, had to wait another 10 min just to recieve a rushed order, not mixed well. Not upset with the employee just the app",
        "I've been on three occasions now and it has only granted me one stamp despite meeting minimum requirements for a stamp. They need to fix this glitch or go back to the old stamping system.",
        "I love boba time. I just don't like that I xan't order shaved ice on the app. App should have complete boba time menu. If a certain branch don't have a certain item it should say it on the app. More improvement needed for this app.",
        "Any error happening to anyone else trying to put in their card information? We originally had a card in the account but HAD to delete it to add another card for some reason (we kept getting an error notification to trying to add another card). But now that we want to add the original first card's info, it's giving us another error and won't accept the original card info even with us already deleting the second card we added? If it's a glitch PLEASE FIX IT because now we have any card on the acct",
        "Only one of two locations I frequent listed. It is almost useless because the one closest to me is not listed. The one closest to my sis is. This is so inconvenient.",
        "Nice to order, but no notification when the drink is done. They only have pre-estimated pick up times. I was waiting assuming my name would be called.",
        "My family love this app. We order our drinks and pick is super easy. Our drinks are always ready and amazing. Sintia G.",
        "Drinks are never on time. You could actually end up waiting an hour after you're supposed to pick up the drink. Their system sucks.",
        "Dont know if it needs an update, but only shows 2 locations to order from. Neither one is close to me.",
        "Its been 8 days and I haven't seen any stamp on my loyalty card. Just use a physical card just like before.",
        "Who can I contact regarding a refund?? This boba time app allowed me to make a purchase to a location that is CLOSED. No phone number(s) to contact.",
        "it would be better if there was a section for adjusting the amount of ice to put in the drinks",
        "Tried to order and the app didn't let me saying that I need to only order during store hours. I order at 4pm and they closed at 9pm... And this was my 3 attempt on a different day",
        "They foolishly don't let you checkout as a guest. They try to force you to create an account. Well fU.",
        "we have a boba time in my city and it doesn't show up in the map",
        "I would love to see the Its Boba Time in Ramcho Cucamonga on here. The app is no use to me. Would love to use the loyalty rewards.",
        "App works better than McDonald's better than Starbucks also and very easy to maneuver",
        "There's only a limited amount of locations. The one that's closest to me wasn't even there",
        "I need more locations to order from. I know there is a shop closer to me than the 6 places that popped up.",
        "Love this app. Helps skip the line.",
        "Literally standing in one of their stores and the location isn't listed. Useless app... uninstalling",
        "Awesome app! Makes ordering super simple",
        "App is not working",
        "says card is invalid so I have to buy a gift card with the exact balance, plus there's no customer support which is weird because it's owned by YogurtLand's parent company.",
        "They don't have the ice cream floats available on the menu with this app.",
        "YOU NEED TO WARN THE CUSTOMER THAT YOU WILL CHARGE A FEE FOR LOADING A GIFT CARD. I WAS NOT INFORMED THAT THERE WOULD BE ADDITIONAL CHARGES FOR BUYING A GIFT CARD FOR MYSELF. UNACCEPTABLE!!!!!",
        "Love me some Boba time my favorite is taro coconut with Bubba hopping to get ride of some waight and nd find me a nice bobà man🤗",
        "The boba time down there street from me isn't even listed in the app",
        "It keeps saying ordering is unavailable",
        "Won't let me pay :/ I can order and everything but it just won't process the payment....."
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.lucova.realfruitbubbletea",
        "com.caribou.caribouapp",
        "com.sharisberries.androidapp2",
        "com.tiffstreats.cookiedelivery",
        "com.cinnfocus.app"
    ],
    "moreByDeveloper": null,
    "appId": "com.ce.android.brand.itsbobatime",
    "url": "https://play.google.com/store/apps/details?id=com.ce.android.brand.itsbobatime&hl=en_US&gl=US"
}