{
    "title": "Translate Voice (Translator)",
    "description": "Languages translate tools. Help you communicate and learn a foreign language.\r\nYou can translate voice, also translate text, and also to translate multiple languages at the same time.\r\n\r\n• Translate between multiple languages\r\n• Converse naturally and then translate\r\n• Translate with your voice or keyboard\r\n• Share translate results.\r\n• Speech to text and then translate\r\n• Text-to-speech\r\n• Quick and easy translate\r\n\r\nPermission notifications\r\nConversation translation may request permission to access the following features:\r\n• Microphone for speech translation\r\n• External storage for store translated data\r\n• Camera for identify QR codes",
    "descriptionHTML": "Languages translate tools. Help you communicate and learn a foreign language.<br>You can translate voice, also translate text, and also to translate multiple languages at the same time.<br><br>• Translate between multiple languages<br>• Converse naturally and then translate<br>• Translate with your voice or keyboard<br>• Share translate results.<br>• Speech to text and then translate<br>• Text-to-speech<br>• Quick and easy translate<br><br>Permission notifications<br>Conversation translation may request permission to access the following features:<br>• Microphone for speech translation<br>• External storage for store translated data<br>• Camera for identify QR codes",
    "summary": "Language Translator, Voice translator, translate text,voice and conversations.",
    "summaryHTML": "Language Translator, Voice translator, translate text,voice and conversations.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 4.3489933,
    "ratings": 39526,
    "reviews": 748,
    "histogram": [
        3706,
        264,
        2647,
        4765,
        28144
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$0.99 - $4.99 per item",
    "size": "15M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HawsoftMob Inc.",
    "developerId": "HawsoftMob+Inc.",
    "developerEmail": "feedback@hawsoft.com",
    "developerWebsite": "http://www.hawsoft.com",
    "developerAddress": "1-1505 Taebaek International,God Road.",
    "privacyPolicy": "http://www.hawsoft.com/trans/privacy/hawsoft_privacy.html",
    "developerInternalID": "7965423213983602768",
    "genre": "Travel & Local",
    "genreId": "TRAVEL_AND_LOCAL",
    "icon": "https://play-lh.googleusercontent.com/ZmoOV8JzY8A4ta4ucs-OlI-SggYG6P7H18Dn3U9dffxysIqonYgeejb_gz1efwLYFQ",
    "headerImage": "https://play-lh.googleusercontent.com/Spl2GCxyx9XS_QaSVqZe5o8oz-6SyCLg1h_rJPJv1vSR_CGMchRu5i96Qii5GgnDZg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/yFtONWlbpblZYdB7TvXr1iAGxnc7kDoPGJH5ftx5gq7KLK_L8xNCBakYZ0O3RWPzaOhX",
        "https://play-lh.googleusercontent.com/XQL-rnzNcLb5uCJyzFNTotHwI2SNOgPNOiJorc3BHKY30kIjOqf5OgoGTjA3FaLMkss9",
        "https://play-lh.googleusercontent.com/k91Xm0mVHvpSnIDJHomQDOmGy6xv6KSb3yGCEFVNHi3IHVWhnv2MCTVrHsX5LLCIiXpc",
        "https://play-lh.googleusercontent.com/SnWTrQDvhVA_qlk2gC04ku4o04I69Pz23XKgO7bErNZZ4h18YLQTIxIZ-EpXxkE9qg",
        "https://play-lh.googleusercontent.com/_zBZH4VAtNbiAWfIzTztvK_fRqX0QG5mVu9exZkx3nsZwXgdqIQDDj7OfA6NJrygoDg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "May 28, 2015",
    "updated": 1633772994,
    "version": "1.7.2",
    "recentChanges": "1, Fixed the offline reading issues.\r\n2, Optimized the Cantonese recognition issues.",
    "recentChangesHTML": "1, Fixed the offline reading issues.<br>2, Optimized the Cantonese recognition issues.",
    "comments": [
        "This app is excellent!!! English to French and vice versa is exceptional as well as English to Bulgarian. Highly recommend this app.",
        "I like this app. It is easy to use and I can switch to a different language if I need to translate to another different language.",
        "What can u say. It's a free app. U get what u pay for. I do think it's great for simple translation. I've had a next door neighbor live there 10+ years. His wife for some reason speaks no English. Guess what? With this app, I've been able to carry simple conversations with her. So cool. She's since downloaded the app on her phone. How embarrassing though. I didn't even know her first name.",
        "This app is annoying. It stops every few seconds for no reason. I thought at first it was just stopping every time the person speaking pauses, even if gor just a second but then I realized that it stops in the middle of sentences for no reason at all. It also stops in the middle if tranlating to bring up an ad. Very frustrating to use.",
        "I don't know what voice model this app uses for US English, but even though I'm a native US English speaker, the app understands me better when I switch to Central/South American Spanish. I'm not a native Spanish speaker. I would think that it was maybe in the way I pronounce words, since I have lived in the Midwest in Central Illinois, the South, in Texas, the southeast in North Carolina and Virginia, and New England in the Eastern part of upstate New York. The thing is though, the Google apps that accept verbal commands or convert speech to text and Amazon Alexa don't have any problem understanding what I say. Also, I double checked the translation results I got going from US English to Spanish and from US English to Hebrew. Again the Spanish translation was perfect. The results for US English to Hebrew were very nearly complete gibberish. I even tried typing in the English to translate into Hebrew. It was still mostly an unintelligible string of words when translated back to English using both the translation app and Google translate. I don't know if the other languages in the app behave more like the Spanish translation (which was really good) or the Hebrew translation (which would probably only generate confusion, but in a worse case scenario, could cause at the very least hurt feelings and friction) If you install this app, do some fairly thorough tests of the translation results. Place your finger on the results and hold it there for a second. The option to \"copy share delete zoom\" will come up. Touch copy. In a Google search bar, type translate \" \" to (replace the parentheses and this text with your desired language) touch and hold the spaces between the quotation marks then select paste. You may have to delete the extra spaces in between the quotation marks. This method should allow you to translate even languages that are written right to left like Hebrew and Arabic using Google translate. When the app works it is nicer than Google translate or Babel fish. When it doesn't, it could cause serious confusion.",
        "Ad said it translates in real time. It does not. You have to take a picture and then it tries to translaye afterward. But it fails to do so. I uninstalled it but it womt go away. Now i have ads popping up on my home screen. Devs, please help me get rid of this!",
        "I love this app. I speak some Spanish, but not as much as I want to and my girlfriend (Colombian) speaks almost no English. We both downloaded this app and when we talk beyond my Spanish ability we can use this to communicate effectively. It is a literal relationship saver. Highly recommend for everyone!",
        "This is an excellent app. I tried some with higher ratings, but I spent over half my time closing Facebook ads. Only thing I'd change would be to offer other voice choices. It should at least have a choice between male and female voices.",
        "I like what it does but wished, a setting would allow, once the translation has been spoken aloud, for the app to continue translating but Start from a voice activated setting, thus one sentence after the other, without needing to press the mike each time. The translations are otherwise pretty good.",
        "I have one problem with the app. I have chosen Latin American spanish as my language but it keeps reverting to Spanish from Spain. They are quite different. I don't like that it keeps switching back to Spanish from Spain when I have chosen Spanish from Latin America. I shouldn't have to choose Latin American Spanish every single time I open the app. That is very aggravating. I don't like that. It seems like it does that for every language that has multiple options.",
        "Some of the things that are being translated into English are not the correct translation and some of the words don't get translated...this is my go to app for sure but it still has some bugs to be worked out...highly recommend this app for help communicating with others of different dialects",
        "This is truly an amazing app. It is spot on and you can replay each sentence with just a touch. Hopefully my Spanish gets better but until then, I'll be using the hell out of this while in Mexico.",
        "I'm an American Citizen living in Mexico and when talking to locals this Program makes the Conversation alot easier to Communicate when they don't speak English. This is a MUST App. for Everybody in the same situation and especially for Travelers !",
        "Perfect! Real time and accurate. If you're wondering, you can Speak your language and it will speak the other language back. Has 2 mics- your language and one for the other to speak back",
        "For the most part this app is great. However it does not have a few languages that would make me rate this app higher. One is Persian language and Native American (so I can identify with my heritage). But for the most part the languages it does have are great.",
        "The best translator I found until now. The only thing wrong is that it talks to fast in Portuguese. If you can slow it down a little it would be the perfect app to learn Portuguese.",
        "Incredible!! This app had helped us communicate perfectly with people that don't know a word of English. You all are true connectors of people! Thank you.",
        "I love this app! I am able to travel carefree with out the worry of a language barrier. I can communicate in 40 different languages. I only wish this was available offline.",
        "So far very good. I don't know what everybody's complaining about with all the ads. There are hardly any if you first watch a 5-second ad to get rid of them all every time you open it. Seems pretty accurate too.",
        "My wife loves this app. We went to visit my family last summer in Tunisia(north Africa)my wife and kids get around and communicate with everyone much easier without my help most of the times",
        "Love this app I work in a place where the communication gape is huge and this so far out of the many many I tried is the smoothest easy to use app people aren't going to stand around while you fumble with your app time is money",
        "Does exactly what it claims to do. There are so many available languages and the voice recognition works flawlessly. Amazing app!",
        "Very effective, but the backlog of previously translated phrases is getting inconvenient. Is there any way to \"clear the board\"?",
        "So, what languages use male voices? the only reason I would pay for a subscription to this app would be to use a male voice and after reading some reviews I recognize that this app does not offer refunds. I surely am not going to buy something if I don't know if the feature that I'm buying is even going to be available.",
        "What happened to the Cantonese functionality suddenly? It can't accurately recognize Cantonese speech input at all, but it was working fine not log ago??",
        "It worked great at first but now there is no sound anymore. I unistalled and reinstalled but it did not solve the problem.",
        "Was a good app until I could no longer use the voice recognition. It just stopped working randomly.",
        "This is an excellent tool. Although, I am a polyglot, this app added greatly to my tour of Europe.",
        "I want to purchase the thing that will take ads away but it keeps glitching out. 5 stars if I can get help to resolve this.",
        "doesn't translate anything at all idk what Spanish to use but its only 2 I'm in California and it keeps popping up saying it didn't catch that its 1 million Mexicans outside so idk how loud it needs to be my head is pounding from the loudness so on to the next app",
        "Poor translation app... I said one thing., it translated to other meaning.. Translated 10 out of 10 incorrectly...",
        "Worked great on my Galaxy with OS 7.0, but alt language menu comes up blank on Moto with OS 8.0.",
        "It works SOMETIMES..I use it at work with my Spanish patient and MOST of the time it wont translate for her or me",
        "i am trying to use this for English to Vietnamese translation and the Damn thing keeps defaulting to Chinese for spoken language input. serious flaw.",
        "Cantonese translation has stopped working for me as well.",
        "works better than Google translate. makes my job easier now that I can understand everyone somewhat",
        "This app is really helpful when your talking to someone with a different language",
        "It's terrible. It was okay to start with. Doesn't understand what you're saying. Also doesn't translate everything correctly. It sometimes gets it right. But sometimes isn't enough to be worth it",
        "The voice recognition not working for Cantonese. \"Recognition error\"",
        "Great translator and a great pronunciation tool."
    ],
    "editorsChoice": false,
    "similarApps": [
        "voice.translate.speak.translation",
        "com.axis.mobile.chapters.trans",
        "com.translate.talkingtranslator",
        "com.aviapp.translator",
        "com.cudu.translator"
    ],
    "moreByDeveloper": [
        "com.hawsoft.mobile.ocrtrans",
        "com.hawsoft.mobile.speechtranspro"
    ],
    "appId": "com.hawsoft.mobile.speechtrans",
    "url": "https://play.google.com/store/apps/details?id=com.hawsoft.mobile.speechtrans&hl=en_US&gl=US"
}