{
    "title": "Popeyes® App",
    "description": "This chicken delivers. With the Popeyes® app, you’ll never have to wait in line for your favorite chicken again. Just select pick up or delivery, explore our menu, add something delicious to your cart and enjoy!\r\n\r\nFeatures:\r\nMobile Coupons: Get exclusive access to the best mobile-only deals.\r\nRestaurant Locator: Find your closest Popeyes® and see their hours.\r\nMenu: Explore favorites and discover new things to love.\r\n\r\nAvailable in select locations:\r\nMobile Ordering: Order with the app for delivery or pick-up.\r\nDelivery Tracking: Track your order in real time from the restaurant right to your door.",
    "descriptionHTML": "This chicken delivers. With the Popeyes® app, you’ll never have to wait in line for your favorite chicken again. Just select pick up or delivery, explore our menu, add something delicious to your cart and enjoy!<br><br>Features:<br>Mobile Coupons: Get exclusive access to the best mobile-only deals.<br>Restaurant Locator: Find your closest Popeyes® and see their hours.<br>Menu: Explore favorites and discover new things to love.<br><br>Available in select locations:<br>Mobile Ordering: Order with the app for delivery or pick-up.<br>Delivery Tracking: Track your order in real time from the restaurant right to your door.",
    "summary": "Bringing a piece of Louisiana to your fingertips!",
    "summaryHTML": "Bringing a piece of Louisiana to your fingertips!",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.216242,
    "ratings": 52482,
    "reviews": 18504,
    "histogram": [
        6398,
        1147,
        2314,
        7466,
        35157
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "15M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Popeyes Louisiana Kitchen, Inc.",
    "developerId": "Popeyes+Louisiana+Kitchen,+Inc.",
    "developerEmail": "support@popeyestech.zendesk.com",
    "developerWebsite": "https://www.popeyes.com",
    "developerAddress": "5707 Blue Lagoon Dr\nMiami FL 33126",
    "privacyPolicy": "https://www.popeyes.com/privacy-policy",
    "developerInternalID": "5101899868543112120",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "icon": "https://play-lh.googleusercontent.com/b0cEWB0ofKuFxYboBaSq7GxLCxDc6aL2eUOeunWfm8JBp6v8zE6lZ5f-2ud4od4JJ2xT",
    "headerImage": "https://play-lh.googleusercontent.com/6_vZO_sauayUKUSHi3mYk8YGm8iNkxml4kAaqnlFfB9qbXTBeF94rXekDRuL3GP-Xpuv",
    "screenshots": [
        "https://play-lh.googleusercontent.com/NjHZr1wSTkbzpKaoN1x5TOfhI49j1_cBC4xYE4fD2CQHfjyrQr1dFw5Ruf22-DMslz_z",
        "https://play-lh.googleusercontent.com/inCiC1eM1avuPLwU_UjNnGHxFpoDAY7ObQmovA8ruz-v5FtLQLOOVoErA7HIldcACKc",
        "https://play-lh.googleusercontent.com/IBo1Y9kwBQS65uAVIIgS8eXoWgLjYwxTJaSDaOEU-0aZexfsmLfIoBPIjUSw7OjXTg",
        "https://play-lh.googleusercontent.com/pvtbgJOJDw1mpkVw1d0qk-01Gpyu0PCeZ30Axem5ZO8VVCAUQfGo1QTPQEKoe3C9Aho",
        "https://play-lh.googleusercontent.com/p8gEBwjqT9FewJT67mCMzAwniv-vHXBm9F5dCTjDsayTCU9487qXTfYXyqpUhmtVOg",
        "https://play-lh.googleusercontent.com/LJJFAHuAzOkBRkoCJIVrkZue7qHrC7uwwr6ORkms9W9voL0oMLSYQPyghmPLZMlV1KE",
        "https://play-lh.googleusercontent.com/zO3JegCcbGoeK3xtF4d_LUqC5DRlh5RjLWb3pgEKqRHoVspHiRVyNVMYvLf0SnP8CQ",
        "https://play-lh.googleusercontent.com/3Am4mRjxTJCz_RwdEIJ4mK4wLPb3lwPz6UUsefzX2M-7Wzt-gFPiHXyAdeK1QNoowA",
        "https://play-lh.googleusercontent.com/zb8HFDrYwAJqanwNYlxitj-1MPBzW3e_C8dSZ9P6EcaMfR7JwSljLeH2IQx_I-U4qr8",
        "https://play-lh.googleusercontent.com/k_9x_miVIscLMkejyYfp2-Y5rOAGQIOyPyH3XmRORq5kN-jDEJKMSAs1S8PHeI83_uSO",
        "https://play-lh.googleusercontent.com/JSA4rkH3YoUj5E839L9DutIBvugKhivN9-W7AbCFbFH7_jFkmzrYYO_0OPqXaBWvxZ0",
        "https://play-lh.googleusercontent.com/9_EAttyR2mR1ul7GE9S3xAEwKCfCWD79L5lUSTSExOhiPi0Ru6AuNFlRAIbDJN4gXsA",
        "https://play-lh.googleusercontent.com/loOnom7T9kf7PXoopWLqnG8KSNir9in6v-GdmgFwQyQI3ZiSubCB9d8mOwzF-dCmRgA",
        "https://play-lh.googleusercontent.com/ktC6wwls0FIUTe8DvH-ejHVciXJxvfSOQJD84iO9kd7RebinV63m-K2d46hxsHjXIQ",
        "https://play-lh.googleusercontent.com/CLimt09RaRRt5YfQe0WpCnWXelejBOmupdgTmDMm_6zLUIERvL55dRCe41SDG0n-hw",
        "https://play-lh.googleusercontent.com/8oLCxYLwIEoNe0_2p9Qk9um-fuX-fMhvOKOoS8Kv8KsdLmyJwzFOuG2vzcjogI96IxQG",
        "https://play-lh.googleusercontent.com/N8KyQvtFv3f6m0tLkjlIbQPxvuuW06f-RSWhKb3L_y8LxcDvO99A_rSjpJSV9GrAads"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Jun 18, 2018",
    "updated": 1646089695,
    "version": "2.19.1",
    "recentChanges": "Bug fixes and improvements",
    "recentChangesHTML": "Bug fixes and improvements",
    "comments": [
        "This app frequently has issues. It NEVER works on happy hour, when you select that area of the menu it always says an error message \"no items to show\". So happy hour isn't so happy for me...Also, sometimes when trying to redeem offers it will overcharge you for absolutely no reason. For example, I just tried to order the $5 big box deal and it said $0.00 next to the item but then the total said $15 and some change? What???? If these issues were resolved this app would really be the best.",
        "I've used the app twice and got my order in time both times. Tea was missing from the second order but that was no issue. I would like to see jalapeno peppers added to the online menu. Hubby always orders this in person. The delivery driver was able to request and get one on the second delivery. I will certainly use this app often.",
        "App is buggy. I couldn't order the $5 meal deal, because the app kept trying to charge me $16 for it! It was so frustrating that I ended up going to Burger King, instead. Their app works so much better! Bummer, because sometimes I'm craving Popeye's chicken. Oh well...",
        "This app is terrible! The app overall is great, but when it comes time to pay for the order, wow! Google Pay doesn't work, may credit card didn't work, no option to pay at the store, and worst of all you can't even use a Popeye gift card in the app. Terrible user experience! Edit: over 2 months later and still no way to use cash or gift card with the app. With the frequency of hacks and identity thieft not everyone wants to expose their credit/debit card info. Obviously not a priority!",
        "Only keeping this cause it has the menu.. otherwise don't use it to order cuz everytime I try to order for pick up it won't let me yet the store near me is open... 😡 again Only reason I keep the app is to see the menu before I go to the store.. which is annoying that I can order to pick up without something I have not being available at that store..",
        "Be very aware! Their locations often not open But their app will take your order, keep your money. Then you have call your credit card co to get your money back when you find yourself sitting in a parking lot of a closed Popeyes. Not only that, but stupid app doesn't offer option of ordering chicken only. Forced to buy their tasteless sides, when all I want is their signature bone in chicken.",
        "I really like this app! It is very easy to use and makes picking up my order at the restaurant a breeze. Not to mention the coupons offered on it are awesome! I've started ordering at Popeyes a lot more since discovering the app!",
        "Don't waste your time with the app. All you will get is cold food and still have to wait in line. If Popeyes would pay attention to their competition they would have a designated spot for mobile pickup instead you have to wait in the line you were trying to avoid. My suggestion is do not download this app, download KFC or any other chicken places app and patronize those locations who reward you for using the app.",
        "Not real happy. App doesn't allow for much customization of online orders. Stores don't really follow the few customizations available even when App allows changes. I freakin Hate Pickles !! They get their nasty juice in everything. I find spicy sandwich too hot and prefer to have sandwich made half and half mayo and spicy mayo but so far I have not been able to outrun the order 2 store 2 request it made that way. Add option to send store special requests if you want my 5 star review",
        "Good but needs more choices. Another of the coupons you select ste not available at several locations. The codes also disappear quickly so they're not able to view once you get to the restaurant/at the window.",
        "I love the app...wish that the app let you know when your food is ready...just pickup before 10 pm is no help. We are preparing your order pikup at the front counter...waited almost half an hour.",
        "Bad experience 👎 app, ordered a $6 offer meal for 3 tenders and the app kept saying it was $14. I even reinstalled the app to make sure there wasn't anything in my Cart. I took a screenshot and wish I can send to them.",
        "Great app but can't say same about the service at locations in houston it's pretty bad if your employees can't get a mix box right 3 different time recieved all dark meat for 32.00 pathetic and they didnt correct it they didn't care actually and it's ridiculous to have to go back anyway it should be right better customer service is a definite thing to improve",
        "It would be nice to order condiments like, straws, napkins, sauces. The app doesn't seem to have that. So they don't always bring them.",
        "Initially I had a lower rating based on mobile ordering because I never got my blackened ranch. This has since not been an issue. Love the spicy chicken and blackened chicken. The spicy chicken goes best with the blackened ranch. The blackened chicken is perfect as is.",
        "No ability to modify sides or add extra sauce makes this app very limited and more or less has cost Popeyes my business at this point. Just no use when your meal comes with \"1 sauce\" but everyone knows you need 3+ to actually have enough for your meal.",
        "Popeyes app needs to give points if Redeeming codes in restaurant. Why have \"Redeem in Restaurant\" button if you not giving the User points? Doesn't make sense since we are using the app to get the code to show the cashier, so we should get points. I showed the cashier the code for the food item deal & spent $11.50. I did NOT get any points for my purchase. McDonald's app is the best, at least they give points if paying in person when showing their app code. Please make this fix ASAP.",
        "Does not work properly , can't get Codes needed at Restaurants to get discounts or can't see how to make them Work, like the BOGO on chicken sandwich combo went to store they had no idea what this Was",
        "Manchester & Figueroa They always leave something out or give you something wrong. Please \"ALWAYS CHECK YOUR ORDER\"!!! SO I STAND IN 3 STARS UNTIL THERE IS A CHANGE. THEIR ATTITUDE IS \"I'M DOING YOU A FAVOR\" NOT GOOD CUSTOMER SERVICE WHEN PEOPLE ARE KEEPING YOU WORKING! FOR ONE PERSON TO EAT MINIMUM $15.00 THAT IS EXTREMELY HIGH TO PAY FOR SUBLIMINAL FOOD AND SERVICE! LIVING IN THE EASTSIDE SHOULD NOT MEAN THAT YOU DO NOT CARE! SO UNTIL I SEE CHANGE I STAND WITH 3 STARS.",
        "Like BK APP the Location Share is broken and the stores will have you jumping through hoops or denying that you even have a order. ORDER MANUALLY DO NOT USE IN-APP GPS MAPPING. Massive inconvenience.",
        "Should have just called my order in without the app. Well it sent my order and took payment correctly.....but the store told me they don't get notified when we place an order on the app. So I still had to wait and the employeeshad to fix a 70$ order on the spot. I dont like to do that, I like to give advance notice so my big fam order doesn't overwhelm employees.",
        "This app is deceitful. I have many restaurant apps and this is the only one I've had an issue. They show you lower prices in the list of offers, then you add the offer to your cart and it goes from $17.99 to $24.99. I have tried several times to use this app and that's enough, never once did I feel right using it for a transaction. I went to the location and showed them the offer for $17.99 and was told I need a code from the app, you don't receive the code until after you pay $24.99 in the App.",
        "Please get with the times! There should be a \"scan at restaurant\" option. You offer in app only deals, but not a single store in my area allows online orders anymore (I assume due to being short staffed). That totally defeats the purpose of the app! While hiring more employees might be a difficult task, adding a code to scan a deal at the store is not. It's a completely viable solution to the problem- one that many other retailers have already implemented.",
        "Useless. \"Mobile order not available\" for both locations closest to me when attempting to order promo. Done with Popeye. Uninstall.",
        "I'm using the app so more frequent for the deals, but it would be nice to have a drive thru or in store scan for item like .. some other competitor",
        "Unfortunately does not insure that product is available. So, you prepay for food you may not get and may not be able to get a refund at the store.",
        "I ordered online and picked up my order inside and didn't have to wait. Service was good and the food was great.",
        "Latest upgrade has dropped the capability to choose pick up time! Only allows immediate pick up. Very inconvenient!",
        "Annoyed Trying to add the $5 box and at checkout it jumps to $10.72. What a waste of time",
        "Amending the review and raising the score since the app actually lets me check out now. Only raising to 3 stars for now because of the mediocre help I received before, but will raise again if the app continues to improve. This app doesn't let me actually order anything, the checkout button just stays as \"...\" forever. You require an app for certain purchases but the app can't actually submit an order? Terrible.",
        "Should be 0. Last time I used the app, was told by cashier they didn't receive my order. Waited a few more minutes after attempting to get a resolution, then magically showed up. I guess best case scenario, show up 10 minutes after your scheduled time... this time placed my order at 645, I guess they close at 7 so I was out of luck. Don't try to order after 6pm, I guess. Maybe app doesn't communicate with restaurant. Take your business elsewhere.",
        "Great app, constant new deals, easy to use, accurate and no mix ups!",
        "The app has some decent deals, but the app itself is completely busted. The prices are wildly incorrect and they don't add up to the subtotal upon checkout. It says that a large combo is cheaper than the small (like the labels have been switched, but the prices are changed in the checkout menu. So much potential...",
        "I like the app to be able to order ahead & get points for rewards. I do not like the app because it does not allow me to scan at the restaurant to receive points toward rewards. It also did not let me upgrade my side. It also does not allow you to order more than one of the same combo when you are ordering for more than one person. You have to wait 5 minutes and place an entirely new order.",
        "This is the worst app!!!! I ordered on the app set a time to pickup, and the food wasn't ready. Then for a refund I have to wait 24 -48 hours for someone to get back with me? It didn't take long for them to take my payment so I'm deleting it and will never go back to the restaurant again.",
        "I can't order multiple $5 boxes on the app in a single transaction. Store was very busy, but Tannequa(?) was doing a great job of maintaining order, settling down impatient customers and completing transactions quickly without losing her cool. I have seen her before doing the same effective job. She deserves mention.",
        "Hi, I'm very disappointed in the app. I tried to redeem a coupon in-restaurant and it keeps looping around to redeem coupon and throwing me back to ordering the food. It doesn't allow you to retrieve the coupon code to provide to the cashier in the restaurant. Fix this please!",
        "Half the offers on the app aren't available. It's slow and glitches often. Not worth the download.",
        "Why offer Curbside if you still have to wait for order to be fulfilled?! I ordered 30 full minutes before I arrived for pick up and still waited 15 minutes for chicken to be cooked! Pointless app! Instead, go through Drive thru...just as slow without pointless app taking up storage on phone.",
        "Pick up is fine, delivery is the actual worst. First time, they screwed up fine let it slide. Second time i tried delivery the order didn't even show up, the tracker was useless & tye contact info for the driver wasn't valid. Don't use the app, it's pointless. Use any other delivery share"
    ],
    "editorsChoice": false,
    "similarApps": [
        "wb.mobile.cx.client.droid",
        "com.jackintheboxinc.JackMobileApp",
        "whitecastle.ordering",
        "com.snapfinger.mobile.zaxbys",
        "com.tacobell.ordering"
    ],
    "moreByDeveloper": [
        "mx.popeyesmexico"
    ],
    "appId": "com.emn8.mobilem8.nativeapp.popeyes",
    "url": "https://play.google.com/store/apps/details?id=com.emn8.mobilem8.nativeapp.popeyes&hl=en_US&gl=US"
}