{
    "title": "MyBlock",
    "description": "Need professional tax help? Get in touch with an H&R Block tax pro any time of the year, with secure messaging, screensharing, and video chat capabilities.\r\n\r\nEnjoy a stress-free solution for in-person or virtual appointment planning and prep – or switch to a new appointment type whenever you want.\r\n\r\nWant help managing your tax forms and info? Answer a few quick questions, and we’ll tell you exactly what docs you need to file your taxes.\r\n\r\nUse your personalized tax organizer to collect your docs and get ready to file your taxes. \r\nStart your taxes before your first appointment by uploading docs and info through the app and answering basic tax questions.\r\n\r\nTake a pic of your forms to quickly add them to your MyBlock account.\r\n\r\nUpload receipts, donations, tax forms, and more as you get them throughout the year. No more scrambling for lost docs at tax time.\r\nGet quick and easy access to your documents and tax returns — for all of life’s big financial decisions.\r\nEstimate your potential refund and keep tabs on your return status after you’ve filed.\r\nWant to explore the latest in mobile banking?\r\nManage your H&R Block Emerald Prepaid Mastercard® – keep tabs on your refund, current balance, and payments as you spend.\r\nSave for what matters, with our easy savings tools.\r\nAccess your credit score through LendingTree to stay on top of your financial goals.\r\nCheck your Tax Identity Shield account and membership to protect your tax identity and get alerted to potential issues.\r\n\r\n\r\nMYBLOCK: TAXES, PLUS SO MUCH MORE. \r\n \r\nYour privacy, security, and guarantees are important to us. Please visit hrblock.com to learn more. \r\n \r\nPrivacy Policy: https://www.hrblock.com/universal/digital-online-mobile-privacy-principles.html",
    "descriptionHTML": "Need professional tax help? Get in touch with an H&amp;R Block tax pro any time of the year, with secure messaging, screensharing, and video chat capabilities.<br><br>Enjoy a stress-free solution for in-person or virtual appointment planning and prep – or switch to a new appointment type whenever you want.<br><br>Want help managing your tax forms and info? Answer a few quick questions, and we’ll tell you exactly what docs you need to file your taxes.<br><br>Use your personalized tax organizer to collect your docs and get ready to file your taxes. <br>Start your taxes before your first appointment by uploading docs and info through the app and answering basic tax questions.<br><br>Take a pic of your forms to quickly add them to your MyBlock account.<br><br>Upload receipts, donations, tax forms, and more as you get them throughout the year. No more scrambling for lost docs at tax time.<br>Get quick and easy access to your documents and tax returns — for all of life’s big financial decisions.<br>Estimate your potential refund and keep tabs on your return status after you’ve filed.<br>Want to explore the latest in mobile banking?<br>Manage your H&amp;R Block Emerald Prepaid Mastercard® – keep tabs on your refund, current balance, and payments as you spend.<br>Save for what matters, with our easy savings tools.<br>Access your credit score through LendingTree to stay on top of your financial goals.<br>Check your Tax Identity Shield account and membership to protect your tax identity and get alerted to potential issues.<br><br><br>MYBLOCK: TAXES, PLUS SO MUCH MORE. <br> <br>Your privacy, security, and guarantees are important to us. Please visit hrblock.com to learn more. <br> <br>Privacy Policy: https://www.hrblock.com/universal/digital-online-mobile-privacy-principles.html",
    "summary": "All new experience with easier collaboration between clients and tax pros.",
    "summaryHTML": "All new experience with easier collaboration between clients and tax pros.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.9582365,
    "ratings": 105413,
    "reviews": 26353,
    "histogram": [
        16668,
        4725,
        8608,
        11746,
        63666
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "H&R Block",
    "developerId": "H%26R+Block",
    "developerEmail": "myblockapps@hrblock.com",
    "developerWebsite": "http://www.hrblock.com/mobile-apps/mobile-app.html",
    "developerAddress": null,
    "privacyPolicy": "http://www.hrblock.com/universal/digital-online-mobile-privacy-principles.html",
    "developerInternalID": "8369407811257285089",
    "genre": "Finance",
    "genreId": "FINANCE",
    "icon": "https://play-lh.googleusercontent.com/se2MuOmrSIdiBTbx4_fVk-933hnRiFlHcpT1uGAmx4Fq6HwBmJe9UfvwwV4kifSLvQ",
    "headerImage": "https://play-lh.googleusercontent.com/qWEzEhobBVLY_0rRLymIPSg_T36IP5T0oiBQ_0-6YaIncASG8kSsYSDqsc4ZX6neiLQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ubmTNj50-iitQzG26ScCFUh8ZoN6oduZSKiv6M5adcL8KXDFZrtXlyku5R3LwT7vmg",
        "https://play-lh.googleusercontent.com/mfvYF9ZsiCYDL67rBY8noMUmh-aTO-95_6epK849Ph14qwBSpHNZmUkW_Tllb1JKWAcH",
        "https://play-lh.googleusercontent.com/nKNTXo6R6UF4Nwa7cJjOrhKatmzwlfh-qhiWTVC7mG_XI3JoDIZYwt7ZoNgC6VyU9x4",
        "https://play-lh.googleusercontent.com/euk3QciXQGmK1kZSZXE2uu83EZzDVMPgLff6p-N6yPWuFkSukFBWfbrOccNq31QjIqU",
        "https://play-lh.googleusercontent.com/OQZYqFFjalJ4p0aH157AqOYsWu-tbLnIKCy49hgMl_N2wjtz-V7Hfl5iMy4WCM88aug"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 29, 2011",
    "updated": 1646066521,
    "version": "10.6.0",
    "recentChanges": "Usability enhancements and bug fixes.",
    "recentChangesHTML": "Usability enhancements and bug fixes.",
    "comments": [
        "If you want to waste your time & money, then sure download this app to file your taxes. Everything was working fine, then I got to the payment screen and paid the H&R Block fee. After they got my payment, it suddenly started having \"glitches.\" For 3 days I have been logging in so I can simply press that final button to file my taxes but it'll take me all the way back to \"the last screen I completed\" & I have to go through the process all over again. I'd file some other way, but they've got my $",
        "Last update removed all the words from the app, so I can no longer actually use the app. Also, don't ever upgrade your tax package through the app, because there's no way to downgrade back to the free version unless you want to call them and wait on hold. I'm only still using H&R Block because they have all of my previous tax information and it is supposed to make it easier to file. Which was fine, until all the words disappeared from the app.",
        "Absolutely awful! I did the update it asked for and SURE ENOUGH,Nothing changed. I sign in and it acts like I'm logged in and immediately it takes me back to the sign in screen. I haven't been able to to sign in for a week and a half now!!! It's tax season, you would think they would make sure it was working right. First time I've gave one of my apps a BAD review and 0 stars. LoL I had to give it 1 star in order to post my review but honestly it doesn't even deserve that so I give it 0 STARS",
        "I have never had a big issue with this app till recently something has changed with check to card. almost impossible to use check to card refuses almost everything to the point I don't bother with it. Recent update took away check balance option which was just there. That was at one time the most useful thing now I have to actually sign in to get balance. I don't understand why that would be taken away.",
        "App no longer opens? I've been using the MyBlock app for a few years now and had no issues until today. When I open the app, a box appears with no text inside but an ok button. When I click the ok button, I'm brought to the Google app store with no explanation. Please correct this issue. If an update is needed, please allow users to update the app.",
        "This app is buggy. It won't load the main screen or account screen properly, to where you cannot see any text nor know what you're clicking on. While filing my taxes, they have you go to a browser based app to take a picture of your w2 then return to the app,but the app forces you to sign in every time you leave it and restarts you at the last checkpoint. Thus the picture isn't uploaded. When in they give you the option to upload a picture in the app, the button \"tap to upload\" does nothing.",
        "This app does not help anynore than just calling the office to get an answer to a question or calling the back of your card for the balance. There is no advantage to this app at all and just takes up space in my phone for 9 months that I don't use it anyways. I had a problem getting my tax return back from 2021 tax season and I left message after message and didn't get any help till the next season started anyways. They didn't even answer a message till following season. Waste of phone space!",
        "The app use to be great but now it has quite a few issues. When using finger print ID login it asks multiple times and sometimes it doesn't work at all. Load times even with great cell service (or wifi) is ridiculously slow. When you actually do manage to login you're greeted to a white background with white lettering so you can barely read anything now. I seriously hope they fix these issues because they have become quite annoying and tiresome.",
        "This app is good if you wanna check you balance... I had purchased an item online and forgot the name of the company that I ordered it from and it did not arrive in the mail, so I was trying to locate the name of the company through the H&R Block app but it wouldnt go back more than 2 months so I can't remember the name of the company & I'm out over $200 & H&R Block refused help?! Re-review(2/15/2022) WAY TO MANY UPDATES!!! What's worse, they don't and won't update automatically?!?! P.I.T.A.!!!",
        "I'm new to The App and was just fine before today. The need update won't let me access the app at all. I click the OK and it takes me to Google play, then it tells me to open because I have it downloaded and no update to download. I have done this many times. I have even uninstalled and tried to reinstall the app. Still the same thing. Says an update is needed to access the app or my account. Deeply frustrating while waiting for my Tax return over my emerald card with no way to really know.",
        "App worked great for the last 4 years I have used it. Now after the stupid update. I sign in and go to see my tax page and it shows nothing but 2 check marks. Then go to use check status and says can not be used. I don't get why update something that has worked fine for years. Also code did not work would keep sending same code and say not correct code. Please put it back to what it was prior to this last update. Terrible°°°",
        "This app sucks!! It's completely useless!! Every time it updates, every time I open it... MORE functions do NOT work. Now I can't even look at my information. Can't do ANYTHING with this app.. not even update my tax appointment! Tells I've got 2 alerts??? ... but won't let me see them!! SOMEONE PLEASE DO BETTER WITH THIS APP!!! As of right now... it's enough to make me leave H & R Block!!",
        "I've used the app in the past to file simple tax returns, work great! However the issue I've been having lately is the white background is too bright and I cannot see any of the messages on the screen. I Uninstalled and reinstalled the app, it did work but the very next time I signed in the issue repeated itself. Any suggestions?",
        "There's no description under the pictures. There's no way to transfer money from your account to an external account. Transfer fees take entirely too long or cost too much. Account information page is blank. Information about account changes Don't fit on the page and the screen rotation doesn't work, so I could not read whatever info they were trying to send",
        "Every part of this app is broken, every verification code they've sent has been incorrect, every time I tried to take a picture of my documents the app would crash. After it crashed 3 times I tried logging back into it and it told me I had 3 failed login attempts after having absolutely NO failed attempts. The worse part is that H&R Block is pushing to have this app become mandatory later on. I do not recommend this app AT ALL, if I could give it 0 stars I would.",
        "This app is awesome. It might work for someone who can sit down and do their taxes in a single session, but if you need to switch between apps, or save and come back later, this app is a huge time suck. It spends forever loading, and even returning back to the\"last worked on page\" it will often kick me back to the beginning. Negating on the website on my phone is way easier.",
        "Invisible text. Sends me to update when there is no update. And prior to this it would only cycle through a login loop when my info was correct. I'm supposed to trust my sensitive personal financial info with a company that cannot even provide a functional app. During my in-person meeting, I was asked to upload a photo of my ID, it didn't work, and several employees repetitively told me I needed to find a way to \"figure it out\" and were unable to provide any solution onsite.. Fix this..",
        "The app currently is completely broken. I get a blank screen with an OK button. Clicking ok takes me here. There is no way to bypass it and it won't go away. I reinstall the app. The box is still there, but now it says \"you must update to the latest version\". I am on the latest version, and I've reinstalled twice. I can't use the app at all.",
        "Well for starters, comma I could not do anything as far as uploading my taxes and filing them by myself because it kept asking for payment. 2nd after I updated the app it was just a blank screen and I could not see anything. I ended up just going in and talking to a tax prep and paying almost a $100 anyways.. If it's gonna be that much of a hassle to do it online through your app, I may as well just continue going in.",
        "Not user friendly when it comes starting your taxes and navigating back to add more data. You get the option to begin or go to last page completed. No option to jump in between to add income data. You go through like 20 clicks to start from beginning and impossible to get back that screen when you select last completed. Also, I could not load a pdf file from Robinhood which is the required file type. I expected better from a key player like HRBLOCK. Time to see what Turbo has for me?",
        "Very frustrating to use! None of the \"learn more\" sections do anything, so I get ZERO help. The \"snap a pic\" of my W2 feature does not work with the app. At all. Last year, this app was worth it to not have to go in, but now I'm honestly pretty mad I have to pay you for such frustration and inconvenience.",
        "App Appearance is bad/can't see text. Generally the app is good (4-5 stars), but right now it is unusable. I open up the app, and I can't read most of the text. It's like Ikea developed the app--i can see pictures, and words when I type, but I think the font is white on white background. I seem to have the most current update. This is for a Pixel 2.",
        "I started my return originally on the web on desktop. I have a few things to go back and clean up, plus I wanted to review my return again. I was hoping to be able to just do that on my phone from the comfort of the couch, but navigation in the app to go back to previously completed sections is absolutely horrible. They also provide a list of things that need to be fixed when you go to file, along with links to the sections, but they don't seem to take you to the right place.",
        "I've been using this app for years , this year isn't working very well. I tried to get my W-2's in, none of them scanned (maybe it's not the app, but still). Then none of the green hyper-links work (\"what is this\" , \"how does this work\", etc) if you have questions about something. Now I'm onto the part where I have to type in Box 12, for \"self employment plan contributions\", and it won't bring up my keypad. It's taking forever bc of everything",
        "sometimes it says what it should but others it doesn't even show we filed our taxes. Now its gone from our return was excepted to an alert and the tax pro is working on our taxes its also showing they were never even sent. But IRS app now has our deposit date. Update: This year it won't let us check our return status. Our state has been sent it doesn't show any record of that, our federal has a deposit date, doesn't show in the app. Basically don't rely on them for information use Irs website.",
        "I usually use the free edition on the web, but thought it'd be nice to use the app thos year. This app is buggy and poorly designed. I can't go back as needed to get to certain parts, it keeps giving updates that aren't fixing anything just making harder to use. I am extremely disappointed since a company with a well known name like this can more than afford to produce a well designed and user friendly app. Get it together HR you guys have been sucking at your jobs since the pandemic started.",
        "The app rarely works, i can log in and sometimes check my card balance but most of the time it only shows pictures no words so i have no idea what the boxes to click are for and if i click one it's the same on the next page just pictures, other times it just freezes and i have to close it and sign back in. I have been trying for about a week to get info on my taxes but have been unsuccessful because the app is useless.",
        "App no longer works. Keeps telling I need to update in the appstore but there is no update. I Uninstaller and reinstalled, nothing worked. Really sucks because now I have to call the phone number for my balance. Update: I was finally able to update and this app is so broken its crazy. Now it's telling once again that I need to update and low and behold, there is no option to update. Worst app ever not even an exaggeration",
        "I've always hated doing taxes but this year was the worst. I tried this app only to get empty text boxes and constant app errors(can't upload w2 or take picture) and one bug that entirely stops my taxes on one of the last steps. I've tried calling them over ten times and they always hang up randomly when it's my turn. Save yourself the headache and choose a tax service that cares.",
        "Whatever you do, make sure you DO NOT hit the back button at any point while in the app, or switch to another app, even for a moment, because if you do, the app won't work right, and you'll have to close it out, force stop, and clear cache and data, then return to the app, log in, and put in the security code, AGAIN. If you're in the app, STAY IN IT until you're done, and DON'T hit the back button!",
        "I've used HR Block for the last 10 yrs. I'm not sure what's going on with this app but something has to give! I know I didn't upload all of my docs and it's pushing me to finish! And it won't let me go back! I tried calling the 800# for assistance & after it asks what I'm calling about & confirms it, the automated voice simply says 'Thanks for calling' and disconnects. If I don't get a response from this,I'm taking my filing business elsewhere! Let's go EXPERTS!! FIX THIS!!!",
        "This app is terrible. It never works properly. Tried using it last year, and this year for my taxes. You can't view anything half the time in the mobile app. It is a little better on my iPad. I can at least read messages from my tax pro on there. Forget about uploading documents through the app though. I had to go on my computer to do it through the website. App is up to date, and have deleted and re-installed app. Just doesn't work. How does H&R block have such a terrible app?",
        "I can never get it to run right. Like right now, the appnis saying I need to update, press of to take me to play store then no options for update and shows latest version. Sign out, try again... 3 or 4 times, still nothing and here I am. I just want to know if anyone has even looked at my takes that I was unable to upload the documents to, after a million tries from 3 different devices. So took my documents in Friday around 1030 ish. Tuesday am and idk if 8 should call them since can't use app",
        "It's a lot of work to get through the app and do anything. Even pointless tasks. It makes me want nothing to do with my taxes, despite the $8k return the tax pro managed to get. It feels like this app should be fully tax pro side, or redesigned with customer use in mind while limiting the redundancies. Having them tell me a code, just to put said code in on the same page is just silly. They verify my identity so much, that it feels more at risk. TL;DR: Tax pros are awesome, app is bad/dangerous.",
        "The app asks me to login a hundred times using my fingerprint, then when it finally lets me log in, the screen goes completely blank, just a white screen and then nothing happens from there. Like nothing at all! I used this app last year and it worked okay...in the beginning...but then started doing the same thing. This app is totally useless! I really wish it could be fixed though, because it is tax time and it was convenient, when it did work.",
        "I love the accability of the app but it never seems to load all the information. Only bits and pieces. And ive used it for years and normally it works fine. This is the first year ive had any issues with it. Also its updated more times this tax season than any other so you would think it would be fixed but its not. If this issue could be fixed id give it a 5 star rate. Its very helpful for many things and like I said ive used it for years without issue.",
        "App only works when nobody is expecting money. I can't even sign in now because a box pops up that I cannot see the text in, just a green OK button that takes me here. There is no update to download. Once I can get in, I expect things will be the same as always during tax season, slow loading times, glitches, and major difficulty seeing my card balance. Website is even SLOWER if you can imagine that in 2022. HRBlock clearly doesn't care, as it's been like this for years and years.",
        "This app is useless since the update. Can't even log in now. It sends me a security code even though I've logged in a million times on this device. I have to switch to my messages to see the code. When I switch back the app resets itself and the code is no longer valid. So what am I supposed to do?? Oh and forget customer service now. It used to be great. Now they really really do not care.",
        "OMG. This app does not work at all. Options will pop up and disappear, buttons will not register, even restarting the app and my phone fixes nothing, it's a nightmare. I've been trying to put in my information for the past hour. I haven't even got past putting in my ID.",
        "Updated the app and now every aspect of each category, ie; profile, messages, account... are all blank. There are lines, but nothing written on them. I tried to send a message to the person we're working with and i don't even know if it got to her. Hope this is fixed soon, this app was really nice to have all tax documents on a secure app."
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.hrblock.AtHome",
        "gov.irs",
        "com.taxslayerRFC",
        "com.libertytax.libertytaxmobile",
        "com.nicusa.gov2go"
    ],
    "moreByDeveloper": null,
    "appId": "com.hrblock.blockmobile",
    "url": "https://play.google.com/store/apps/details?id=com.hrblock.blockmobile&hl=en_US&gl=US"
}