{
    "title": "YouTube",
    "description": "Get the official YouTube app on Android phones and tablets. See what the world is watching -- from the hottest music videos to what’s popular in gaming, fashion, beauty, news, learning and more. Subscribe to channels you love, create content of your own, share with friends, and watch on any device.\r\n\r\nWatch and subscribe \r\n● Browse personal recommendations on Home\r\n● See the latest from your favorite channels in Subscriptions \r\n● Look up videos you’ve watched, liked, and saved for later in Library \r\n\r\nExplore different topics, what’s popular, and on the rise (available in select countries)\r\n● Stay up to date on what’s popular in music, gaming, beauty, news, learning and more\r\n● See what’s trending on YouTube and around the world on Explore\r\n● Learn about the coolest Creators, Gamers, and Artists on the Rise (available in select countries)\r\n\r\nConnect with the YouTube community\r\n● Keep up with your favorites creators with Posts, Stories, Premieres, and Live streams\r\n● Join the conversation with comments and interact with creators and other community members\r\n\r\nCreate content from your mobile device\r\n● Create or upload your own videos directly in the app \r\n● Engage with your audience in real time with live streaming right from the app\r\n\r\nFind the experience that fits you and your family (available in select countries)\r\n● Every family has their own approach to online video. Learn about your options: the YouTube Kids app or a new parent supervised experience on YouTube at youtube.com/myfamily\r\n\r\nSupport creators you love with channel memberships (available in select countries)\r\n● Join channels that offer paid monthly memberships and support their work\r\n● Get access to exclusive perks from the channel & become part of their members community\r\n● Stand out in comments and live chats with a loyalty badge next to your username\r\n\r\nUpgrade to YouTube Premium (available in select countries)\r\n● Watch videos uninterrupted by ads, while using other apps, or when the screen is locked\r\n● Save videos for when you really need them – like when you’re on a plane or commuting\r\n● Get access to YouTube Music Premium as part of your benefits",
    "descriptionHTML": "Get the official YouTube app on Android phones and tablets. See what the world is watching -- from the hottest music videos to what’s popular in gaming, fashion, beauty, news, learning and more. Subscribe to channels you love, create content of your own, share with friends, and watch on any device.<br><br>Watch and subscribe <br>● Browse personal recommendations on Home<br>● See the latest from your favorite channels in Subscriptions <br>● Look up videos you’ve watched, liked, and saved for later in Library <br><br>Explore different topics, what’s popular, and on the rise (available in select countries)<br>● Stay up to date on what’s popular in music, gaming, beauty, news, learning and more<br>● See what’s trending on YouTube and around the world on Explore<br>● Learn about the coolest Creators, Gamers, and Artists on the Rise (available in select countries)<br><br>Connect with the YouTube community<br>● Keep up with your favorites creators with Posts, Stories, Premieres, and Live streams<br>● Join the conversation with comments and interact with creators and other community members<br><br>Create content from your mobile device<br>● Create or upload your own videos directly in the app <br>● Engage with your audience in real time with live streaming right from the app<br><br>Find the experience that fits you and your family (available in select countries)<br>● Every family has their own approach to online video. Learn about your options: the YouTube Kids app or a new parent supervised experience on YouTube at youtube.com/myfamily<br><br>Support creators you love with channel memberships (available in select countries)<br>● Join channels that offer paid monthly memberships and support their work<br>● Get access to exclusive perks from the channel &amp; become part of their members community<br>● Stand out in comments and live chats with a loyalty badge next to your username<br><br>Upgrade to YouTube Premium (available in select countries)<br>● Watch videos uninterrupted by ads, while using other apps, or when the screen is locked<br>● Save videos for when you really need them – like when you’re on a plane or commuting<br>● Get access to YouTube Music Premium as part of your benefits",
    "summary": "Enjoy your favorite videos and channels with the official YouTube app.",
    "summaryHTML": "Enjoy your favorite videos and channels with the official YouTube app.",
    "installs": "10,000,000,000+",
    "minInstalls": 10000000000,
    "score": 4.265642,
    "ratings": 134429375,
    "reviews": 2686494,
    "histogram": [
        15627662,
        3438797,
        6366191,
        13159746,
        95836979
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "Varies with device",
    "androidVersion": "Varies",
    "androidVersionText": "Varies with device",
    "developer": "Google LLC",
    "developerId": "5700313618786177705",
    "developerEmail": "ytandroid-support@google.com",
    "developerWebsite": "https://support.google.com/youtube/topic/2422554?rd=1",
    "developerAddress": "1600 Amphitheatre Parkway, Mountain View 94043",
    "privacyPolicy": "http://www.google.com/policies/privacy",
    "developerInternalID": "5700313618786177705",
    "genre": "Video Players & Editors",
    "genreId": "VIDEO_PLAYERS",
    "icon": "https://play-lh.googleusercontent.com/lMoItBgdPPVDJsNOVtP26EKHePkwBg-PkuY9NOrc-fumRtTFP4XhpUNk_22syN4Datc",
    "headerImage": "https://play-lh.googleusercontent.com/vA4tG0v4aasE7oIvRIvTkOYTwom07DfqHdUPr6k7jmrDwy_qA_SonqZkw6KX0OXKAdk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/BxbaFv67YkqT48wc4-9ILNSmLYLb92mgkrAYdyBwI478H2s6UDTutAveNu7cOZFEeSg",
        "https://play-lh.googleusercontent.com/lnfQ42Hslc6B_0A37YY_sNVPGEpND0YY0hcvjKLPCDB7dJNlDPn2ILICypeJxhecBQ",
        "https://play-lh.googleusercontent.com/nD2LH9KrtYmdruRXUn2ZQypfPHViJ1UYB1fHDN7Ti5JOmq8qHd-54oBCAVNUqvGWYC8",
        "https://play-lh.googleusercontent.com/xCBJ9BRKffRi8orvRzLn-LcMPPc1A8QC383k8NldcIREeoprwffXPgM_m85yD61B1Ng",
        "https://play-lh.googleusercontent.com/vOxdD2u-ys9J0U964Hle8gCzNAAht5-KR_xJcPCb1ukoGo_4ypD2nByU6wu-x8MUEw"
    ],
    "video": "https://www.youtube.com/embed/__NeP0RqACU?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/vA4tG0v4aasE7oIvRIvTkOYTwom07DfqHdUPr6k7jmrDwy_qA_SonqZkw6KX0OXKAdk",
    "contentRating": "Teen",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 20, 2010",
    "updated": 1646141589,
    "version": "Varies with device",
    "recentChanges": "For new features, look for in-product education & notifications sharing the feature and how to use it!",
    "recentChangesHTML": "For new features, look for in-product education &amp; notifications sharing the feature and how to use it!",
    "comments": [
        "I don't get why I've been having some stupid issues with YouTube app recently. Some of the videos I play keeps loading forever as if my connection was lost (which it's not), even if I restart the app. When I try a different one, it loads perfectly, but out of the blue, when I click on a random video, it simply won't play. There is also this stupid bug that makes my scrolling bar scroll up by itself while I have a video up and I'm scrolling down through the videos. Absolutely dogshit 👌",
        "I've been experiencing lots of glitching and pausing within the app. When I play one video sometimes other recommended videos play within at the same time. They kind of glitch and overlap. Ads overlap with videos also. After watching videos for some time the app also starts to not function properly. App pauses and glitches, actions can't be made and pressing the home button on my phone sometimes won't work. Some videos also appear to be cut in half at times so I can't see everything.",
        "Can't even hear music anymore because it pauses by itself all the time. Thanks Android 12 update. Then top that off with the bombardment of ads that take longer to skip not to mention the ads getting ridiculously long. Some go on for hours. Pinch zooming also has gone downhill as well. Can't believe an older firmware on an older phone works better than newer firmwares on recent phones. Wish there was an easy way to go back a firmware or 2. Wish this app worked well like it did a few years ago",
        "UPDATE, S22 ULTRA.I'm going to jump on the bandwagon here, bring back the simple resolution selection, or at least make it so you can set a resolution in your account. Having it constantly switch resolution is annoying. Well another thing to put this at one star, some shorts just refuse to play even after closing and reopening, full 4glte bars. Please fix these two things and i might give a star back.",
        "This app is loaded with ads and has severely limited functionality for unpaid users. If you try premium for a month you will understand how greedy Google truly is. They have sued third party developers who have previously added their \"premium\" features for free public use, then try to charge a monthly subscription for the previously free features they sued to have taken down. I'm not going to use this app much now that my premium trial has ended.",
        "This app is of course the best thing that has happened to pop culture and more. All of our old vhs and other sources are documented now by this power house and archive of both new and old video and audio. I dreamed of something like this happening and it has been realized. This is by far the best app for all users on all software formats. The other cool part is that all of us can be stars now or have a shot. THANK YOU!!! I wish I could pay all of the love back 😪 5 🌟stars!!!",
        "Live this app. Tried some of the other music and video sites , but You Tube is by far the best. Really like the premium version. I can watch videos and listen to music any time I want, even if I am o line . And don't mind a commercial here and there. You Tube creates playlists for me to listen to, and I really like the music they put together for me. Plus I don't have to worry about keeping my account secure, being part of Google, I know and trust that Google is looking out for my security .",
        "I dont like this app at all. I still use it but, im rating it 3 stars because, 1 overdose on ads, and 2 horrible at recommendations. When i am watching shorts, I accidentally like one short that is a small channel and you reccomend a bunch of others and they still havent gone away. And for the ads, they dont reccomend any that I like. So you need to try better on this app.",
        "I gave YouTube 2 Stars because I could not watch videos because the overlay for start/stop would not disappear. I have YT Premium so not being able to watch was more than mildly irritating. The programmers have fixed that problem, so I am very happy to change my review to 5 Stars. Thanks ya-all!",
        "Ads! Why?! I pay for premium YouTube. It advertises no ads. But here we are, ads with every video. Even ads placed throughout the videos. I don't get it. I've updated the app, signed in and out numerous times. Nothing will fix it.",
        "YouTube to me is the app I use 95% of the time. I don't have the ads because I have YouTube premium , for everyone complaining about ads just get premium and you have no ads and have unlimited downloads offline. YouTube is the greatest entertainment app in my opinion . Basically another form of social media at this point. Love it",
        "I can't even with this recommendations that I get for some reason. I look up animation memes and the first few are normal then there is click bait 18+ thumbnails. The double ads have become ridiculous. I have gotten two ads on 30 second videos. This isn't even the beginning of the list of things that could use a 'bit' of tweaking. I love using this platform but there is so many little things that make me hate to use it at times. I would like to say more but there is a limit to how much I can say",
        "I have youtube premium and it won't continue playing while you're listening to your music. You can get through 3 songs then it will stop playing. You will have to keep starting the list all over again. I've Uninstalled the app and reinstalled it still does the same thing",
        "Bots and spam outta control! Cannot keep video resolution selection. New suggestions are garbage. Can't see dislikes count. A lot of fake accounts posting all over the place. Keeps recommending things in languages I don't speak. Will no longer minimize and continue playing in mini player when trying to multi-task. No developer contact available all opportunities to contact are non reply accounts. They know its going down the chutes and won't even listen to the people who make them$. Such a shame",
        "I like watching YouTube for hours at a time but lately I can can watch a video for longer the 30 before it starts buging out, it will change my volume, pause the video and then play it again it will randomly play a now video and a split second later it will play a know video and it will do for like 5 videos, then it will go to my home screen and have the mini screen. And I don't know if it is YouTube or just my phone. If you read this see if it YouTube or just my phone",
        "AdTube. Excellent user created content at the expense of our time. Constantly increasing ad count, duration, and interruptions (I'm talking about you overlays!) make YouTube the last place I look for content now. Ads when searching, ads when watching, ads, ads, ads... Looking forward to whatever the next platform is. Anything else is better.",
        "The ads are out of control and the premium version is not only barely worth it, but screws up billing every time. Even if you can afford to remove the obnoxious and often malicious ads, the app is unstable. The first video after launch always buffers forever, and its about 50/50 if the whole app crashes or runs fine after stalling for 5 min.",
        "Where to start! First they harass you with premium without the option to never show again. You can't close the app even with videos that only require audio. You can't see what videos have more dislikes than likes so you have to waste time watching bad videos and making mistakes that you wouldn't normally make if you were watching a good video. All in all, won't use this app anymore.",
        "This is not a review of the YouTube service, this is simply a review of the app. While this app has a lot of great features, it unfortunately compromises on basic performance. The app very frequently lags, freezes and crashes. Google needs to do a better job. It's shameful that Google products don't work better on the Google operating system. You have enough money to hire talented engineers, fix your services!",
        "I've had my YT account since 2006 or 7. I enjoy all the diff. Genres & creators, etc. It's crazy how posting videos can make ya RICH! Times change. But YT has gotten RIDICULOUS w/ the damn ADS!! ADS @the beginning,ADS every few sec.'s-LONG ADS at that-ADS ADS ADS!Idk what the reason is, if there's someone new in charge of that dept., you're tryin' something diff., or if those $ signs are making the decisions,But whatever it is... puh-leez FIX IT! As the sayin' goes, \"If its not broke...\" 😉",
        "Took away most Closed Captions on videos. It was perfectly fine how it was set up before. Individuals used to be able to submit captions for any un-captioned video, which helped things become more inclusive for people who are deaf/hard-of-hearing/speak another language. Now only video creators can add captions. This leave many older videos un-accessible as well as many new ones.",
        "YouTube is out of control with adds. The worst part about it is the constant interruptions during the most important parts of what you're watching!!! Right at a critical part, or an emotional part, of whatever movie or video you're watching, up pops an UNRELATED commercial!! Are you kidding me with that YouTube!!?? Are you even paying attention to where you're putting your stupid commercials OR how often?? Of course you are because you're flipping greedy. Use to be my fav. 😩 From a 5 down to 2.",
        "Don't get me wrong, I like the app, but I just don't like the fact that I have to close out of certain things because they won't load, or thing that I had previously watched were permanently stuck on the loading screen. Thats why I gave it three stars, not because of the media or stuff like that, I gave it 3 stars because of the issues it has constantly with every update.",
        "I absolutely love YouTube videos and tutorials I absolutely rely on them for so much information on how to do there's anything I would like to do! However, one thing I do not like about YouTube as out there's so much censoring what people say because other people get so sensitive about everything but that's just a way to control things in society and in our culture it's obvious. But anyhow it's nothing new",
        "It seems there is another pointless update every week. Recommendations and notifications are constantly broken. Excessive ads,any of them forced, and still no ability to play a video with the screen off without paying. A feature that is standard on virtually every other media streaming platform. This platform has been corporatized to the point of being cable television's illegitimate sibling.",
        "Sometimes it works fairly well when I'm watching videos and just doing the same normal stuff I always do on youtube. But ever since I got this new phone (Galaxy Flip Z 3) & the new 5g thing or whatever. I feel as if it's just gotten slower and takes longer for videos to load.",
        "The app just keeps getting worse. 1. Still doesn't have an option to play a playlist in chronological or alphabetical order. 2. The recommendation keeps showing the same videos over and over again. 3. Recently the screen doesn't turn off any more after video finishes. Update: while not adding more valuable features, you took away the down vote indicator and made it hard to see which video is worth watching. Great example of why monopoly is bad since there's nothing the customer can do about it.",
        "Design is terrible. Let's say you search a \"how to\". You see 5 vids worth watching; you play the first. Vid finishes, you hit back; you are at a YT Home Screen, NOT seeing the other 4 you wanted to watch; and there's no history. You have to start over AND OVER. Ads forced on.everyone. No longer fun or pleasant to use.",
        "I wish there were better ways of protecting my child other than the kid YouTube app because he says it's for babies. And even with the parental controls on there's a lot of foul language, and some inappropriate videos that still come through. I just wish they would make it more advanced version of restrictions to protect my seven-year-old.",
        "I would give yt a 5 start but i have one thing thats pretty annoying, that is the ads. I was watching a video that was getting really good then an ad popped up and ruined the vibe of the video. What i love about the app is the content, its so entertaining when your bored. When you dont know what to watch i recommend \"Stroke Twins\", \"Angelazz\", \"Themermaidscales\" or any other comedy/gamer. Thank you :)",
        "You know, in case being forced to watch multiple ads wasn't enough. Youtube thought it would be a great idea to create a pop up of the ad that was shoved in your face to the right of your screen taking up most of the screen when your video begins to play. And don't get me started on the interface for changing video quality. You could be watching a video in 720p then boom, instantly switches to low quality 144p out of nowhere without warning. Trash.",
        "As the saying goes, \" What goes up, must come down. \" And Google, you are taking YouTube down at a rapid pace. Take the time to queue up some videos, cast them to the TV, go to another app, come back to YouTube and my queue is gone! Just gone! So now anything I'd like to watch or listen to, I have to save to watch later and play from there. You have made the queue useless. Thanks Googletube!! Someone needs to develop a new \"YouTube\" I'll be the 1st subscriber",
        "For like the last 3 whole years the app has just beem breaking down. To the point where the video doesnt resume normally after mid-roll ads. Video becomes choppy, and the app slows my phone to a halt, I can't even close it. No other app does this.",
        "Edit: all is well with the world again. Same trusty app as ever, now! YouTube is usually really good at keeping the app functional and user friendly. I have to say I've never has as many issues as I've had in the last few weeks. My \"downloaded\" playlists have a hard time playing when I'm out and about, the overall speed and functionality is slow, and the app has crashed on me more times this month than is has in the past few years. No bueno.",
        "Spam ads and failure to update. Every day i keep getting the same spam ads like goto this sketchy website give us your credit card number and email get hit with virus's from this website ptomoting free mini fridges i hit quit showing me these ads everyday for 6 weeks straight also i dont play league of legends so quit trying to get me to download poro professor. I hate that game and i hate the fact you can't respect my wishes and ive been to google and i hit stop seeing this its not working",
        "imo it's one of the best apps ever, the fact that you can watch/produce long, short, funny, somber, or even music videos is awesome, I've had the app for a really long time and I still use it almost daily. Also since you are choosing the content you watch based on titles, thumbnails and personal timeline it's much less likely to come across something you hate/don't want to see (at least from my experience). I think that if you want to start creating content this is a great place to begin!",
        "I just did the next update and if you go into your YouTube settings and then go to General you have the option for picture-in-picture you have to turn it back on again and it works just fine I also pay for YouTube premium so I don't have the commercials everyone's complaining about and it's only $17 a month if people can't afford that then I don't know",
        "Zero stars. I am asking and asking to fix the recommendation but they didn't. Now the ads are worse! They show 2 ads for an video of 10-20 second total which you cant skip. Now they added search recommendations which show trash videos and after that they mixed recommendations with trending pages which is disgusting! The things that youtube is doing is just to make it look cool. First removal of dislike count then mixture of trending page and now stupid search recommendations. Youtube is smoking",
        "They can be very helpful when you post videos of fixing things it just some people don't understand what people need to fix things they block out things that don't take things that you need to know but most of them are very educational in good to read you need to watch more than one video on the same subject to get a better idea of it cuz everybody's got their own idea of recording the video",
        "The ads are too much. Disrupts my Chromecast television streams too. Feeds are choppy and switching over apps on my mobile device disconnects and ends the YouTube feed on the TV. Aggravating to say the least. Can no longer enjoy the content like I used to. It seems like it glitches on select content. Loosing my faith in Google Products and services."
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.android.chrome",
        "com.facebook.katana",
        "com.zhiliaoapp.musically",
        "com.facebook.orca",
        "com.whatsapp"
    ],
    "moreByDeveloper": null,
    "appId": "com.google.android.youtube",
    "url": "https://play.google.com/store/apps/details?id=com.google.android.youtube&hl=en_US&gl=US"
}