{
    "title": "Massager vibration app massage vibration for women",
    "description": "Relax body non stop vibration, body vibration pleasure.\r\nStrong vibration app for girls. Make phone vibrate. \r\nBody vibration apps women feel love vibration women apps free. \r\nHaptic femme lovense remote app for strong women \r\nBody vibration machine for females lush 2 remote app.\r\nVibrating app extreme vibration apps women workout.\r\nLearn kegel exercise. Become massage therapist.\r\nIf you say: make my phone vibrate and face yoga.\r\nFace, body, back, legs, arms, abdomen massage.",
    "descriptionHTML": "Relax body non stop vibration, body vibration pleasure.<br>Strong vibration app for girls. Make phone vibrate. <br>Body vibration apps women feel love vibration women apps free. <br>Haptic femme lovense remote app for strong women <br>Body vibration machine for females lush 2 remote app.<br>Vibrating app extreme vibration apps women workout.<br>Learn kegel exercise. Become massage therapist.<br>If you say: make my phone vibrate and face yoga.<br>Face, body, back, legs, arms, abdomen massage.",
    "summary": "Massager vibration app massage vibration for women. Vibrate & relax body haptic.",
    "summaryHTML": "Massager vibration app massage vibration for women. Vibrate &amp; relax body haptic.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.990099,
    "ratings": 4831,
    "reviews": 102,
    "histogram": [
        810,
        137,
        288,
        617,
        2979
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "7.5M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ahaha",
    "developerId": "5034689648241182754",
    "developerEmail": "goshinacc@yandex.ru",
    "developerWebsite": null,
    "developerAddress": "Россия,г. Новосибирск,Ленинский район",
    "privacyPolicy": "https://www.applovin.com/privacy/",
    "developerInternalID": "5034689648241182754",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/sciSBbqs_sW5bPELDIe7H0oQB6D-3rntJFrOpwKYKhsRnkad6R6ZVMJNGanGP4QpoQ",
    "headerImage": "https://play-lh.googleusercontent.com/IFSFr70omIAGPFZXQ2zR8JHr7XErLpPY3SgAIO8-CBOOJD89qPmjbaQSp7_-2OGnrflN",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Iv0xV-TShHOzNJsrI9GKm0kjjQ_d9Uumo060P6tYkJmOZ3F6fJj1CsVvZMQ14K4088U",
        "https://play-lh.googleusercontent.com/0gEu08lEroPAlAdZ96gb4c6wSVVRXmghm2PexzNykStxd_CUge2fhe7PDcNF3gY4h9o",
        "https://play-lh.googleusercontent.com/gIQYTBKaT-7OkCAMT_I-cHCbnKM2ayEyPaHus4B0wPCYwx7SmHK6W7c8zYzaQ0awtw",
        "https://play-lh.googleusercontent.com/lX0wlUQWUO9HScM9Qw02i-B_2MPHS5VlvacMneuxr0WlOByRUGISDhWinq37RDXvrBQ",
        "https://play-lh.googleusercontent.com/2sFfuDJ0f-af2568KjSDyC-mlNTHNBWP-B6SRfW1O8LHWBzwd5ZPLHQZMubu78h8wg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Sep 26, 2020",
    "updated": 1604522865,
    "version": "6.0",
    "recentChanges": "Massager vibration app massage vibration for women. Vibrate & relax body haptic",
    "recentChangesHTML": "Massager vibration app massage vibration for women. Vibrate &amp; relax body haptic",
    "comments": [
        "This app is so good the on link y reason why it's not a 5 star is you can't turn your phone off or it stops",
        "Nice app it really made me 💦 i just hope it didn't got ads just the moment i clicked to stop it or to change onto other mode",
        "I'd recommend this to fellow women 😉 the app has many options and very comfortable to use. Yes, the amount of ads is insane, but I don't mind it. It actually isn't a hurdle to proper functionality of the app, so definitely recommend to download..",
        "My experience with this app was perfect, I would NOT change a thing about it, the ads were reasonable for what you were being given. I am pretty pleased with this app and will continue to use over the coming years.",
        "This app is AMAZING, it took a while to find the right setting but if you 7th one and put it in your 🐱 and wiggle it around it just feels amazing, highly recommend for self pleasuring! Also! If you are looking to have a long term self pleasuring experience put on 3rd setting",
        "Garbage , cant do barely ANYTHING (not even turn the intensity up or down) with out an ad , I've seen way better with less ads",
        "FAKE! CORRUPT! When you press any setting it takes you to an app, this app is the most difficult to use and I hated it. The stress of trying to turn off the vibration and it kept popping up with advertising",
        "Obscene number of ads, video ads too! Waste my time and my data. Can't even skip some for 30 seconds! Forget it.",
        "There was an add after I pressed each button. It was annoying and should be fixed ASAP. But if thats fixed then its a great app.",
        "This. Feels so good on my. 🐱 i have to cover my mouth so no one hears me🤫 i highly recommend it for woman even though its suppose to be on ur back or whatever it feels so good on my 🐱.wiggling it usually helps😏",
        "I really like the app but it doesn't stop after I start it I have to restart my phone every time 😩",
        "Great tool for a sore ear, then the ads come on and ruins it.",
        "As soon as you open it there's 3ads :) then 2 more than 3 then you can finally pick something that sucks :)",
        "its such a great pleasure tool my clit has been very satisfied after using it i love the third and seventh setting on 100 im fixing to use it again for my kinkiness😉",
        "Too many ads, only works with screen on.",
        "Yeah uninstalled this 10 seconds after getting it already got 7 ads, its unusable",
        "GREAT! My 🐱 felt amazing, i would recomend if any ladies are reading this.. 7th setting and wriggle it around, my my it felt good.",
        "Insane amount of ads... it sucks",
        "helps with my migraines. I love this app",
        "It's amazing but to many ads",
        "Trash way too many ads",
        "useless, too much ads, no vib at all",
        "It's really good I can feel it in my skin and my back But I usually use it for my face",
        "I love passing this to people and they freak out",
        "It needs to last long but good",
        "very weak. it needs to be updated. it sucks and its just so WEAK.",
        "Could not get it to turn off why would you want a phone vibrator just nasty",
        "Nice but not stronge enough pulses",
        "hello, I like this app. thank you very much.! its not free.?",
        "This app sucks there is a add after every button I press this is the worst app in the world.Do NOT BUY THIS APP",
        "Felt so good on my million dollar puthayy😫 I put it on 100 on the first vibration and started wiggling it around a bit and humping my phone too and it felt so good I was so wet☺",
        "garbage way too many ads",
        "Not working... Don't download",
        "Lots of ads",
        "Vibrate & relax body haptic.",
        "You get an AD every 5 seconds",
        "didn't work",
        "Turns off when im just starting to relax",
        "it doesn't even work",
        "very nice. would recommend."
    ],
    "editorsChoice": false,
    "similarApps": [
        "kegel.kegelexercises.pelvicfloor.pfm",
        "com.exatools.vibrometer",
        "starshipproduct.perifitmainapp",
        "com.polarstork.bluetense",
        "com.strong.andsxy"
    ],
    "moreByDeveloper": null,
    "appId": "com.ahaha.massager",
    "url": "https://play.google.com/store/apps/details?id=com.ahaha.massager&hl=en_US&gl=US"
}