{
    "title": "Jimboy's Tacos",
    "description": "Crispy, Parmesan-dusted taco shells, freshly-grated cheese melting in perfectly spiced ground beef, homemade beans...and...and...Stop everything!!!  You're having a Jimboy's crave!  No worries.  We gotcha covered.  The Home Of The Original American Taco just saved your crave.  Download the NEW Jimboy's Tacos app to easily order any of your favorite menu items, join the Taco Nation rewards program, and keep track of your Jimboy's Points right from the convenience of your phone.     \r\n\r\nApp features including:\r\n - Online Ordering - avoid the lines and order instantly from your phone.\r\n - Pay by credit card or gift card\r\n - Find the nearest Jimboy's Tacos locations.\r\n - Receive Taco Nation citizens-only rewards and offers.\r\n - See menu, nutrition, and allergy information.\r\n - And much more…\r\n\r\nFind us on Twitter, Facebook and Instagram.\r\n\r\nAnd remember: Do It Different, Keep It Fresh, and Bring It Home!",
    "descriptionHTML": "Crispy, Parmesan-dusted taco shells, freshly-grated cheese melting in perfectly spiced ground beef, homemade beans...and...and...Stop everything!!!  You&#39;re having a Jimboy&#39;s crave!  No worries.  We gotcha covered.  The Home Of The Original American Taco just saved your crave.  Download the NEW Jimboy&#39;s Tacos app to easily order any of your favorite menu items, join the Taco Nation rewards program, and keep track of your Jimboy&#39;s Points right from the convenience of your phone.     <br><br>App features including:<br> - Online Ordering - avoid the lines and order instantly from your phone.<br> - Pay by credit card or gift card<br> - Find the nearest Jimboy&#39;s Tacos locations.<br> - Receive Taco Nation citizens-only rewards and offers.<br> - See menu, nutrition, and allergy information.<br> - And much more…<br><br>Find us on Twitter, Facebook and Instagram.<br><br>And remember: Do It Different, Keep It Fresh, and Bring It Home!",
    "summary": "Do It Different, Keep It Fresh, and Bring It Home!",
    "summaryHTML": "Do It Different, Keep It Fresh, and Bring It Home!",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.3465347,
    "ratings": 388,
    "reviews": 196,
    "histogram": [
        34,
        11,
        7,
        65,
        271
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "23M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Jimboy's Tacos",
    "developerId": "7294345520351092942",
    "developerEmail": "ncrEngageMobile@gmail.com",
    "developerWebsite": null,
    "developerAddress": "80 Iron Point Circle\nSuite 105\nFolsom CA 95630",
    "privacyPolicy": "https://www.ncr.com/privacy",
    "developerInternalID": "7294345520351092942",
    "genre": "Food & Drink",
    "genreId": "FOOD_AND_DRINK",
    "icon": "https://play-lh.googleusercontent.com/nMdGe_OgJq57osbEADasoWNRbT25uvzQW0BP3cZYfxQY2YPHQkX8tdyURVTMpIS5bA",
    "headerImage": "https://play-lh.googleusercontent.com/1lHS6Qfg0plm5B0KV3v7JOqRQAbjTjjP1Bnmf7-qqKEEjSOQF1d52M-tuYJmL8NrUg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/USlfu5RKtlQRDReMyjuK7fiu3GdRUw4TlGjqNhpm8u8jo_zGJZhXI9ibOUp71u8fLhQ",
        "https://play-lh.googleusercontent.com/ynznXI-kc-cCsvdnICfdm_knxJIDmi8JbI_gJMkdHWk2kDAtosIBMOMfTmkvdvyKfEc",
        "https://play-lh.googleusercontent.com/BR_Jkzr-t5IT_9iY-8hIY8zmiQjOCYnQBEt1oOKAf_11m2X12SlWXGvnYgTfUxRBSFc",
        "https://play-lh.googleusercontent.com/wR1q8pAW1SiSBqCx_FDa2t18s9VHGxrvT-p4RZE28XLF4i-kEyfnBKffj_KL9lxtpV8",
        "https://play-lh.googleusercontent.com/Ezbn5aDNymO2LDnw6oasQX9jXKyJtUWlDToTc4xe_oWdXU8YZxT8D-tuTqB2TCf2yFLt"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Feb 8, 2017",
    "updated": 1641395504,
    "version": "21.7.2",
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "Need to have phone ready to scan, so open the app before you get in line. They don't have the ability to pull up the scanner at will, so you'll lose the points if your not ready.",
        "Haven't been able to use app for months. Tried to reset password and such to no avail. Can't seem to contact anyone for assistance. App was great till an update and Haven't been able to use since.",
        "I ordered my meals but I couldn't checkout. I tried ordering from the website and the same thing happened. The app and website need to be fixed.",
        "No Rewards and Doesn't List Everything on the Menu. I've used this app for a little over a year and so far I have spent well over 300 dollars; each time I spend 100 I should receive a reward. All three time, I've received nothing. Its very frustrating as I've earned them and I have yet to receive anything. The application also doesn't list everything on my local menu. Trash application.",
        "I've had this app for over a year and it continues to have problems loading both for Android and Iphone. There has been a number of times that the actual restaurant location's system have been down also. Additionally when I scan at a restaurant, I am not even credited for my purchase. It would be nice if this app worked at least 80% of the time rather than 5% of the time.",
        "Grass Valley location is awesome. And always treats you like your a valued customer. You should put on your menu, a split order of Spanish rice and refried beans. A full order of each is way to much to eat, along with an entrée. Especially for a woman. Thank yoi",
        "it only lists certain stores. the midtown sac locale isnt on their radar. i live near the northgate locale and it wasnt listed. i like this locale cuz their taco tuesday is 1.50. even on the weekend. it made be independently owned. because the app says the nearest one is 5 miles away( which is complete BS) I am uninstalling this app.. i love jimboys!",
        "Very good app. Only issue is the order time. I would like to be able to place my order sooner. Most apps let you, since its drive through so it's made right away anyway. No real reason I need to place the order for a time over 20 minutes from now. Otherwise no problems.",
        "The app does not include all Jimboy's locations (i.e DOCO), which makes it completely useless for anyone in the downtown/midtown area of Sacramento. The DOCO location must type in your member number for you to accrue points. The rewards do not scale well in comparison to the rewards offered by Chipotle, which is also located in DOCO and has a functional app. Unless you live across the street from one of the Jimboy's locations covered in the app, don't bother installing this junk.",
        "Delicious food & an amazing app to collect points from your delicious Jimboy's purchases! Then later, use your collected points to get even more (discounted or even potentially free), yet still delicious food!!! Did I say the food is delicious?!! 🤤",
        "Great food and friendly people! Using the app is pretty easy. I like that you can earn free food and you get a free birthday reward!",
        "The login system wasn't working right and the reset password didn't work either and I couldn't even look up the deals that they had on the app fix it please!!!",
        "App constantly won't load or cannot calculate tax and therefore cannot place an order. Also, app funds cannot be used in store sales when the app doesn't work those funds are useless. Absolutely terrible",
        "Awesome app easy to use have no issues with it works great and I get points for free tacos. Who could ask for anything better than free tacos.",
        "We did get the food that we ordered, however, this is the second time a discount was applied but not accepted when we picked up the order. When we picked up the food we had to pay the discount amount.",
        "App works great... so far. Just hope it remains stable, so many other crash and burn apps have made me a little weary.",
        "Jimbiy's has amazing tacos. I eat here anytime I'm near one. Sadly no longer in my city. This app basically gives you free food every time you reach a certain dollar amount spent (cumulative).",
        "Worst app ever..... will not let login, keeps saying invalid password try to rest an will not let me because you have to login to reset password. Giving this app one star is to much...",
        "Probably one of my favorite taco places. But the location by my house a lil pricey. Ive been to other locations and the prices way cheaper then this one. But still a good spot. Highly recomended.",
        "App Works great. Wish you could also prepay for the food. Love the food and the app woulds great.",
        "Easy to place an order. Works every time and food is ready when scheduled.",
        "A sweet app! I rack up points and can order on-line for timely pick up... Awesome!",
        "fantastic app along with some of the best Customer service I've ever experienced in a restaurant.",
        "Employee taking order thru drive thru had to repeat order 5 times. She couldn't get order correct. I went to pay for food which came to $31.33. I was charged for a large sprite in which I requested water w ice twice. My receipt was not recredit or fixed. Just poor, poor service. I really enjoy this food too. This Jimboy located on Watt Ave",
        "Everytime I try to use the app the system is down and I lose out on points. Especially on Mondays being double point day. 😕",
        "It will NOT let me order! When I tap on Order it just goes back to the home screen. So disappointed!",
        "The food is awesome and being able to earn it free is fantastic!",
        "Awesome Tacos , with great service .",
        "great food, excellent service, at a reasonable price.",
        "Great app! Free taco when you sign up. Free food on your birthday and $10 free food when you accumulate points. Makes ordering ahead easy with a full menu. Get this app NOW!",
        "Good app, but you need to spend what to much money to get anything out of it.",
        "Nice app, freebie right from the get go and birthday gift.......all for eating awesome food",
        "Can not load funds. Tried multiple time with different cards and keep getting error messages",
        "Every order I send is always perfect & precise, fresh & delicious...",
        "love the food and they finally added the store near me so o can order online yay.",
        "Love Jimboy's, always a great experience with great food.",
        "Menu is too limited. Otherwise I like the app.",
        "Good consistent food. Timely service",
        "Great food, great service, always fresh! Enjoy!!",
        "love this place everything is so good. ask about their secret menu items they are great 👍"
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.paytronix.client.android.app.tacos4life",
        "com.ptitchef.android",
        "com.endless.microwaveovenrecipes"
    ],
    "moreByDeveloper": null,
    "appId": "com.ncr.jimboystacos",
    "url": "https://play.google.com/store/apps/details?id=com.ncr.jimboystacos&hl=en_US&gl=US"
}