{
    "title": "Walk Me Up! Alarm Clock",
    "description": "Walk Me Up!  is unlike any other alarm app you would have used. It stops ringing only when you have walked a certain number of steps. That’s right, it 'walks' you up from sleep!\r\n\r\nAnd this app also has intelligent algorithms to detect shaking. So, if you try to cheat, the app wouldn't hesitate to punish...you gotta try it to believe it. This is the best alarm clock for all sleepy heads who find trouble getting out of bed early morning.\r\n\r\n#1 Productivity app in the USA in August.\r\nFeatured in Time,LifeHacker, Digit, YourStory, NextBigWhat, GHacks and many more !\r\n\r\nIt has the following features:\r\n★      Evil mode: Disable the snooze button\r\n★\tSet the number of steps to dismiss the alarm\r\n★      Voice Assist\r\n★      Change the sensitivity of the step counter\r\n★      Change the snooze duration\r\n★\tAdd quick alarms\r\n★\tApply label to alarm\r\n★\tChange alarm volume and ringtone\r\n★      Set alarms to repeat\r\n\r\nNow, no more of missing early morning lectures & meetings or missing out on precious study time before exams!\r\nThe free version is ad supported.\r\nIf you like the app, please rate it. We would love to hear your feedback. Email us at walkmeup@gmail.com and we will get back to you as soon as possible.\r\n\r\niOS users can download the app from : http://bit.ly/walkmeupalarm",
    "descriptionHTML": "Walk Me Up!  is unlike any other alarm app you would have used. It stops ringing only when you have walked a certain number of steps. That’s right, it &#39;walks&#39; you up from sleep!<br><br>And this app also has intelligent algorithms to detect shaking. So, if you try to cheat, the app wouldn&#39;t hesitate to punish...you gotta try it to believe it. This is the best alarm clock for all sleepy heads who find trouble getting out of bed early morning.<br><br>#1 Productivity app in the USA in August.<br>Featured in Time,LifeHacker, Digit, YourStory, NextBigWhat, GHacks and many more !<br><br>It has the following features:<br>★      Evil mode: Disable the snooze button<br>★\tSet the number of steps to dismiss the alarm<br>★      Voice Assist<br>★      Change the sensitivity of the step counter<br>★      Change the snooze duration<br>★\tAdd quick alarms<br>★\tApply label to alarm<br>★\tChange alarm volume and ringtone<br>★      Set alarms to repeat<br><br>Now, no more of missing early morning lectures &amp; meetings or missing out on precious study time before exams!<br>The free version is ad supported.<br>If you like the app, please rate it. We would love to hear your feedback. Email us at walkmeup@gmail.com and we will get back to you as soon as possible.<br><br>iOS users can download the app from : http://bit.ly/walkmeupalarm",
    "summary": "An innovative alarm that stops ringing when you walk a few steps",
    "summaryHTML": "An innovative alarm that stops ringing when you walk a few steps",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.2426035,
    "ratings": 7311,
    "reviews": 646,
    "histogram": [
        2381,
        605,
        475,
        561,
        3289
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$0.99 per item",
    "size": "7.3M",
    "androidVersion": "4.1",
    "androidVersionText": "4.1 and up",
    "developer": "Bazzinga Labs",
    "developerId": "Bazzinga+Labs",
    "developerEmail": "walkmeup@gmail.com",
    "developerWebsite": "https://twitter.com/@walkmeup",
    "developerAddress": "No 4, Queens Road,\nShivaji Nagar, Bangalore\n560051, India",
    "privacyPolicy": "https://docs.google.com/document/d/1pI6AJGD0zNxvKH5T7j4zDvQv8EsgWQik2nYp-HP0kRY/edit?usp=sharing",
    "developerInternalID": "5855749456546532195",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "icon": "https://play-lh.googleusercontent.com/wi9MJxbZA5CO2VBHlMbYQ5NC_3Rg1sxiD4x5IDAVVg-muezl2pF7dMkRlQIawAFT8_w",
    "headerImage": "https://play-lh.googleusercontent.com/wl4kjqfjV-mWSLCPWB2kMHCWixQIXUrm3fyFx72KOjgxT5pC7Py4j9_dcPUjv1IoU4w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/FlQH9j2bqmFVtRL_Gmc672poJWPeBSel8kzUFMQBRJcEiZBb1gT64YB4rnMCvEelGw",
        "https://play-lh.googleusercontent.com/PaBYnO81Kq-CzK8IZ5HH3i5Bz2laG2FGnGwmvIvRzDrYc33EQXmM8A-Qv60ncvxlfQ",
        "https://play-lh.googleusercontent.com/JPOj1TE9br2Mp4HxptUR7skYVhcdJp2dRFmPzPfjzUE8LWaJCiif7fBgt07TIHf21A",
        "https://play-lh.googleusercontent.com/c7mRDrZwZKrb8unDwtoayV062e80xJW2O6i9rKCxmWgwmzUTkNhHyCHuWT-F9Rxe4g",
        "https://play-lh.googleusercontent.com/6YXgSZYdVRYwVYE1W-JZ3UkRElwKV2a7FpLnO3Nq53CiQ4ZhFAkxaa9kqvn_gYlLmoA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Feb 20, 2013",
    "updated": 1514785517,
    "version": "4.0.6",
    "recentChanges": "Bugs fixed",
    "recentChangesHTML": "Bugs fixed",
    "comments": [
        "Great Idea Bad Execution. The first day I had this app, it worked great but since then it always bugs out. Most of the time, the alarm doesn't go off at all. I really want this to work but some updates need to be made.",
        "Sporadic and unreliable. It has decided not to turn on maybe half the time. Did it this weekend twice and again this morning after a few phone updates and restarts. Bummer because it's the only alarm like it.",
        "This app's terrible performance caused me to miss an important presentation at college! I set an alarm for 8:30am, then at 12:18pm I woke up on my own. When I checked my phone the alarm began to go off, then quickly shut off without requiring me to walk the set 20 steps. I am absolutely furious. I have never written a bad review in my life, but I urge anyone to not use this app if they have any important",
        "After using this for a short amount of time I'm changing my review because it has one major flaw: no matter what I set my alarm volume to the night before, this app ALWAYS has the alarm at 100%. Which is horrifying and a terrible way to wake up. I go out of my way to set both the alarm volume and the media volume to about 30% before a sleep to no avail. This problem persists trying two different devices. I really like the concept but this app isn't it.",
        "4 stars would be 5 but phone calls seem to break the never ending alarm hell I need to wake up.",
        "I would suggest adding a feature where you cant turn down the volume. I would also add a paid feature where you cant turn off the alarm within a certain period of time of the alarm going off. This is coming from someone who manages to outsmart all of his alarms. Also, my disable snooze button doesnt work and I can still snooze. Other than that I hope this app helps my notorious habit of falling back asleep after turning off my alarm!",
        "The alarm never goes off. Notifications are turned on. Sound is on. I do have a battery optimizer on. That's the only thing I can think of that might have cause the issue. I can't use this app because it is unreliable on my phone. I have samsung/android. I am using Alarm Clock Beyond now which also has a walk-to-turn-off feature and recommend that one to anyone else having this issue.",
        "my alarms wouldn't ever go off. instead i received notifications about missed alarms days after the fact. i opened the app on a thursday and received notifications for my missed monday, tuesday, and wednesday alarms all at once. there doesn't seem to be any consistency as to when the alerts roll in, but three weeks of set alarms later and not one of them has actually gone off.",
        "This app is not worth the storage space. Ads all over the place, aggressive pop ups, requires internet access for an alarm clock, and doesn't work anymore. If you go back at least 10 versions, you'll have a great app. #greedydevelorers that ruined a great product",
        "Doesnt work. I tried this alarm and my 430 alarm didnt say upcoming until 6am and said missed alarm without any type of sound or vibrations at 620. I did a test alarm and it worked fine but the scheduled alarms do not go off. I even set 3 at a few minute intervals but non of them went off and the notifications were delayed",
        "I've only had this two days but I've gotten up with my alarm both times because this makes me walk to the bathroom and start getting ready. I love it. I quickly bought the ad-free upgrade, because I've always had trouble responding to an alarm clocks, and this is the first one in my adult life that has worked.",
        "Unfortunately this alarm clock has a fatal flaw. if you receive a call while while the alarm is going off, it disables the alarm. For me this has already happened more than once, and I finally realized today why I wasnt waking up on time.",
        "I bought the Ad Removal, and i still have ads. It's extremely frustrating because unless you dismiss the ads AND get back to the alarm screen, you can't start to turn off the alarm! When trying to buy it again, incase i messed up, it won't allow me to attemp to make the purchase again. The Plus shipping carry icon is still there whereas the one for the Gradual Alarm is purchased and the Shopping cart icon is gone. Otherwise, this app is great! It forces me to get up!",
        "I paid for all the features and the alarm does not even go off. When I go into the app then it suddenly starts going off. That does me no good if I have no over slept. An alarm that doesn't sound off to wake me up does me no good.",
        "I paid to get rid of ads and max my snoozes and now it doesn't work!!! Unreal. It worked fine before now no matter what I do, it will not go off. Very disappointed. Would love my money back.",
        "This app is perfect for people like me who can barely drag themselves out of bed. I like the no snooze option too. My only complaint is that every five or so steps you take counts as one.",
        "Used to be a good app. Now the ads are relentless, and I can snooze the alarm even in Evil Mode so it defeats the purpose entirely.",
        "No sound, crashes frequently. What good is an alarm clock without sound? Worked for about a week and then stopped working after I tried changing the alarm sound. No matter what I do now, I get no sound.",
        "1st test. Held it in my hand while walking. Got halfway across my house & it reset my steps saying shake detected. Not trying to wake up everyone. 2nd test, set shake detection at low & to 10 steps. Also set on evil mode so dismiss is not allowed. Alarm still popped up on my notification bar & was able to dismiss defeating purpose. 3rd test. Disabled notifications from app. Alarm went off & it wouldn't count steps. Had to go into app to disable alarm. I can do that from bed. Uninstalled.",
        "It is nice app but one thing I have noticed is even if we tap on the screen the steps count getting decreased. Developers please check this once. Other than that everything is cool.",
        "I loved it at first but now it suddenly stopped actually sounding the alarm which is the most important part. Not sure what happened I hope it is fixed.",
        "Good concept but a MAJOR flaw. I could just press one button and disable the current alarm that's on. Now where's the point of walking?",
        "You're a damn genius. And now I'm never late to work. Ever. It was worth it to pay for the premium version so I did. You guys earned it for making such an awesome app. Edit: For people who are saying it doesn't work, you need to go into your app settings and exempt this app from battery optimizations and give it priority notification display. Also, I set my native alarm clock to go off as a backup at the same time I set Walk Me Up to go off and they work in tandem with each other.",
        "Evil mode doesn't work. It's incredibly easy to turn off the alarm. I don't even have to walk to turn off the alarm. I'm kicking myself for purchasing extra settings.",
        "Use to be great. Not sure why but I set my alarm for 6am and then it won't ring until later in the day or until I open the app. Useless if it won't be reliable",
        "technical issue. could not turn the snooze function off. evil mode never worked and that was the entire point of getting this app. switching apps",
        "The alarm comes on when it's supposed to but there's no off button without opening the app and turning off the setting. it confuses me",
        "alarm has stopped going off at the set time. has happened multiple days in a row now, I'm not giving it another chance.",
        "I take meds to control my pain, it has to wake me up to notify me. It doesn't work , that means I miss my important meds. I still keep it hoping u might fix the problem.",
        "been using this app for years. this is the ONLY alarm that gets me out of bed and STAYING out of bed. well worth the paid version.",
        "When I first installed the app it was wonderful the actual app on my phone which was clock did not work now this one does not work there is no sound",
        "disabling the snooze button does not work, there's also tons of ads all the time",
        "This used to work well but it no longer rings at all. I'm not sure what happened but that's unfortunate I depended on this to wake up",
        "Worked great at first. Then the alarm quit going off unless I had the app open.",
        "No good ringtones appropriate for an alarm, It is user friendly But it does not explain the shaking and steps I am deleting this app and trying another one",
        "It wouldn't count my steps I had 15 steps but it would reset when I got to 6 steps. Couldnt get the thing to turn off was going of for 5min while I walked around my house",
        "My half asleep brain figured out that if you shake the phone not too hard but not too soft then it thinks you are walking and turns off",
        "Set the ring tone with the highest pitch and you're ganranteed to wake up with this alarm app: even if wearing ear plugs!!",
        "This app is amazing! I just got it now and I can already tell that it's going to change my life 😅 I have A.D.D and it makes me hyperfocus on things then I don't get up from my desk for several hours and as a result of that I keep getting pinched nerves in my hips and neck. With normal alarms I just turn it off when it reminds me to get up but with this app I obviously have to get up and move around. Thanks so much to the people that made this app!",
        "The concept is amazing but the execution is underwhelming. The alarm only goes off if app is open and even then a notification pops out only after touching that, you can walk to disable, also if we can place music in place of just alarm , that will be amazing."
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.wroclawstudio.puzzlealarmclock",
        "com.kog.alarmclock",
        "com.amdroidalarmclock.amdroid",
        "com.drlabx.alarm",
        "com.funanduseful.earlybirdalarm"
    ],
    "moreByDeveloper": null,
    "appId": "com.moosa.alarmclock",
    "url": "https://play.google.com/store/apps/details?id=com.moosa.alarmclock&hl=en_US&gl=US"
}