{
    "title": "Orange et moi Maroc",
    "description": "Avec Orange et moi, gérez toutes vos lignes Orange mobiles, internet et fixes depuis une seule application.\r\nL'application Orange et moi vous permet de suivre votre consommation, payer vos factures, mais aussi de recharger votre numéro et de profiter de nombreux avantages clients.\r\nL’application Orange et moi est disponible en deux langues : Arabe et Français.\r\nLa navigation dans l’application Orange et moi est gratuite pour les clients Orange et ne consomme leur solde internet.\r\n\r\nOrange et moi vous permet de :\r\n• Consulter votre solde en temps réel : Solde en dirham, internet, minutes, SMS, Pass roaming, Smart Solde …\r\n• Recharger votre compte Orange ou celui d’un proche par carte bancaire, Orange Money,  Smart Solde ou en scannant les 16 chiffres de votre carte à gratter\r\n• Activer des pass reportable sur votre prochaine facture lorsque votre forfait est épuisé\r\n• Payer vos factures Mobile, Fixe, Internet, Fibre ou celles d’un proche par carte bancaire ou Orange Money\r\n• Enregistrer votre carte bancaire pour l’utiliser en toute sécurité pour le paiement de vos factures et recharges\r\n• Consulter l’état de votre ligne en Roaming et acheter des pass Roaming par carte bancaire ou solde dirhams\r\n• Activer vos données biométriques (Finger print ou face ID) pour vous connecter plus rapidement\r\n• Acheter vos jeux favoris\r\n• Activer ou désactiver Internet à la demande pour utiliser accéder à internet avec votre solde dirhams (seulement pour les clients recharge)\r\n• Transférer du solde internet à vos proches\r\n• Changer votre numéro de téléphone\r\n• Changer votre offre Mobile à tout moment ou en acheter un nouveau forfait\r\n• Acheter un Smartphone et des accessoires\r\n• Bénéficier de vos avantages Orange : cadeau du vendredi, Cinéday, invitations aux avant-premières et aux spectacles...\r\n• Profiter de votre cadeau d'anniversaire à chaque année passée chez Orange \r\n• Récupérer votre code PUK lorsque votre carte SIM est bloquée\r\n• Consulter le détail de vos appels et de consommation d’internet\r\n• Consulter le détail de votre offre\r\n• Ecouter et activer vos tonalités musicales en quelques clics. Un large choix de tonalités vous est proposé\r\n• Gérer les notifications pour ne rien manquer\r\n• Localiser les agences Orange à proximité ou par villes\r\n• Gérer plusieurs lignes Orange avec un seul et même compte \r\n• Retrouver les dernières offres et promotions en temps réel\r\n• Suivre vos réclamations\r\n• Contacter un agent\r\n• Trouver les boutiques Orange autour de vous\r\n• Recharger et payer des factures sans vous connecter\r\n\r\n----------------------------------------------------------------------- \r\n*L'application Orange et moi est accessible à l'ensemble des clients Orange quelques soit leur offre (Forfaits mobiles, carte SIM Recharges Orange,...)\r\n*Les identifiants de l’espace client sont les même que ceux de l’application Orange et moi\r\n*L’application Orange et moi ne consomme pas votre solde internet\r\n*Cette application est à télécharger gratuitement (hors coût de connexion internet mobile selon l’offre souscrite) \r\n*L’application Orange et moi vous plait ? N’hésitez pas à écrire un avis sur le Store !",
    "descriptionHTML": "Avec Orange et moi, gérez toutes vos lignes Orange mobiles, internet et fixes depuis une seule application.<br>L&#39;application Orange et moi vous permet de suivre votre consommation, payer vos factures, mais aussi de recharger votre numéro et de profiter de nombreux avantages clients.<br>L’application Orange et moi est disponible en deux langues : Arabe et Français.<br>La navigation dans l’application Orange et moi est gratuite pour les clients Orange et ne consomme leur solde internet.<br><br>Orange et moi vous permet de :<br>• Consulter votre solde en temps réel : Solde en dirham, internet, minutes, SMS, Pass roaming, Smart Solde …<br>• Recharger votre compte Orange ou celui d’un proche par carte bancaire, Orange Money,  Smart Solde ou en scannant les 16 chiffres de votre carte à gratter<br>• Activer des pass reportable sur votre prochaine facture lorsque votre forfait est épuisé<br>• Payer vos factures Mobile, Fixe, Internet, Fibre ou celles d’un proche par carte bancaire ou Orange Money<br>• Enregistrer votre carte bancaire pour l’utiliser en toute sécurité pour le paiement de vos factures et recharges<br>• Consulter l’état de votre ligne en Roaming et acheter des pass Roaming par carte bancaire ou solde dirhams<br>• Activer vos données biométriques (Finger print ou face ID) pour vous connecter plus rapidement<br>• Acheter vos jeux favoris<br>• Activer ou désactiver Internet à la demande pour utiliser accéder à internet avec votre solde dirhams (seulement pour les clients recharge)<br>• Transférer du solde internet à vos proches<br>• Changer votre numéro de téléphone<br>• Changer votre offre Mobile à tout moment ou en acheter un nouveau forfait<br>• Acheter un Smartphone et des accessoires<br>• Bénéficier de vos avantages Orange : cadeau du vendredi, Cinéday, invitations aux avant-premières et aux spectacles...<br>• Profiter de votre cadeau d&#39;anniversaire à chaque année passée chez Orange <br>• Récupérer votre code PUK lorsque votre carte SIM est bloquée<br>• Consulter le détail de vos appels et de consommation d’internet<br>• Consulter le détail de votre offre<br>• Ecouter et activer vos tonalités musicales en quelques clics. Un large choix de tonalités vous est proposé<br>• Gérer les notifications pour ne rien manquer<br>• Localiser les agences Orange à proximité ou par villes<br>• Gérer plusieurs lignes Orange avec un seul et même compte <br>• Retrouver les dernières offres et promotions en temps réel<br>• Suivre vos réclamations<br>• Contacter un agent<br>• Trouver les boutiques Orange autour de vous<br>• Recharger et payer des factures sans vous connecter<br><br>----------------------------------------------------------------------- <br>*L&#39;application Orange et moi est accessible à l&#39;ensemble des clients Orange quelques soit leur offre (Forfaits mobiles, carte SIM Recharges Orange,...)<br>*Les identifiants de l’espace client sont les même que ceux de l’application Orange et moi<br>*L’application Orange et moi ne consomme pas votre solde internet<br>*Cette application est à télécharger gratuitement (hors coût de connexion internet mobile selon l’offre souscrite) <br>*L’application Orange et moi vous plait ? N’hésitez pas à écrire un avis sur le Store !",
    "summary": "Easily manage all your Orange lines without consuming your internet balance :)",
    "summaryHTML": "Easily manage all your Orange lines without consuming your internet balance :)",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.3823528,
    "ratings": 75757,
    "reviews": 334,
    "histogram": [
        24539,
        2964,
        3705,
        8152,
        36397
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "15M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Orange Maroc",
    "developerId": "Orange+Maroc",
    "developerEmail": "apps@orange.ma",
    "developerWebsite": "http://www.orange.ma",
    "developerAddress": null,
    "privacyPolicy": "https://www.orange.ma/CGU",
    "developerInternalID": "9014567549937240614",
    "genre": "Productivity",
    "genreId": "PRODUCTIVITY",
    "icon": "https://play-lh.googleusercontent.com/fTBUv2hTKzUVYc-IY97lPsuCCRY66VVZb5ugPJLBotdBR0mdzflqWu21Ow22vqEVWZg",
    "headerImage": "https://play-lh.googleusercontent.com/JNXJL1nJ0mBwxg92hCjTGZ5p1PCdub2_CW0Mb0vHdxy4GSz7kkQIlL2tiZ0-NCojwTA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/j_YLwrtVmSXhAChWDI8owJA5u39Hgn9OkLxPe9atnihMZzPUceP7u3Ameyo7MwFjkA",
        "https://play-lh.googleusercontent.com/JWjfXYno0v0G-H_roj7LER9ZvkFw97BEu3_ha6ltswCIOcg6RCSBkjO57aZ92UcioQ",
        "https://play-lh.googleusercontent.com/3Y5_rfx0ed04LzyDu8c1vCEcQSN9AJAH0O-FcXTKOzxG15hShBxRlA7G6TMIegaI_oI",
        "https://play-lh.googleusercontent.com/YtNkk-xf2M0dqFnzE421hx-aCYWkwhSfIvpThDVFWRd0yivg5WLaQMbMtosQq_2aaA",
        "https://play-lh.googleusercontent.com/w1v58RpxuYDcIwN2YCAgRe4O5HF2wmmeGDoMoq5ojwOen5Rgm3KBBOCVpW_wMafUq9ls",
        "https://play-lh.googleusercontent.com/l3KfiviRxe4-TX3h9BSPcjyZI9N6qsHN18T_1Z71tuSIQ-JnTQBio_e3BHWoBtsnOOw",
        "https://play-lh.googleusercontent.com/O4oKWpF9wl_jvu5miGw_e93NwpEMzwuk9rR9njW-dAv2LRolm9U99QtMiUmvzUMRTww",
        "https://play-lh.googleusercontent.com/JT471nwgM8Pj54yLqdqjUDGqfaGluCXR1f-qkuLQQsXrIxLElb3RMdROsmpPIO5IdQ"
    ],
    "video": "https://www.youtube.com/embed/bcUuwnemO5s?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/JNXJL1nJ0mBwxg92hCjTGZ5p1PCdub2_CW0Mb0vHdxy4GSz7kkQIlL2tiZ0-NCojwTA",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jan 22, 2013",
    "updated": 1625495984,
    "version": "8.6",
    "recentChanges": "Orange et moi s’améliore pour toujours mieux s'adapter à vos usages : \r\n* Payez l'ensemble des factures de vos lignes en une seule fois.  \r\n* Découvrez le nouveau parcours Orange Cinéday\r\n* Et bien plus...",
    "recentChangesHTML": "Orange et moi s’améliore pour toujours mieux s&#39;adapter à vos usages : <br>* Payez l&#39;ensemble des factures de vos lignes en une seule fois.  <br>* Découvrez le nouveau parcours Orange Cinéday<br>* Et bien plus...",
    "comments": [
        "I finally figured out the problem. But I'm giving 4 stars because you say the wifi is for a month but each month it cuts off by a couple days early, so it's really only 28 days of wifi. after a year you will have shorted me a month. But also 4 stars because it is a reasonable price for 28 days and since I'm without a TV I'm able to watch movies as much as I want. I'm pretty happy with the connection it self, just don't like being told I'll get wifi for one time frame but then it's shortened.",
        "It's a great app. Well designed. I would very much appreciate if you bring back the flashlight in the QR scan. Sometimes when I'm in lowlight place i find it difficult to scan the code.",
        "The worst app . I keep getting this bugs and the app launch slowly, I have a subscription although I can't get my Friday prize.",
        "The app is good, but the customer service is so null! The way to contact them is confusing and the waiting time is so long. I just asked to migrate from 'forfait' to prepaid card and they haven't replied yet. My first contact with them was in February. They provoke customers unfortunately!",
        "This app is totally trash, when I tried first to signing through my number it gave some subscription error as if i just was first time user in fact I registered before and when I tried to register again another error. One other thing why the heck the developers didn't add even bother adding English, I suggest you guys add it cause many people nowadays including me use English as their secondary language.",
        "the application can't do anything by its self, always asking to open browser when I try to get to an option or a service. It looks like it contains only shortcuts. But in general it gives a little bit of help.",
        "The worst internet service provider ever. It costs an arm and a leg and yet still an awful service you get. The floor is all yours since there's no real costumer protection is this corrputed zone of the world. It's not like you are going to be investigated or anything so why to bother improving your services. Monopoly at its finest. Shame on you.",
        "I would give five stars on the previous version! The actual one is real mess, it bugs and crushs so awkwardly most often! I donno why u deleted the internet transfert option that was the coolest service u had. But now u're quite as the same as the other companies! Waiting for the next update to fix the bugs",
        "2012 design. Logs you off everytime. Worst is that it says your password is incorrect, so once I'm logged out, I don't even bother to enter my password again, I just reset it. Seriously?",
        "It's good when it works, but now it just crashes at startup... Please fix this ASAP. Now I have to download an older .apk... And it would be highly appreciated to add English & Spanish to the app.",
        "No dark mode has been found, Widgets won't work properly, Nothing works as we want!!",
        "Awful!! Terrible!! I have to log in AND go through the whole registration process every time I want to access my account. It is a complete joke. I am getting rid of this app.",
        "The coverage in Kariat Ba mohammed, Taounate is so damn slow espacially the internet. It is extremely slow like a turtle. My friends and I are going to change Orange into Inwi or Maroc Telecom as soon as possible if this problem persists.",
        "I've had the best experience on this app, there are 2 things that I dont like about it tho. 1. You can't buy sms alone 2. There isn't an option for English language.",
        "The last app update was a total disaster , I can't pay my internet services . The app keeps crashing , So am stuck with no internet .",
        "The design of app is good but the problem is when i try to activate service so i can check my internet .. etc, with my number phone it doesn't work even in the website.",
        "The online service is trash. I tried a dozen times to buy an internet pass but to no avail. It's unbelievable that a telecom company can't even maintain its own servers.",
        "When I try to login to my account it shows me a message saying \"Session expired\", I don't know what's the problem. This app really sucks",
        "I jist wanted to say that the update of the consuming is not working for exemple if I see how much I have of internet and I found 300mg after 10minutrs if I see how much I have I will find the same 300mg even if I use internet while this period so hope you can find a solution for that",
        "Best Telecommunications service in Morocco so far, but i wish if it had the English Language Integrated as well. It's Almost 2021 we need to consider Integrating English.",
        "Useless app. Crashes all the time. I'll give it more stars once you fix it and make it work properly.",
        "this app works good. easy to use & perfect. i hope it can work without internet when we need to pay our bills. thanks",
        "So horrible. The Orange company sucks, they rip you off. I bought an internet card and after i put it in my phone, they sent me a message the internet will expire on the same day. So horrible, plus their app is a trash, i tried changing my plan based on one the options they have in the app, but everytime i tried, it kept saying an error happened. I do not advise anybody to buy an orange number.",
        "Whenever i want to recharge, it crashes. This problem happened to me with the last update.",
        "Service client = 0 Deux jours sans résultats , sans oublier la perte de temps et d'argent . Worst service ,support is even worst , these guys will just ignore the problems they caused you",
        "the previous update was actually bugging but it was ok , but the latest update is so bad that i cant even use smart solde anymore and it bugs to much , hope u fix it asap.",
        "Every last day of the month this app keeps bugging",
        "The app crash all the time after the last update. could you fix that. thanks.",
        "great application but it will be very good if we can use it without internet to pay bills for example",
        "A great app, and it would be perfect if you add in English language.",
        "I would give five star if yu add a built in browser, i got sick of redirecting me to an external browser",
        "I Installed the app and my credit keeps running out evry click you make every option you change it costs calling credit or 4 G credit",
        "The page for online payment almost never works, so fix it.",
        "I can't transfer mobile data even though i have plenty of gigas, an error keeps popping up telling me im not eligible for that, fix your thing orange",
        "When i try to buy solde the app does load the page but it never appears. That's sucks !",
        "Help services are not up to the standard. Just simples useless chat bots.",
        "Can't at ALL get the app started. Plz make the updating optional untill you've fully sorted out the imperfections of the bothersome application 😣",
        "Very good app, practical, easy and well designed. Thank you Orange",
        "The app is good, but sometimes orange services it's not satisfying",
        "Not working whenever i try to register with my orange number it says Error and ask me to call 121 and no one ever answer at that number"
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.attijariwafabank.main",
        "ma.gbp.pocketbank",
        "org.hicham.salaat",
        "com.orange.orangemoneyafrique",
        "com.goodbarber.rtimultimedia"
    ],
    "moreByDeveloper": [
        "com.orange.orangemoney"
    ],
    "appId": "com.orange.meditel.mediteletmoi",
    "url": "https://play.google.com/store/apps/details?id=com.orange.meditel.mediteletmoi&hl=en_US&gl=US"
}