{
    "title": "Horoscopes & Tarot",
    "description": "<b>2022 Horoscopes and Tarot Cards</b>\r\nGo beyond your Daily Horoscope. This app features a wide variety of Daily, Weekly, Monthly and Annual Horoscopes, along with Zodiac Sign Compatibility and Tarot Card Readings. \r\n\r\nStart your day by checking out your <b>Daily Horoscopes</b>. You will get three each day. You can also view the current planetary positions. \r\n\r\nAnd don’t forget your daily Tarot Cards. Each day you will have access to a new Three-Card Tarot Reading. Get the deck shuffled and then select your own three cards, one each for the Past, Present and Future. \r\n\r\nEach week you will get a variety of <b>Weekly Horoscopes</b>. Along with your Weekly Overview, you’ll get individual horoscopes focusing on Career, Romance, Money and Style issues.\r\n\r\nPlus, you will have your <b>Monthly</b> and <b>Annual Horoscope</b> to view an overall picture of what awaits you further down the road.\r\n\r\nInterested in reading Horoscopes for other zodiac signs? You can quickly and easily access any of the 12 signs from within the app.\r\n\r\n<b>Daily Outlook</b>\r\nLooking for a quick summary of some key issues in your life? With our simple 5 star system, you get individual ratings for Money, Energy, Love and Mood. \r\n\r\n<b>Zodiac Compatibility</b>\r\nWondering who you are most compatible with each day? Your daily forecast tells you which zodiac sign you are being drawn towards. You can also check the compatibility ratings for any two signs.\r\n\r\n<b>Tarot Card Readings</b>\r\nLooking for insight into a particular question or issue in your life? Tarot Cards can help explain your current situation and anticipate future events. In this app you get a free daily Three-Card Tarot Reading with detailed interpretations for each card.",
    "descriptionHTML": "<b>2022 Horoscopes and Tarot Cards</b><br>Go beyond your Daily Horoscope. This app features a wide variety of Daily, Weekly, Monthly and Annual Horoscopes, along with Zodiac Sign Compatibility and Tarot Card Readings. <br><br>Start your day by checking out your <b>Daily Horoscopes</b>. You will get three each day. You can also view the current planetary positions. <br><br>And don’t forget your daily Tarot Cards. Each day you will have access to a new Three-Card Tarot Reading. Get the deck shuffled and then select your own three cards, one each for the Past, Present and Future. <br><br>Each week you will get a variety of <b>Weekly Horoscopes</b>. Along with your Weekly Overview, you’ll get individual horoscopes focusing on Career, Romance, Money and Style issues.<br><br>Plus, you will have your <b>Monthly</b> and <b>Annual Horoscope</b> to view an overall picture of what awaits you further down the road.<br><br>Interested in reading Horoscopes for other zodiac signs? You can quickly and easily access any of the 12 signs from within the app.<br><br><b>Daily Outlook</b><br>Looking for a quick summary of some key issues in your life? With our simple 5 star system, you get individual ratings for Money, Energy, Love and Mood. <br><br><b>Zodiac Compatibility</b><br>Wondering who you are most compatible with each day? Your daily forecast tells you which zodiac sign you are being drawn towards. You can also check the compatibility ratings for any two signs.<br><br><b>Tarot Card Readings</b><br>Looking for insight into a particular question or issue in your life? Tarot Cards can help explain your current situation and anticipate future events. In this app you get a free daily Three-Card Tarot Reading with detailed interpretations for each card.",
    "summary": "2022 Horoscopes and Tarot Cards - Go beyond your Daily Horoscope.",
    "summaryHTML": "2022 Horoscopes and Tarot Cards - Go beyond your Daily Horoscope.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.711431,
    "ratings": 25631,
    "reviews": 4273,
    "histogram": [
        470,
        59,
        859,
        3605,
        20638
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$1.49 - $39.99 per item",
    "size": "15M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Astrolis Horoscopes",
    "developerId": "Astrolis+Horoscopes",
    "developerEmail": "feedback@astrolis.com",
    "developerWebsite": "http://www.astrolis.com",
    "developerAddress": "39017 - 3695 West 10th Avenue\nVancouver, BC V6R 1G0",
    "privacyPolicy": "http://www.astrolis.com/privacy.php",
    "developerInternalID": "8391222914654908237",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/xIXeHtUFX1lJs5CwttKGOADPYktBSh3Vcuqpl6oYyTyOo6fIHuOkpgueqSdNeV2vAQ",
    "headerImage": "https://play-lh.googleusercontent.com/PAn0jOk1_TX_77T1irWUP-pHd-s7ziHp9cS4o0-0FcpyRXAN1RL1O9w7Tu-qaSJI8Jrp",
    "screenshots": [
        "https://play-lh.googleusercontent.com/b9S4wdThkts3ZKtgBxB_tCeXjy8btfHpyxUM4NAeTQwP23ars-zTaeTjBxY7C7yAGQ",
        "https://play-lh.googleusercontent.com/XUZNY-XzT9lkLEfaIk5E78M1wqq8NY2a9JJsigH8h7rgQYY3wpfwPMoQBTlBSFGAzA",
        "https://play-lh.googleusercontent.com/b1J9RXaf97MfwIqHDwf3ViSqdkdSvroVeVru0jayNhSygmncd4hm0dY-2i7fvn45iQ",
        "https://play-lh.googleusercontent.com/2Up_K-rGDv9S8qHWz7hzEqjzTtCrRBFnxonEfk4nQlDkGtyRjeboLwPJiYuUYAFxgv1N",
        "https://play-lh.googleusercontent.com/iDSZ17KxU5uOoS9zLpHsaYxvdCxEU2OSVxPGipUI1fnLbDs8VU16-wCOLHtq1KHHYIqF",
        "https://play-lh.googleusercontent.com/8fV3opwg3mLIzuJrC3QpV6v48yCyRzdZUgOTP0s_oB4sPEG6Y3Q1-_DjypzZqaBqOg",
        "https://play-lh.googleusercontent.com/fUPH9XvpvbmMgPqLuGPeR40aqUG9WcKZ8DE0cqDzQxRYm7pvz7lG95PVQCaxc4R2mw",
        "https://play-lh.googleusercontent.com/Q7VB16_RsXf99VwzV9fo-c7E5VHG_5W8W0Ef4pVY-25pxnfei6SqslrcN8mXe5XgtnNu",
        "https://play-lh.googleusercontent.com/4CExTQf2mD8dCQt4z6gxH_gJbWBOy_rP4NJzYEx80ZVJ95MDht5SG7ngtlOrg-CxmLWX",
        "https://play-lh.googleusercontent.com/kAJ16BH2wWdRN__dEvpY6HyOwsH2qy0j1AH0rd58o65EPjrpUAwiEJmiiuRsTaQfdTw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "May 19, 2012",
    "updated": 1645019126,
    "version": "5.8.2",
    "recentChanges": "This update includes performance updates and bug fixes. To make feature requests or report bugs, please use the in-app contact form. ",
    "recentChangesHTML": "This update includes performance updates and bug fixes. To make feature requests or report bugs, please use the in-app contact form. ",
    "comments": [
        "I give this app 4☆'s. I feel that I shouldn't have to pay to use certain parts of a free app. Its either free or not. Not free then have to pay to use parts of the app. Then what's the point of the app being free. I can't stand ads. I like the fact this app doesn't have many ads. But other than that I love this app!",
        "Looks like we recently received an update that includes auto dark mode. We'll not everyone likes dark mode, so instead of it being Auto, give the users the choice. When it turn it off, the next day it's back on again. Gonna need another version pushed real soon..",
        "I love this app!! It's almost always spot on. To the point that I open it first thing in the morning to see what my day will bring. I would recommend it to anyone who needs a little guidance and direction ⭐⭐⭐⭐⭐",
        "Really like this app. It's better than most. Love the daily tarot pull. Had it continuously for over a year. I've never had any app last that long. Job job guys! Keep up the good work. 👍😁",
        "Spot on at times, always helpful. Very easy to navigate and no pop up ads. Love it!",
        "I've downloaded many apps similar to this one. But they're not as good as this one. This has more information then all I've seen and I love the tarot card readings you can do at the end. I also can find thing that resonate with me also gives me a heads up on how my day, week or month can go. Then I'm aware of the possibilitie that can come about.",
        "I will tell you. I honestly do not know what I did without this app, to get my day started!!! It is amazing just how accurate it is! And, you never give it hardly any thought, about the things that it describes to you, until you think, how lost I must have been when this app wasn't there to answer certain things that pop up in my day!!! Thank you for giving me something that helps me get through my day with ease of use!!!",
        "This has been a really good experience for me. The planets affect one more than it would seem. I really like the fact that this app let's you see your horoscope in different perspectives. The yin yang perspective is my favorite.",
        "I've had versions of this app on every device I've owned in the past 5 years. Wittily proposed forecasts including pop culture reference analogies... Great tarot card explanations... Accurate and thorough explanations of planetary positions and what they mean in relation to the day.... avatar choices are fun plentiful",
        "Like it. I just love astrology period, though. I used to not understand the bigger picture, but the older i get the more i understand it. It's fun, interesting and very unique.",
        "Love the app..2 yrs later, I still love the app! Been having issues withe app freezing up on me, can't do the tarot cards..it goes blank, can't scroll down..what gives????",
        "Cannot read the date and time information because it's truncated with .......... For no reason. If I can't set my birth information, then I can't use it. Uninstalled from my tablet. Tried on phone. So the date and time goes in but changes arbitrarily when I switched to another app and I have to reset every time? It's silly. I can't keep doing this.",
        "I consider astrology to be more of a random thought prompt than I do something that had any predictive value. Some of the horoscopes repeat but it doesn't matter to me so much since it's just a way to get me to think outside the box. It nicely walks the line between too little information and word salad. Also like the 3 card tarot.",
        "Over the years I've tried alot of different horoscope apps. This is by far my go to time and time again. Strangely accurate and straight forward. I'd highly recommend this app to anyone. 5 stars through and through",
        "Always freezes and turns off by itself, only app in my cell phone that's having this issue, please fix or I guess I needed the memory in my phone anyway ill have to delete.",
        "WOW!!! Best horoscope app I've EVER used. It's accurate and super easy to use and read! So happy that I've downloaded it. I read my horoscope every morning before I start my day and it is absolutely spot on!",
        "I love this app. It has become my favorite horoscope app because it's so detailed and accurate. I would definitely recommend this app to anyone interested in their horoscope or just astrology in general.",
        "Useful without being annoying. It is dissppointing that switching horoscopes will not enable a different tarot selection for that sign.",
        "This is a great app! Not your typical horoscope. There is a lot more information both daily, weekly, articles, blogs, etc. Info on planetary changes and effects. Nicely put together!",
        "I am still trying to wrap my head around the truth of my zodiac sign reading. I will say what I read is very interesting as I wait for any potential sources of some form of reality about what I am reading. I find the Tarot Cards peak my stage of my life in a upward positive, spiritual needs and keeps me guessing as I read the Past, Present and Future. Thank you for keeping me on my tippy toes as I will continue to read what is in store for me.",
        "Sense the last time i did not understand the real meaning's of some of what the app tarots card readings,\" but now this apps are far more accuarte than my 1st time useing it.Sure I liked this app from day one of using Accuarte!' readings\" And most about this app' is what I'd been wanting all along the daily- planets and thoes - love- weekly-monthly and Yearly). Just cannot get any better app as this App.😃",
        "The readings have been right in point. The site is very user friendly. Easy to operate.",
        "Great app but I found a better one that I like, it seems to be somewhat accurate, but I found the tarot readings off, doesn't give as much info that I want.",
        "This app is great, I have used it for about a year so far, it is very informative on all of the planets and how they affect your life, I love it. the tarot reading is pretty cool. One thing I dont love is how glitchy it is, it used to never glitch or freeze. now after I've looked at my daily read I can barely make it to the weekly read without it freezing on me. then I have to exit the app and hope it doesnt freeze when I open it next. It is getting annoying. Please fix and will give 5 stars.",
        "I find the tarot cards to be my favorite part of this app. So far it has been a very positive experience, my last reading was very insightful and helpful!",
        "So far this app has been right on the nose! Compared to my personal Tarot reader, this app seems to click right on the same areas as my personal tarot readings, but with more indepth into the descriptions of what it talks of, and I like that! Thank you, and keep up the good work app developers, you guys have done good with this one, see you in 2019....",
        "I really enjoy reading up on my horoscopes as well as my tarot and I really enjoy looking things up because it gives me you know where I'm skeptical but I love to read a lot about my horoscope and teaches me a lot",
        "Have used this app for multiple devices including kindle fires for years...it's better and more in depth..every time I buy new devices it's one of the first app that I download.",
        "It's Ben pretty handy and informative so far website hasn't started shoving advertisements down my the viewers throat. 😀",
        "Very Nice Astrology App. I Highly Recommend it. I like what I see. laid out Very Nice. It's easy to access and Lots and Lots of Information.",
        "Wow! I'm impressed! I've read countless horoscopes from different sites, but I've never seen so much information before...This site has more then I even know! EXCELLENT SITE...you won't be disappointed!",
        "This app is BY FAR my favorite horoscope app. I love how it includes tarot cards and other readings for romance, career, love, etc... Overall, the readings for both my tarot and horoscope of the day are almost always SUPER accurate. I look forward to this app whether it is middle of my day, or I open it at midnight to see my tarot. The only mark against it I have, is thay you cannot go back more than 4 days to see your horoscope for that time if you missed it. Fix that and it gets 5 stars.",
        "I take all these apps with a grain of salt. But this one seems to speak my situation almost every time I read it. Kind of creepy but more Inspirational than I thought they would ever be. Especially when daring it every day to tell me what's going on I'm constantly being amazed. But then I wonder my phone is listening to what's going on in my life. Maybe can use data from what it hears to tell me what's going on now live through a horoscope app. I don't know but I like this app.",
        "I can't lie 🤥 This app really has matched what my days and forth comings days are like. I'm super intuitive so it's like a extra high five for me already knowing and seeing what's to come.",
        "This is a very easy to use app and offers you various readings.",
        "The new look and layout suck! It's complicated and difficult to understand and control. The old format before the update was easy to navigate and much more user friendly. This new one is cluttered. I will definitely be looking for a new app and will most likely uninstall this one after years of using it. I can no longer recommend this app",
        "This app is amazing, my gf downloaded it too, but she's more into it then me. She says its accurate, it helped heal our relationship as well. There's a notification every day that is hard to decipher at first but by the end of thr day you get it. My favorite part is that this app carries a free tarot reading. For. Understsnding BTS relationship energy, money, and your focus's for the day-year under astrology and even the Chinese Zdiac this app is strangly overpacked, but I'm not complaining.",
        "I really like the app it's fun and entertaining and I find it to be very insightful. Most days my readings are spot-on",
        "This has been one of the better horoscope apps I have used. It has been mostly accurate, one way or another, though I think that a lot of the planetary aspects are a bit repetitive between Career, Money, Love, Weekly, etc. which makes reading these different categories kind of pointless if they are all so similar.",
        "Great insite for me. Everyday something different for me. I tend to follow some of the instructions and been effective many times for me"
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.astroguide.horoscope.tarot.free",
        "com.mirofox.numerologija",
        "pl.fazi.wacek.horoscope_and_tarot",
        "com.grupoprecedo.horoscope",
        "pl.horoscope"
    ],
    "moreByDeveloper": null,
    "appId": "com.astrolis.Horoscope",
    "url": "https://play.google.com/store/apps/details?id=com.astrolis.Horoscope&hl=en_US&gl=US"
}