{
    "title": "Among Us",
    "description": "Play online or over local WiFi with 4-15 players as you attempt to prep your spaceship for departure, but beware as one will be an impostor bent on killing everyone!\r\n\r\nCrewmates can win by completing all tasks or discovering and voting the impostor off the ship. \r\n\r\nThe Impostor can use sabotage to cause chaos, making for easier kills and better alibis.",
    "descriptionHTML": "Play online or over local WiFi with 4-15 players as you attempt to prep your spaceship for departure, but beware as one will be an impostor bent on killing everyone!<br><br>Crewmates can win by completing all tasks or discovering and voting the impostor off the ship. <br><br>The Impostor can use sabotage to cause chaos, making for easier kills and better alibis.",
    "summary": "Join your crewmates in a multiplayer game of teamwork and betrayal!",
    "summaryHTML": "Join your crewmates in a multiplayer game of teamwork and betrayal!",
    "installs": "100,000,000+",
    "minInstalls": 100000000,
    "score": 3.6090055,
    "ratings": 12958180,
    "reviews": 515521,
    "histogram": [
        3087810,
        754618,
        1038912,
        1331816,
        6745024
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$0.99 - $24.99 per item",
    "size": "124M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Innersloth LLC",
    "developerId": "Innersloth+LLC",
    "developerEmail": "support@innersloth.com",
    "developerWebsite": "https://www.innersloth.com",
    "developerAddress": "PO Box 2532\nRedmond, WA 98073",
    "privacyPolicy": "https://www.innersloth.com/privacy.php",
    "developerInternalID": "6235553311911178709",
    "genre": "Action",
    "genreId": "GAME_ACTION",
    "icon": "https://play-lh.googleusercontent.com/8ddL1kuoNUB5vUvgDVjYY3_6HwQcrg1K2fd_R8soD-e2QYj8fT9cfhfh3G0hnSruLKec",
    "headerImage": "https://play-lh.googleusercontent.com/20WRzUOzjXVwgKFvl9AcvwClB537qZEfBUe186dEfFgCbWEuPu9_4-FElfHptKoE_g",
    "screenshots": [
        "https://play-lh.googleusercontent.com/w6vW9zws_XsPV9FcMGsj7ub0bnrfOltEmzxf8g3pG31KVcwvoPfPjhvtMf-V5Zu3Nw",
        "https://play-lh.googleusercontent.com/fe6__R6zF3nkF6EyJxdMZVQkY4lm-08EuemPYbiIiT9s7mjlhUwSeJR5zHjYELuNAQ",
        "https://play-lh.googleusercontent.com/FCXDYr9DlxZEH6u-sPWFrcge1VRMkjEoamodePX5BfhcF9DmteD9mE1-RMP7IwD-hQU",
        "https://play-lh.googleusercontent.com/bfyFan_mu66a-QTUSsccNW5_uJqBKSt8mgRvaAznSDeq_wmY5LLExKN8BNsBARoDnQ",
        "https://play-lh.googleusercontent.com/FhcOlwyLEcYZ4qsW4_vym00rZzVbwl7FX_J6BRvAgg3ePBle54WZrFTSBs2V_gSUe6E",
        "https://play-lh.googleusercontent.com/qKzgm73G-tYutABAFdP9Eiwu1Fw0mfVMHNsi0cI5Q6kSK0aRFI99J_mODQsVQ-8QznI",
        "https://play-lh.googleusercontent.com/6NLvS7CYBkh4enk7JgcNe0wgznMoL-FsH7xUn4fXUfwt2sLfsCVcoCnItC3PACWtJtyM",
        "https://play-lh.googleusercontent.com/5klXIqLA-SnaKI3lfF_i74zaUA_Sc67boTkIwsE-bjjwXWURRIWyD_f3JM0LieHaTwY",
        "https://play-lh.googleusercontent.com/ueCytRjDirEr8Zw7XM3m5SOVhwCHaT82EHo6Y0VgzZIGv1LdFncI5hDkdCiejaWeXrJI",
        "https://play-lh.googleusercontent.com/oSmEJQ6zUHUu35WQLRdFQAavq9HWzQsYp6JXuGtI0JQkBGHpHDBYpzfthXsugxhZsKw",
        "https://play-lh.googleusercontent.com/Nq0CgtANJNQkeW-LvcZj_qQTKawdj_jaJ_DrDvaW6s8sxV5Flz16SyS9LNbVa4r0p8k",
        "https://play-lh.googleusercontent.com/r5wHxKJCtUns89iRFQ7IriR_EmjjLFsmGb3wsoRHt7ibt62RXm0v1PoNRBcksiMJXL8",
        "https://play-lh.googleusercontent.com/V6KYi2th_iCqorPOxeVf6dgZ3Q09S9eEq5Nqn3RDvfxEI2fOMyePshhtWHLaJ5O54lva",
        "https://play-lh.googleusercontent.com/Lh57B5qa8eLqgKYfPfxlXnGS61HKEbwagVTEQDeHrSqNi-yg9KMKERh1eB7gvm6gE68",
        "https://play-lh.googleusercontent.com/I4gu-bvEw7FusY7C0C5BbgvRZ0Job8jWkbZU1dFn15ET1Cly8ikulTH7MdyynrB-Yr0",
        "https://play-lh.googleusercontent.com/beL8sikjTxcdbLNg7xco8m5V_hgjSjnKgQj3l_E3aXuqwEbTfyFwN3M6apf-bpYJVT8",
        "https://play-lh.googleusercontent.com/wXwEMpcFw-K51LkTnK-29H2wFA5BbHHS58JqwBOPAZt3YEpb5JITFQc0Diy0TGmEt-XN",
        "https://play-lh.googleusercontent.com/eu-_n2DtxfdTcyNZ7QGRKUWZS0u7rtAf-zPOZeuPRaXovgMTtacrfatb0uxUDcU__nU",
        "https://play-lh.googleusercontent.com/rCq1j2LBBsijbMWD4HGvEe7FKv_usI4d8MgaVrO5V391tftJC8eMJffT1xk5THBcoQ",
        "https://play-lh.googleusercontent.com/ZxHXVsbuUUFbR5lNhEiEUMhYDIp0AkiXnQGNSKXoUYs5TB3W8HWrGba2A5G1Y_n7Mmei",
        "https://play-lh.googleusercontent.com/pRE83LFPAF3D9X2pE20_-gavi0X7EuJd0hkQkOSGroeErUw4f6r09LirM_ngFiD2nKum",
        "https://play-lh.googleusercontent.com/7BLEl-UeVElri8mmlcoCNjSkTMuhfz31S7UdFnnEUUQxXVgcrus2SJjPx_Ipn68HqDw"
    ],
    "video": "https://www.youtube.com/embed/sYvKjZKunyo?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/20WRzUOzjXVwgKFvl9AcvwClB537qZEfBUe186dEfFgCbWEuPu9_4-FElfHptKoE_g",
    "contentRating": "Everyone 10+",
    "contentRatingDescription": "Fantasy Violence, Mild Blood",
    "adSupported": true,
    "containsAds": true,
    "released": "Jun 15, 2018",
    "updated": 1639687543,
    "version": "2021.12.15",
    "recentChanges": "Minor connection fixes",
    "recentChangesHTML": "Minor connection fixes",
    "comments": [
        "It's been kicking me off the app multiple times, sometimes saying I did it intentionally!! And not letting me rejoin. Too many times I've found a good lobby, try to connect or exchange social media, and then get kicked off MIDGAME. Out of the ENTIRE APP. It's infuriating! I haven't even been playing for more than a week.",
        "I rated this in 2020 when Among US had its jump and then started getting bad. That was when lots of people (including me) uninstalled and didn't play it again. Until this year I got curios and wanted to see what it is like now. And I really think it has changed into a better game. It is a great game again and I would recommend giving it a/another try.👍",
        "UPDATE: IT'S BEEN 2 MONTHS SINCE CONTACTING SUPPORT. NO HELP AT ALL. Be prepared to lose ALL YOUR PROGRESS If you download. I have been unable to sign in to my account since 12/25. I had the account for 2 years and it's gone. I have reached out to support multiple times without any help and very delayed responses. I loved this game so much, I played daily. I don't understand why they even offer support when they don't help you. If support was helpful I would rate 5 stars but now they get 1 star.",
        "The game is great, but there's a problem. Whenever I try to play with my sibling (my family shares the same account) online, it doesn't allow us to play together. Maybe add in a feature that when 2 people on the same account play online, it would say, \"Are you playing with a trusted person? There is another device playing on your account.\" It would let you choose \"Yes\" or \"No\". If you chose yes, you would continue playing. If you chose no, the other person would be kicked out.",
        "This game is kind of cool. It mainly depends on your lobbies though. You can get really good people or people who just make stupid jokes, try to get your insta, or just weirdos. Costumizations in this game are also cool. I just wish there would be like a friend list. Maybe so you can only be with people who you can find once? Or maybe you can sort out a lobby depending on what level you are to make it more fair? Idk.",
        "such a grat game! love the roles, love the outfits, and love the tasks! this game is perfect! Although there is some things that need to be fixed. first off please fix the bugs there huge and sometimes wont go away! but its no big deal because it happenes with alot of other games! Anways this game is great and i reccomend playing this!",
        "This is outrageous. I used to love playing Among Us back when it was just simple and fun. Now, there's new roles and a bunch of unneeded junk everywhere. I hate that there's accounts and if you don't have one then you can't type. So if I don't have an account you take away my ability to type? My speech is so limited without an account. Please remove this feature, Among Us has changed for the worse. Furthermore, it doesn't let me join public games. It just keeps loading, and I have an account!",
        "Fun when it's working. I can't earn anything for completing games in polus because the screen freezes after every match and doesn't give rewards. Also whenever the game crashes or server disconnects, the error description makes it sound like it's the users internet connections fault. This is the only game that disconnects this much. I've played for a long time, they are not a new game anymore. They should have this worked out.",
        "I love this game, play it almost every day on my Android device. However I keep getting stuck in games when impostors win. For example, when the last crew member is killed the lobby freezes and I am stuck in the map indefinitely. I do not get sent back to the drop ship. One time as an impostor on Airship we won with the disaster, but I was trapped in the map and the countdown was counting negative seconds. The only way for me to continue playing is to leave that lobby and join another.",
        "The game has definitely improved since the last time i played it, you've given players a couple free costumes, added more roles, etc. But the major thing I would like to point out is the servers that are filled with people with bypassed names, like \"horny fem deku\" and that shiz. But anyways, the number of people that do this has decreased, giving players looking to enjoy the game without being harassed by the BNHA stans, a great experience. Among us still needs to do something about this, tho",
        "Honestly, I'm kinda sad. This game is really good but it's been experiencing bugs left and right. If I can't join a game when I do join one sometimes no one can complete their tasks. And the thing that infuriates me the most is the fact that I purchased something from the game and I haven't been able to restore the purchase. I bought the mini crewmate bundle for around $3 and when I got on the game after a few months I noticed my items were gone. I tried pressing restore but it disappeared.",
        "I love this game more than anything and I play it almost every day but I have found a really unfortunate glitch/bug. It seems to happen very randomly. All crewmates need to click on the icon for the tasks rather than the \"use\" button to be able to complete tasks, and the impostors are unable to kill anyone. Hopefully y'all can figure out a fix to this",
        "As much as I hate it, I can see why quick chat is necessary. But the reason I gave this 2 stars is because it doesn't even let me play anymore because of \"internet connections\", which is completely false. I wouldn't give a game a low rating about this, but others are also experience this issue and the game developers need to do something about this.",
        "The only problem is that I can't buy anything from the cosmicubes. Whenever I try to, the game loads forever and says, purchasing item, please wait, but I'm still unable to buy anything. I've had this problem ever since this update came to among us. So if you could try and fix that bug, that would be great, I would give this app 5 stars",
        "The game is solid-ish-- decently fun and all that. With that said- I have ran into my fair share of issues. The one that matters the least (but bugs me the most) involves the cosmetics store and cosmi cubes. Even after deleting and reinstalling the app a couple of times- as well as resetting my account, I am unable to purchase anything from either. I am unsure as to how likely it is, but my phone may just be the issue, regardless this problem is worth noting. That's all I can write for now- ciao",
        "The game itself is really fun, especially with people you know. But the keyboard for chat and discussions, and the analog stick (that contols your character) is soooooo slow and buggy. It barely works at all. Were it not for this, I'd give it 5 stars. Its very fun and I could play this over and over again. Please fix.",
        "The game is really fun and I enjoy hopping on after a stressful day to eliminate random people when I'm imposter. Although the game is great, I have latley experienced more stress than usual. Whenever I have hopped on the game latley and tried to sign in, it says my network is not working and to either wait a little longer, or to go offline. The thing is, I would check my internet and it would say it was working. This is why I have hated playing latley. But I would recommend.",
        "\"Amount Us\" is a very fun entertaining game , but the only problem is the fact that I can only play the game a few seconds and it takes me back to my phone home screen. I've downloaded this game on two phones and even sign in as guest, but the same thing keeps happening.",
        "I used to love this game but the new update makes it annoying. Not only that but when I put my age in, I put the month and it didn't let me do the rest, so now it keeps saying I'm 2 years old (I'm 13) even after I uninstalled and reinstalled, put my actual birth date, and it worked until I clicked \"sign in\" and it didn't let me change the email I had that said I was 2 on it. When I try to do the verification that I'm an 'adult' it requires social security numbers or credit card numbers",
        "I had just decided to play this game after not playing it since 2020 maybe, The many sercurity features are a lil to much anf having to verify of your child can or can not do things is a lil extremely..I know that its is made so that your child might not get into any trouble or run into anything bad. But i think the parent should just set certain controls for there child on there phone and can change it whenever with there gmail.",
        "Amazing. Just, wow. This is awesome. I love it. I recomend to all fans of mystery games. Edit: i had to change to two stars because after awhile it stopped letting me play. Whenever i try joining or making a server it says reliable server size was not ack'd whatever that means. Please fix this. I really like this game, but now i have to play roblox rip offs of it.",
        "really liked the old version. the buttons are smaller now and they are very hard to hit sometimes. also they added some stupid xp factor and currency you can earn while playing games, and new \"roles\" that everyone hates. they also completely changed the layout for game settings and color changes. i Loathe it with my entire being. please just go back.",
        "It's a great game but the chat is annoying. I know you can chat normally if you get an account and I keep on entering mine but for some reason it won't work. But other than that it's really fun also love the new roles my personal favorite is the engineer but some people accuse you of venting and you can't say your engineer without an account and I explained that up there but I don't really mind actually doesn't take much from the awesome experience 😉 I would definitely recommend!",
        "It's a good game, and I love games made by puffballsunited and innersloth, It's made me look for more details and go full detective mode. why? I also love the new map, roles, and other things. I think it's fun and pretty cool, and it makes things more diverse, fun, and overall perfect! BUT- could we have a friend request system? And also a limit on bans or kicks per day. Too many times I've joined a server and immediately banned by host for no reason. Good game still!",
        "It's a fun game but the new update is annoying. They added in roles and the shape-shifting is too confusing. Not everyone wants to play with those. You can either join every game avaliable to find one without or make your own and hope someone joins before the room closes. Wish they had a way to filter what game settings you're looking for.",
        "I used to love this game so much 2 years ago. I used to play daily with my friends. A year ago I stopped playing because you added so much junk to the game. Now I play the roblox among us called Amongst us because it is so much better than this junk game. If you get rid of Quick Chat and Account, I will give a 5 star rating.",
        "40%, of the game is fun but the other 60% of the fun that really makes this game Is the open chat room. This preselected chat Sucks and completely takes away all the fun & ruins the game. The whole have an account thing just to have the open chat is also trash and doesn't even work. Plz change ot back 2 open chat. It's so hard to even acuse or defend now and you have 2 go by the ppls name it takes 4 ever to find what you want to say.",
        "This is outrageous, I can't even join a game. It's saying something about data could not send as socketaddition or something. This does not make sense. Fix this please because I can't even play this game even though I downloaded it and downloaded all it's information and still can't join. I raided it 3 stars because I'm not sure if the game itself is good or not. ONLY BECAUSE I CANT GET IN!",
        "Awesome app We can communicate to our friends and family while we are playing in this app But sometimes when I want to enter the code to enter with my freinds I can't and I don't know why and now with the new update it is not allowing us to create or join a game or even enter the code I really don't know why is it like that so please fix this issue 🙏🏻🙏🏻🙏🏻",
        "I really like playing this game. My problem is I'm colorblind and when I play in public I have a really hard time knowing who people are talking about because they are referred to by color and not everyone is nice enough to help me out. Not sure but I think an easy fix could be under name on vote screen in parentheses you could put the color of the character. Like I said though great game I highly enjoy.",
        "this game is very great but could be way better if as a host i couldn't be banned from my own game. If as a host, be able to ban or kick anybody that is annoying other players and hackers, even while the game is going on. Not only when the round is done. The game needs a bigger map with more rooms than that. Also y'all should creat a verson to people over 18 and another one for games. There is too much cussing and kids shouldn't mix with adults.",
        "Fun to play. However, using a Google Pixelbook and the chat feature does not allow me to type. I must choose from preset options which slow communication and make it diffucult to have a fair game. I have searched and cannot find a setting to change this. When I click the type box it turns green and nothing I type shows up. when I hit the send button nothing sends.",
        "Of course, I love this game but please for the love of God fix your connection issues. And the amount of glitches are crazy. Idk if this game is like this on any other platform but it's definitely giving neglecting the free version for the paid version.",
        "I wish I could give this game a zero star. I used to love this game until you made the new update. I can't play with my friends and the game is SUPER weird she can't even log in and it's pissing us off. I have gotten voted out every time bc I can't type in chat. This is the worst game ever. I'm never playing any of your games if they are going to be like this. You should be ashamed of yourself and everyone else probably agrees with me.........",
        "It's a great game over all! The new shift thing for the imposter is totally awesome but the problem is it won't let me play...I have uninstalled and reinstalled the app countless times and even had 5 bars but it still won't let me play. It might just be my phone but it is definitely worth noting. Other than that I really love the game and think it has changed a lot since the last time I played it in 2020!!👍",
        "I like this game, but when downloading it for chromebook it gives me the mobile version. its nearly unplayable. i know this is a lot to ask, but please at least add a way to use the kill button on chromebook. Another reccomendation is more roles, however i am aware that those are in development, so keep up the great work! i can find myself playing this game for hours with my friends.",
        "The initial user experience is broken. Account linking does not work. My friend group wasted 20 minutes trying to get everyone logged in but multiple steps in the process broke for multiple people. Accounts wouldn't link. Age verification wouldn't go through. We'd get socket exception errors trying to join games. The game worked fine before they added all of this. Now it's broken.",
        "I love the game, however, there is absolutely no monitoring of what is being said in these rooms. For instance, just today somebody told me to go kill myself because I caught them as imposter. I've seen so much bullying and/or flat out racism/sexism go on in these chats, I'm appalled. Reporting the person does absolutely no good. The person is still allowed to play with no penalty whatsoever. Parents, please... PLEASE watch your children playing this game.",
        "This game is fun, but unfortunately it's very laggy. When I finished the SUPER LONG download they made me do, I tried signing in but it told me it failed. It kept glitching and when I finally signed in and tried to type my name, it didn't work. When I tried to play the game it glitched SUPER BAD and I couldn't move. Among us is SO fun but sadly it's SO LAGGY. Please fix all the bugs because it's really irritating and I can't even play it!",
        "Game has become basically unplayable on mobile. IF you are lucky enough to even be able to load the lobby list you get disconnected seconds into the first round. Almost never can you finish a game and then you run the risk of getting disconnected from the lobby. It's ridiculous that it's been months without a fix for this issue."
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.roblox.client",
        "com.movile.playkids.pkxd",
        "com.paradyme.solarsmash",
        "com.hitrock.hideonline",
        "com.zakg.scaryteacher.hellgame"
    ],
    "moreByDeveloper": [
        "com.mygdx.digtochinafree.android",
        "com.mygdx.digtochina.android"
    ],
    "appId": "com.innersloth.spacemafia",
    "url": "https://play.google.com/store/apps/details?id=com.innersloth.spacemafia&hl=en_US&gl=US"
}