{
    "title": "Sam's Club",
    "description": "Sam’s Club \r\nEnjoy all your membership perks with the Sam’s Club app.\r\n\r\nSave time and shop easier every day with the Sam’s Club app. Make the most of your membership with these best-loved exclusives, including free Pickup, Scan & Go, Pharmacy and Free Shipping for Plus members. Save even more with Instant Savings and track your Plus Cash Rewards. Use the tabs at the bottom to find Home, Scan & Go, Account and more.\r\n\r\nScan & Go™ Checkout\r\nNow you can pay for gas with the Scan & Go™ feature to save time at the pump. In the club, shop contact free and skip the checkout line. Just shop, scan and pay, all in the app.\r\n\r\nPickup\r\nShop in the app, then schedule a free Pickup time that works best for you. We’ll have your order ready when you arrive.\r\n\r\nYour Lists \r\nStart your cart and easily reorder your favorite products, directly in the app.\r\n\r\nPharmacy \r\nTransfer prescriptions, request refills and manage prescriptions for the whole family for maximum convenience.\r\n\r\nMembership Card\r\nQuickly find your membership card in your account and access other membership details.\r\n \r\nShipping\r\nShop and ship directly to your home or workplace – Plus members get free shipping. \r\n\r\nDownload the app and get the most from the club today.",
    "descriptionHTML": "Sam’s Club <br>Enjoy all your membership perks with the Sam’s Club app.<br><br>Save time and shop easier every day with the Sam’s Club app. Make the most of your membership with these best-loved exclusives, including free Pickup, Scan &amp; Go, Pharmacy and Free Shipping for Plus members. Save even more with Instant Savings and track your Plus Cash Rewards. Use the tabs at the bottom to find Home, Scan &amp; Go, Account and more.<br><br>Scan &amp; Go™ Checkout<br>Now you can pay for gas with the Scan &amp; Go™ feature to save time at the pump. In the club, shop contact free and skip the checkout line. Just shop, scan and pay, all in the app.<br><br>Pickup<br>Shop in the app, then schedule a free Pickup time that works best for you. We’ll have your order ready when you arrive.<br><br>Your Lists <br>Start your cart and easily reorder your favorite products, directly in the app.<br><br>Pharmacy <br>Transfer prescriptions, request refills and manage prescriptions for the whole family for maximum convenience.<br><br>Membership Card<br>Quickly find your membership card in your account and access other membership details.<br> <br>Shipping<br>Shop and ship directly to your home or workplace – Plus members get free shipping. <br><br>Download the app and get the most from the club today.",
    "summary": "Pickup, Delivery, Scan & Go",
    "summaryHTML": "Pickup, Delivery, Scan &amp; Go",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 4.732973,
    "ratings": 192054,
    "reviews": 74797,
    "histogram": [
        7459,
        1746,
        3256,
        9689,
        169904
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "74M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Sam's Club",
    "developerId": "Sam's+Club",
    "developerEmail": "mobile@samsclub.com",
    "developerWebsite": "http://www.samsclub.com",
    "developerAddress": null,
    "privacyPolicy": "https://corporate.samsclub.com/sams-club-privacy-policy",
    "developerInternalID": "7896830977240667273",
    "genre": "Shopping",
    "genreId": "SHOPPING",
    "icon": "https://play-lh.googleusercontent.com/kgFlgsbsq27nkh3FEL4Q3L8vr0r_NN1LiJmuFywLrFiWe_5dlPwOVew03jKa8mGryTM",
    "headerImage": "https://play-lh.googleusercontent.com/P41TGcKWwXQ02shnvmqsalHixftA_KqlFFYrOi4ChvDoI9naqyB09dbfWsaMUgalkx9V",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_oAcS18FzoI6vdAKf160BzB6Ynz8gDS-e-q7qzeE2wlJFIBB8r9gdYPyn1u1EBKljA",
        "https://play-lh.googleusercontent.com/wFj-jFDTeW_K5E4D8kayZDtq9ODm1WLbeoxcX4AMJccISzOJVYBj4qc5fOQmpbM3Bg",
        "https://play-lh.googleusercontent.com/A8KPzXibFF53TxnNE_cBUAxmepTjNJWZFxIaLjBQHdAjSfhPqLKOE8YFIihrUW9T058",
        "https://play-lh.googleusercontent.com/BQnxSgcj1idDm5LTyfPq7ob66UQDyXsajdSl0fjRUjOLj9LTapyv7tTrrdhjP1nW5a5o",
        "https://play-lh.googleusercontent.com/UIMJsCTFmoatXk6b0qtJPcWPfzDFEnB64yiYbzCwEh0zDSzzIGVw0p9CDIi3vRxPjZc",
        "https://play-lh.googleusercontent.com/HTwGTyxkeeMIYaMVZDwq6A96rJs_ucrGInauiLxlITX5eO8HDbZ12C3VaYMy1cdGrg",
        "https://play-lh.googleusercontent.com/QK2Z7-37xpXAh81w4xnk2sUYYe-3MG-6qPF5sPwEOXkUDKe2t2mUgSOtMkvXOpuwbSyw",
        "https://play-lh.googleusercontent.com/BOelZPuJeWS80vBDxXg-nbrzN3bU7OijH-NEroL5neUO7swU-92qeCBuzOGhmdnWjRk",
        "https://play-lh.googleusercontent.com/tEiI3_wDA8V2HBcsCijEFumHqucfKbls_gX5l0IW689l3T2ihnHohX-0GAx95hcnpA",
        "https://play-lh.googleusercontent.com/RK4iAhYmezySm469FcsMZv0ve1AK3IVlZlHFsLek0jLl1G3-ZkyqiCfmN8a0uNDFGA",
        "https://play-lh.googleusercontent.com/viuXdl13lQS304QVc0u4pSP0004EUtHzqxkXmhB5K7BA2nXtomctFdy1lt17EgWmUHE",
        "https://play-lh.googleusercontent.com/698dPwRUgRhm3UuGmPRtNNL4KgHHuEWCuzi3fkz2jcp9eGJarmObrvH86GU0eQhJ7A",
        "https://play-lh.googleusercontent.com/zlH4Nu1EpCPBfe_FO1alLHgrzEklQCPEWPGH-xYCo82RXzS7CG5jZaNUGx7mCMDSfgTo",
        "https://play-lh.googleusercontent.com/-CQNFQdNsnxPmt83rSAlIue26iuey6Om75h1tQHNeb1CdDLhtp6WruWUhg7KpNSK40Jr",
        "https://play-lh.googleusercontent.com/b_j1y6YACvq2bZoffr_ml8EU60MzMdCmfSUlxFmLrdv2urGtrPYmfom1XccVlDmrOJw",
        "https://play-lh.googleusercontent.com/l_VYFj8ibMpbEcSAra8wxCa615_MYYPMAtjSJQm9GMUUCTRgTcYRueXRQQPiFji9GzM"
    ],
    "video": "https://www.youtube.com/embed/5QRSiKlCmdg?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://play-lh.googleusercontent.com/P41TGcKWwXQ02shnvmqsalHixftA_KqlFFYrOi4ChvDoI9naqyB09dbfWsaMUgalkx9V",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 24, 2010",
    "updated": 1646087882,
    "version": "22.02.10",
    "recentChanges": "We've made enhancements across the app to make things faster and easier – and cleaned up some bugs along the way. You can now cancel your Pickup order if you need to.",
    "recentChangesHTML": "We&#39;ve made enhancements across the app to make things faster and easier – and cleaned up some bugs along the way. You can now cancel your Pickup order if you need to.",
    "comments": [
        "I love this app. I can check out my Sams club shopping trip in store without the needs of using the cash register. What a bonus. Just scan as you add an item to your cart, if you don't want the item, just remove it from your check out list. Lastly, you click pay with the card that you already saved jn your app. You can pump gas with this app. You can do online shopping ship to home or pick up in store with this app. Whattt???? Right? I didn't believe it either, but this app is the best!!!",
        "The latest update worked great in the store all the way and through checking out. But at the gas pumps you get a flat zero. I tried 7 times to make the connection with their server and got 7 times no connection. The attendant says every thing is working but I can't connect. Back to the club card scan in. It has always worked before the upgrade.",
        "Am a traditional shopper set in my old ways. But after todays fast check out experience!!! Being the first time to use the Scan & Go App!!!Am sold!!😀😀No more waiting in line The Scan & go App is so user friendly even i could use it without assistance.You know time is money.🤑🤑🤑🤑So with the offers that come with using this app .I am going to get Huge Savings on both time and money at Sams Club from today !!!!",
        "Absolutely horrible customer service on the phone. I had to update my membership number online spent an hour! Without it getting fixed. On top of that the customer service lady, who was tending a baby while she was talking to me! Wanted my social security number! And like a fool I gave it to her. The next customer service person I talked to Said there said there was no reason for her to ask for it. Then I asked to speak to a supervisor and she hung up on me before we even started.",
        "This app is amazing, no waiting in line at all. Comes in handy especially on the weekends when my local club is PACKED. Simply add a credit/debit card and scan your items as you go. Show the QR code from the app to the person at the door on your way out and your done. Really nothing negative to say, if I could give it more stars I definitely would. Well done, I wish every other app was this easy!",
        "The Scan & Go part of the app kept popping up this stupid full page banner of \"Let's Get Started\" and start A Party or something to that effect. It did this before I scanned anything and then after every time I scanned an item. To make matters worse the little \"x\" in the corner of the blurb didn't work and I had to use the phone's back key to clear it each time. That is not good or acceptable app behavior. Please fix it.",
        "Super easy. It takes only the amount of time to shop. Scan your items in real time and slide to pay. I am usually in and out in 15 min. Forget waiting in those long lines. I don't understand why Everyone is not using!?! With the long lines due to the covid 19. Everyone should be using. Maybe people like to wait 30 min or more to pat for their items. NOT ME! Update... app just updated, scan and go not as good as it was.. Having issues getting bar code to scan.. WHYYYY do they have to 'improve'...",
        "The app does not function at all. Every time you open it you are told, \"Help us protect your account.\" Then you have to press and hold a button. You do this. Then several more screens that same thing pop under. After pressing and holding the button several times in a row, it finally just starts showing 3 dots like it is trying to load something.... It never does. So.. not a functioning app. Google needs to remove.",
        "This review is specifically directed toward the Scan & Go portion of the app but also love that I have my Sam's card right on my phone and don't have to worry about having a physical card anymore. As for the Scan & Go portion of the app, it is a literal game changer! My biggest complaint about most large bulk item stores is waiting in lines. I just open the app and start scanning. Checkout & pay on the app and head out the door. So easy and simple. So far no issues after using several times.",
        "Great experience with products I have ordered and had shipped to me. I had a ccuple of incidents where the items were wet due to improper packaging. I called Sam's and they immediately replaced the items. Other than those two incidents, I have had no problems with the products ordered. I appreciate the great customer service.",
        "The scan-and-go functionality using this app is simply fantastic! There is no more having to wait in a line at Sam's Club. Today was my first time using it. I even asked an employee do I just walk out to the exit. She said \"no you still have to get in the line.\" My inner voice told me to just go to the door. Employee at door scanned the barcode on my phone and then 3 items in my cart. I was then free to go. Yeah, this is smooth as butter using the scan-and-go functionality.",
        "The Merriville,IN Sam's club is very neat and tidy. Shelfs were stacked with plenty unlike the Sam's Club in Calumet, IL. Love this store. Special feature was the bathroom for the family with its special seating for little ones, I believe all Sam's Club need to have these install. Made my dreadful trip to the restroom way better and this bathroom here at Merriville, IN was clean. Great Job!",
        "Constant forced updates at the most inopportune times (like when you are standing at the gas pump with a long line of cars behind you waiting) and constantly having to log back in while shopping with the scan and pay feature. Update, again for the second time since my original review, I'm forced to do an update while standing at the gas pump with a line of cars behind me!",
        "Early user of the OG app & it was flawless. Not so much now. Main issue is the discounts disappearing using the scan & go. The discounts will show up in the cart when scanning, but disappers when moving to the payment stage. Tried to start over & all the savings don't show up at all. Customer service claims that having items in my cart & removing it counts as \"purchased\" items therefore \"maxing out\" the product for my membership. Manager says otherwise. App & SC system has a serious flaw.",
        "Loved the fact that my items could be scanned as I put them in the cart and I did not have to have everything jumbled up as the cashier transferred it to another cart. Super easy. Hardest part is finding the bar code on the item. Even bought alcohol but that was not a problem at all. Just showed by drivers license at the door.",
        "When it works, super slick. Skip checkout lines. Sometimes requires CVV for credit card, which defeats the purpose of having a saved card that you don't need to pull out. So, it's mostly a 5* app, except when it's a 1* 10% of the time when either items won't scan or it demands CVV.",
        "It works, sort of. The app is so busy with forcing adds that it interfears with the process. Another issue is that it beeps if an item is properly scanned (that's good) and it also beeps if the scan didn't work (that sucks). It took associates about 15 min to sort out my 12 item cart.",
        "Don't fix what wasn't broken! The app was... WAS amazing before this last update. Now I have to press and hold a thousand times to get into it. Sitting at home it's annoying at best but walking into the club makes me have to stand outside or in the entryway and \"beg\" the app to let me in. And now my \"cart\" doesn't function at all either so I can't shop remotely at all.",
        "Good app. I really like the option to scan and go at the store. As for grocery pick-up oftentimes it's not synched with the actual store. I've walked in the store several times and found the items the app indicates the store doesn't have.",
        "The \"scan & go\" part of app is soooo convenient! Once you're done shopping, scan the items, checked out via the app, and go straight to the exit. I wish the app will show the location of the items at the store.",
        "I renewed my membership at money saving prices! The personnel were friendly and helpful. Using the scan and go feature was like being on a futuristic television show. Wow! The lady at the door used the scannable code to confirm that I had paid for the merchandise and I was on my way. Thanks Sams Club! I'll be back!",
        "Very discouraged i was placing an order this morning cause the items showed pick up as early as 3pm but when i went to checkout and choose date and time it only showed tomorrow and the following day. Waisted my time creating an order with all 18 items saying pick up as soon as 3pm today. Only decided to put an order in because my husband as a nurse picked up a shift near by for the day and we live 40 minutes away so thought he would be able to pick up after his shift. This should be fixed!",
        "Dreadful app. I downloaded this app several years ago when it first came out. Between the last time I last used it and 2022, there was a pandemic, and I now have a different card and new number. This new app won't let me use it until I renew my membership on the old card. Wow. If I had not already renewed my membership, I wouldn't have.",
        "So this is to avoid a line. It is attached to a phone via permissions, linked to a specific email, linked to the Sam's Club account, and has to use the in-store Wifi to work. The app shows items you have purchased before, so you can one click add to cart. THEN you pull this \"random for your safety go to a line\" BS. No you wanted to make me have the inconvenience of standing in a line for over 30 minutes, only to be hit up for a credit card, not for safety. Stop lying to people.",
        "The app is incredibly easy to use and an absolute time-saver! It also let's you know how much your spending BEFORE you get sticker-shock at the register, which makes it even better. If shop at Sam's and have a smart phone, why would you not use this app?",
        "This app is so convenient and easy to use. One of the best things Sam's Club came up with. The exit associate Kayla at my home store is always so helpful as well. My partner put me on to this app. No lines, EVER!!",
        "I find myself looking on this app daily, I am a bargain and Bulk shopper. The cost is really obvious if your shopping for a great television or tablet, but on a case of razors or frozen fish. They have my favorite candy selection, they alsohave name brand clothing at far belowcost. I only wish I had shopper here when my children were young. Diapers from Sams club alone would have saved us a fortune.I do tend to impulse shop and purchase more than I intended.",
        "I love this app. It's so easy to scan and go instead of standing in line to check out. I love the gas feature. You just scan the pump and it automatically uses your card on file so no more standing in the cold to long.",
        "All around great app. Scan and Go is very convenient. The only problem is I added another credit card and set it as the preferred payment method and the last 3 times I checked out the app used the wrong card. I deleted the other card today, and I missed out on credit card points as a result each time.",
        "The point of using the app is for convenience. When the app randomly requires me to log-in and remember the password, then reset the password, then not recognize the new password, that is in no way convenient.",
        "This app update updates too often. If it would allow you to update when convenient, That would be great. I updated Jan 31 and now I'm in front of Sam's again Feb 8th and can't get in until App updates and reinstalls, again. Kind of frustrating. Great app otherwise.",
        "Waited in line for fuel for 15 or 20 minutes and soon as I got to the pump it made me update the app, said the app is no longer supported which was very irritating and time-consuming because I feel I have a very nice expensive phone and it should have updated by itself.",
        "Updated review: All glitches fixed. Fuel station is my favorite feature. Anytime leaving app you lose everything you've scanned. Even when your phone cuts the screen off you have to restart. Guess I'll go back to standing in line.",
        "I was shopping with the app and loved it, now I upgraded to the new Samsung Galaxy Z Fold3, the option to use scan and go is no longer available. I hope that it will be available sometime in the future.",
        "Quick shopping! Scan and go, right from your cellphone. Could not be any easier to get what you need without the hassle of waiting on a long line. A scan code will appear on your screen once you paid for your items.",
        "I renewed my membership and the scan and go option is no longer working on my phone. The scan and go icon is gone. I have uninstalled and reinstalled several times. I use to love this app but now its useless if this option disappear from the app",
        "This app needs password authentication after pay is selected. Was recently in a Sam's club and someone tried to steal my phone. They would have been able to charge anything they wanted simply because the app was open. It's a great app and it's easy to use. But it's not safe if someone gains access to your phone.",
        "BROKEN! App was working perfectly, then it demanded an update. I had to wait 5 minutes before I could get in the store for the update. Once it finally worked, I tried to use the product scanner and every time I use it it says product not found.",
        "We were skeptical at first but then the lines were really long and we were in a little bit of a hurry. So we gave it a go and found out that it's really easy to do this no headaches no nothing you just scan it he walked through the scan aisle and then you go to the door you show them your phone and you're out the door.",
        "Only works with certain debit cards. The card I typically use to shop with wont work on the app anymore. It works fine EVERYWHERE BUT this app. So I can't do store pick up, or scan and go, which were the great things about Sam's club"
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.kroger.mobile",
        "com.smithsfoodanddrug.mobile",
        "com.meijer.mobile.meijer",
        "com.target.ui",
        "com.bestbuy.android"
    ],
    "moreByDeveloper": [
        "com.samsclub.squiggly",
        "com.samsclub.samsclubevents"
    ],
    "appId": "com.rfi.sams.android",
    "url": "https://play.google.com/store/apps/details?id=com.rfi.sams.android&hl=en_US&gl=US"
}