{
    "title": "Video Downloader - Video Downloader App",
    "description": "Easily download videos and music directly from the Internet onto your device. <b>All formats</b> are supported. 100% <b>free</b>!\r\n\r\nFree Video downloader <b>auto detects videos</b>, you can download them with just one click. The <b>powerful download manager</b> allows you to pause and resume downloads, download in the background and download several files at the same time. Use the HD video downloader to preview the video first, <b>fast download</b> and play it offline.\r\n\r\nFeatures\r\n* HD video downloader\r\n* Browse videos with the <b>built-in browser</b>\r\n* Play videos offline with the <b>built-in player</b>\r\n* All download formats supported, <b>mp3, m4a, mp4, m4v, mov, avi, wmv, doc, xls, pdf, txt</b>, etc.\r\n* Auto detect videos and easily download\r\n* Full-featured download manager to pause, <b>resume</b> and remove downloads\r\n* Download several files at the same time\r\n* Save downloaded files in a <b>password-protected</b> folder\r\n* Download videos in the <b>background</b>\r\n* <b>SD card</b> supported\r\n* Resume failed downloads\r\n* Fast download speed with HD video downloader\r\n* Check the progress in the download bar \r\n* HD video download supported\r\n* Large file download supported\r\n* Download video, music and pictures\r\n* Add bookmarks for your favorite websites\r\n\r\nHow to Use This Free Video Downloader\r\n* Browse website with the built-in browser\r\n* Auto detect videos, and tap the download button\r\n* Choose which video you want to download\r\n* Done!\r\n\r\nVideo Downloader HD \r\nVideo downloader free & video downloader HD has arrived, better than ever! Free video downloader & video downloader HD helps you download all videos for free with high definition!\r\n\r\nVideo Downloader Manager\r\nIf you are looking for powerful video downloader manager, try this video downloader manager, you won't regret it!\r\n\r\nBrowser Private Downloader\r\nThe best browser private downloader and browser downloader. This browser downloader can keep your videos safe. Browse your favorite sites and download with this browser private downloader and browser downloader.\r\n\r\nDownload Manager\r\nThe best and simple download manager. Enjoy your downloading with this full-featured download manager.\r\n\r\nFast Video Downloader\r\nWant to download video with fast speed? Try this fast video downloader, the simple and fast video downloader in the market.\r\n\r\nDownload Video\r\nIf you're looking for video, etc to download video, you really need to try this download video app! \r\n\r\nPermission\r\n- Network - to download files\r\n- Read and write SD card - to save your downloaded files to SD card",
    "descriptionHTML": "Easily download videos and music directly from the Internet onto your device. <b>All formats</b> are supported. 100% <b>free</b>!<br><br>Free Video downloader <b>auto detects videos</b>, you can download them with just one click. The <b>powerful download manager</b> allows you to pause and resume downloads, download in the background and download several files at the same time. Use the HD video downloader to preview the video first, <b>fast download</b> and play it offline.<br><br>Features<br>* HD video downloader<br>* Browse videos with the <b>built-in browser</b><br>* Play videos offline with the <b>built-in player</b><br>* All download formats supported, <b>mp3, m4a, mp4, m4v, mov, avi, wmv, doc, xls, pdf, txt</b>, etc.<br>* Auto detect videos and easily download<br>* Full-featured download manager to pause, <b>resume</b> and remove downloads<br>* Download several files at the same time<br>* Save downloaded files in a <b>password-protected</b> folder<br>* Download videos in the <b>background</b><br>* <b>SD card</b> supported<br>* Resume failed downloads<br>* Fast download speed with HD video downloader<br>* Check the progress in the download bar <br>* HD video download supported<br>* Large file download supported<br>* Download video, music and pictures<br>* Add bookmarks for your favorite websites<br><br>How to Use This Free Video Downloader<br>* Browse website with the built-in browser<br>* Auto detect videos, and tap the download button<br>* Choose which video you want to download<br>* Done!<br><br>Video Downloader HD <br>Video downloader free &amp; video downloader HD has arrived, better than ever! Free video downloader &amp; video downloader HD helps you download all videos for free with high definition!<br><br>Video Downloader Manager<br>If you are looking for powerful video downloader manager, try this video downloader manager, you won&#39;t regret it!<br><br>Browser Private Downloader<br>The best browser private downloader and browser downloader. This browser downloader can keep your videos safe. Browse your favorite sites and download with this browser private downloader and browser downloader.<br><br>Download Manager<br>The best and simple download manager. Enjoy your downloading with this full-featured download manager.<br><br>Fast Video Downloader<br>Want to download video with fast speed? Try this fast video downloader, the simple and fast video downloader in the market.<br><br>Download Video<br>If you&#39;re looking for video, etc to download video, you really need to try this download video app! <br><br>Permission<br>- Network - to download files<br>- Read and write SD card - to save your downloaded files to SD card",
    "summary": "Fast download all videos from the Internet with video downloader.",
    "summaryHTML": "Fast download all videos from the Internet with video downloader.",
    "installs": "100,000,000+",
    "minInstalls": 100000000,
    "score": 4.5975733,
    "ratings": 519109,
    "reviews": 3702,
    "histogram": [
        37252,
        5735,
        11522,
        19415,
        445185
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$2.99 per item",
    "size": "11M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Simple Design Ltd.",
    "developerId": "Simple+Design+Ltd.",
    "developerEmail": "abishkking@gmail.com",
    "developerWebsite": "http://simpledesign.ltd",
    "developerAddress": "Vistra Corporate Services Centre, Wickhams Cay II, Road Town, Tortola, VG1110, British Virgin Islands",
    "privacyPolicy": "http://period-calendar.com/privacypolicy.html",
    "developerInternalID": "8854450600049889113",
    "genre": "Video Players & Editors",
    "genreId": "VIDEO_PLAYERS",
    "icon": "https://play-lh.googleusercontent.com/7EFNz7JQCgH8GDfDUSlLceR-3BLSVEqZtSsQgR3tUYaPxATsFdnjuPwkm9yPXpHBujso",
    "headerImage": "https://play-lh.googleusercontent.com/WIwX87gxIboHiodbpGpV7girf9wukGvJM2xMdLpPQ7rI6z6fp63yN_EjIpyeBx5pcmP2",
    "screenshots": [
        "https://play-lh.googleusercontent.com/MoF3EZa3_ysx1VSFMxChKTyIQ3pGe5FLHg8MlE4_UwyFqEaSJoO_IiLnIV0XG1AdEaU",
        "https://play-lh.googleusercontent.com/h6S0bMOFiYrx0mXYLhJVgFu0fxP8SGUKePEy2vB70gx3bzgH6BPrQiFIfLozm7Pb6Q",
        "https://play-lh.googleusercontent.com/4eFjN0WAxOOZmtG3ZWgTZO4ZDt23hXSXa1gC094rJM8lSG5Gsa4qYYPMuwGfYIBkH9c7",
        "https://play-lh.googleusercontent.com/Op4ZkYiZKQEoxl0ncaRA82YVfHO8C-yUZ0IwFq4v73CPRhHK8yyk_jbx8HIuH0lKPE4",
        "https://play-lh.googleusercontent.com/lUdotA8MADlmPewPivpIBhQRPvrRuq_aOkTbBesyzmx7NPAIw4xzSc98hWysmfmRUOKg",
        "https://play-lh.googleusercontent.com/C1pQJriqBjEFb9WM4SaPhCq7W5cN3uOA6EOHfJ4D4JSOh08uSthfGsv01u8ORqqA5cI",
        "https://play-lh.googleusercontent.com/B2cX5-jpA80kxXoT8EotVrGtANnv8Q0cLdlUF2ySNQxtEZwtGBScZAaXh_jqsnnGdpI",
        "https://play-lh.googleusercontent.com/5VqjkM_hY09GfsZnBPfcd0Ln3vRis3yZAy1Udw_aSjzLv-UawuFWjsUCbc-rKH3YuA",
        "https://play-lh.googleusercontent.com/kW47P3FT8-K7acvq38Gya9ekyzLWuC1GKZkOawm_RV_gx4u_rJ4kIKE2gcE3bQXZQT1I",
        "https://play-lh.googleusercontent.com/ud2lX9HKiPqGpFMWl06L-ifzG2xKIQig149ZBKtGsSwOsX1l-ZaZ7hJpZBq5QoEb-DUL",
        "https://play-lh.googleusercontent.com/BhRNVP-VKZ5uTlGmt-7nTF1hffHX7UU4Rm0-Dq20A9AZ4gCLL5jQ_KSxPJq1Twp2fng",
        "https://play-lh.googleusercontent.com/6K-NeKwPtTddvxOxVaVBIsjS_7r2Ut6AdhGgxIEt-VCltUF1ZKjvE0miNYITsRgLVg",
        "https://play-lh.googleusercontent.com/gi5cKIDy9AR9BK-LiSRhns5_A8H30b5RsJMvl6BfowAVYDXjBQ89VMxcvQtIy4f1OoM",
        "https://play-lh.googleusercontent.com/JY3jPq-NyNBdcRxFDAah6zHb_3E7G7hj5EGt4sq7Q3hiHf_4bG7YM-aKgN7npE2vSA",
        "https://play-lh.googleusercontent.com/4IuxDt-Xd6Zq-0y7YZDBaEDv6lTixEJWlBig23HExPOq7cH1P7YM-22agBZ8KT-bj7E"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Teen",
    "contentRatingDescription": "Sexual Themes",
    "adSupported": true,
    "containsAds": true,
    "released": "Jul 26, 2018",
    "updated": 1643091777,
    "version": "1.1.8",
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "Will download anything, as an avid downloader, this is the perfect tool for the trade. Definitely pay to remove ads. Elegant design, easy interface, great app. I would like to see the ability to change the download location implemented. But the app is perfect besides that.",
        "Wow. First attempted download after installing and finished successfully in about 60 seconds. Whereas only 1 other app was able to download the same video but took a month of sundays to do it. Hope it continues to perfom this way.",
        "I really dig this app, easy to use and the ads aren't so bad and annoying. Cool creation, keep up the good work. 5 stars and a thank you.",
        "Good app. Simple, does it's job, premium is cheap. Doesn't work on YT, but that's the norm for these apps. Good work on this one guys.",
        "Useless video downloader. Can't detect video. And can't start download because sometimes it can't determine the file size. Sometimes it stops downloading in the middle and says error.",
        "Love the app, but a weird thing keeps happening recently where my Amazon app will randomly open while I'm using this one. No idea why and it doesn't happen with any other app.",
        "It works great and the best thing about it is that you can pay a few dollars and get it without any ads aka ad free!!!",
        "App doesn't download anything. The video was playing and I tapped the download button and it told me that there is nothing to download even though the video was still playing.",
        "Great app to download videos you normally can't! Best when you purchase the version with no ads!",
        "4 stars, for why I got it...(to download Bitchute Videos) but only four because it saves the video with the url as the title, instead of the title itself. However, it has an option to rename them before saving via, copy & paste, or just type any name desired. Allows you to brouse Bitchute within it's own interface (nice) but does not work with Youtube (lie-tube) no worries. Update: Now it has full page ads taking over the screen (lost a star for that)",
        "So I've been using this app for maybe 6 months and it's worked like a charm, but recently any link I put in for downloads, registers, but I can't download it. The red button turns gray, and it just opens up the window where I got the video. It's a tedious bug, hopefully they'll fix it! I'll come back if they do.",
        "I find this to be a very good downloading app. Just make sure you know where your photos, videos, and instructional whatever, are in a storage where you won't accidentally delete them. 4 1/2 thumbs up!",
        "Very good. Although too much begging for 5 star. Outside of that it seems excellent.",
        "Absolutely Love The Videos I Can Download! ( That's Only Reason For 4 Stars Instead Of 5 Stars Some Videos It Won't Download ) But Where I Get No Signal Way Out in Sticks Church Makes it Really Cool For Being Safe & Downloaded THANK YOU!! GOD BLESS YOU YOURS 🙏🙂",
        "Awesome. Works very well. I've been able to download about 95% of all the videos that I've tried to get. A couple of sites block the download but that's to be expected. But it's very seldom that happens.",
        "So far so good. Download is quick, able to rename if needed, pause is available. The advertisements are minimal. Five stars.",
        "The videos downloaded before the song finished quality was good . Setting options are impressive thats a plus on choices. Still new to using the app yes its easy to use.👍😷",
        "Works amazing. Almost all videos work with the downloader. Downloads fast and no ads in sight. Able to get my favorites on my phone. Great app.",
        "It is awesome, downloads so well and smooth, this is a must get product for downloading your favorite vids, does not work for Youtube though that's why it's 4 stars",
        "Bummer! I used to love this app because I could download funny clips from FB. However, it won't download from there anymore. That blows.",
        "I used to love it... But after the newest update I can not use it anymore. I used to get my audio edits from here by Instagram and now you can't download any videos from there. :(",
        "Very impressive with the app. I'd rather pay a small annual fee instead of the ads. All in all ...works great.",
        "Its actually working my go to video downloader app currently wont download anything i try to add to it so thankful this is working as intended. Does this app have paid verison to block ads the last jad done but stopped working which made me cautious of oaying for this kinda thing again and also van ot be used on multiple phones needed to be bought dor each?",
        "It's a keeper. Fast download, no issues, just the way it should be. True to thier word. Any site all download. I'm content and recommend 100%.",
        "Works great, downloads video easily, able to save videos and watch later. Great for classes or diy videos.",
        "I have a Galaxy. I can only get things on the Galaxy Store. They SUCK ! i kept on trying. I've had this vdl before, Love it !!",
        "To this review i rate at 4.25. Easy to install the adaptive features. Works great on my phone.",
        "couldn't even click on the video, adds are opening too fast. uninstalled quickly. poor app. That one star is even more for this app.",
        "Aside from random pop ups, it works very well! As free apps go, A+",
        "i love it! downloads are fast and easy! Easy access to you're videos.",
        "Always been able to download from facebook.. Last update, i cant get anything to download😡😭 beyond sad and frustrated. Please fix",
        "Love the app I don't have any problems with downloads to me this has been a very simple to use and to operate",
        "Needs ad blocker asap.you have to turn off your data to watch videos with out ads. You can't back out of the ads.forced to Watch.",
        "Doesn't load videos as of a day or so ago, loved it for months! But now it's busted even after updating",
        "I've had Free Video Downloader for a short period of time and haven't run into any difficulties.",
        "It does the work, and you can download videos from almost any video platform but youtube but it is ok.",
        "My old version wasn't able to download videos from facebook,I have to uninstall and download again.But it's all good now!",
        "great app' and the way they get back with you to explaine how to get the most out of it.",
        "Not only handy for downloading videos, but also a decent little browser app in its own right.",
        "It a actually works! Once you find a sight with YouTube videos you can download it and it's amazing."
    ],
    "editorsChoice": false,
    "similarApps": [
        "all.video.downloader.allvideodownloader",
        "hd.video.downloader.app.hdvideodownloaderapp",
        "com.downloader.privatebrowser",
        "video.downloader.videodownloader",
        "com.playit.videoplayer"
    ],
    "moreByDeveloper": [
        "qrcodereader.barcodescanner.scan.qrscanner",
        "com.popularapp.periodcalendar",
        "imagetopdf.pdfconverter.jpgtopdf.pdfeditor",
        "buttocksworkout.hipsworkouts.forwomen.legworkout",
        "loseweight.weightloss.workout.fitness"
    ],
    "appId": "free.video.downloader.freevideodownloader",
    "url": "https://play.google.com/store/apps/details?id=free.video.downloader.freevideodownloader&hl=en_US&gl=US"
}