{
    "title": "comics and cartoon maker",
    "description": "Comica is a free, easy-to-use app that turns photos into comics/cartoons. You can select any picture from your gallery, or take a new one through the app. After you choose your filter, you can add speech balloons to achieve an even more convincing “comic effect”. This is the easiest way to “cartoon yourself” you can find online.\r\n\r\nHow does it work? \r\n\r\n* Download Comica\r\n* Choose an option - take a photo or browse your gallery\r\n* Pick the photo effect best fitting your freshly created cartoon\r\n* Add speech balloons in the picture\r\n* Save and share with your friends\r\n\r\nComica is also the perfect meme creator. Adding speech balloons in pictures is now possible with a few swipes and a little bit of creativity. \r\n\r\nWhy choose Comica? \r\n\r\n* Easy-to-use\r\n* The app is light and it runs smoothly on any phone\r\n* Legit looking comics effect\r\n* You can create your own memes\r\n* Comika is a free app\r\n\r\nThis comic foto app is meant to be easy to use and its simple design guarantees great user experience. Also, it runs lightly and even older smartphones won’t have problems with it. The “photo to cartoon” option is free, as well as the speech balloons, but if you want to bring things to the next level, you can purchase additional features from the “Big Sale” section. Are you a “big spender”? Even if you are not, you are definitely fit to fully enjoy this photo to comics app. \r\n\r\nWhether you want to have fun with your friends or you are just a comics lover looking for “cartoon yourself” free apps, Comica is definitely worth downloading. Get it, try it, and enjoy yourself.",
    "descriptionHTML": "Comica is a free, easy-to-use app that turns photos into comics/cartoons. You can select any picture from your gallery, or take a new one through the app. After you choose your filter, you can add speech balloons to achieve an even more convincing “comic effect”. This is the easiest way to “cartoon yourself” you can find online.<br><br>How does it work? <br><br>* Download Comica<br>* Choose an option - take a photo or browse your gallery<br>* Pick the photo effect best fitting your freshly created cartoon<br>* Add speech balloons in the picture<br>* Save and share with your friends<br><br>Comica is also the perfect meme creator. Adding speech balloons in pictures is now possible with a few swipes and a little bit of creativity. <br><br>Why choose Comica? <br><br>* Easy-to-use<br>* The app is light and it runs smoothly on any phone<br>* Legit looking comics effect<br>* You can create your own memes<br>* Comika is a free app<br><br>This comic foto app is meant to be easy to use and its simple design guarantees great user experience. Also, it runs lightly and even older smartphones won’t have problems with it. The “photo to cartoon” option is free, as well as the speech balloons, but if you want to bring things to the next level, you can purchase additional features from the “Big Sale” section. Are you a “big spender”? Even if you are not, you are definitely fit to fully enjoy this photo to comics app. <br><br>Whether you want to have fun with your friends or you are just a comics lover looking for “cartoon yourself” free apps, Comica is definitely worth downloading. Get it, try it, and enjoy yourself.",
    "summary": "Turn your photos to comics & cartoons. It is the perfect memes generator",
    "summaryHTML": "Turn your photos to comics &amp; cartoons. It is the perfect memes generator",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 4.5709743,
    "ratings": 89201,
    "reviews": 3917,
    "histogram": [
        3969,
        1032,
        3779,
        11717,
        68704
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$1.49 - $1.99 per item",
    "size": "23M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Game Brain",
    "developerId": "6960447674535343883",
    "developerEmail": "gamebrain@isystem.gr",
    "developerWebsite": "http://www.isystemgroup.org",
    "developerAddress": "Iroon skopeutiriou 46-48\nkaisariani 16121\nAthens\nGreece",
    "privacyPolicy": "http://www.isystemgroup.org/gamebrain_policy.html",
    "developerInternalID": "6960447674535343883",
    "genre": "Photography",
    "genreId": "PHOTOGRAPHY",
    "icon": "https://play-lh.googleusercontent.com/RMnKPFOXA0iK8NIdLZ2quBrkxhSXrfZ2k942hqcCMPw8j3yn16_5J38SVcMNiyXv_7g",
    "headerImage": "https://play-lh.googleusercontent.com/I74d6QbtYQKSsc-mqmaqdQNhs5rf_Xz2Cp0DSB9uFzkKAbSBvbnmqzjxFoKKcLVikFo",
    "screenshots": [
        "https://play-lh.googleusercontent.com/u-cS4aBGXW7ftZNYEMOjGEDCp2nQf8D7Gj592e6jVrTFQLT8gumiwT__Xla9kWIw5A",
        "https://play-lh.googleusercontent.com/WDwcRW0hel01YbsfPVeLWTa7V9EPkEOIuzSxasyol18xzT0h-FM1_ydLDft7NmrnBQ",
        "https://play-lh.googleusercontent.com/_bJgQtewvzAUMI8gxyM1OAgCpL-NPS0aeQyld-ZHz9vbRnwyoGQxaPDIeuCtaBGrYkY",
        "https://play-lh.googleusercontent.com/zfDhw6AxmmWR40EuxPE4YA9drL4Ans0AuHQ0svLHe1miqqR984KWgOWNr4R3Ep1xfyAD",
        "https://play-lh.googleusercontent.com/yor2DgudhDUrbMwu2hWL8G4wOvCev-48cL-46KkmmXcXTmRaEE7dgZ-26PaaGg6LOs99",
        "https://play-lh.googleusercontent.com/HLNl_tLJNrLSRk5Z9IJJNHGPSPE6oOjC3rW5hfo8gqyR3OM7ravt1EAQXrRpdo6LCe8",
        "https://play-lh.googleusercontent.com/ICujQfrLlyzcqVn1s11OHgrw_GIUD7w5VzN4WUhE0Jo-4Cp2nEIfz2aQWdk6KMoE7g",
        "https://play-lh.googleusercontent.com/t3I1u2per0Zf5gSgArqQu-r2vugN_RCfc43wt7X9VHPzEsSiMx4JnvMiY-IoUZw08mk"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Teen",
    "contentRatingDescription": "Suggestive Themes",
    "adSupported": true,
    "containsAds": true,
    "released": "Mar 28, 2018",
    "updated": 1627853795,
    "version": "1.45",
    "recentChanges": null,
    "recentChangesHTML": null,
    "comments": [
        "Experience has been great, even with the cheap one. I hate ads so I paid, as far as people complaining about not being able to move the tails , or make it shorter, or go down, I assume they're talking about when they do words it goes straight across the screen.well, you type 2 words then push enter, so ur bubble goes down, and yeah. I haven't had any crashing yet, but I swear,!!!! OMG,if it ever does,,Just pray I get my $1.50 back!! Hehe",
        "I liked the free version so much, I paid for the upgrade and BAM-- within 3 months it became a crash-machine. I can't see more than two looks before it locks up with the Circle of Loading Death and I'm forced to restart the app. Every. Time. What a disappointment. Like giving money to a person on the street and later they rob you. 10 million comic filter apps our there and I had to get ripped off by this one.",
        "You can't move the tails of the speech bubbles, also you can't shape the speech bubbles to go downward and that absolutely needs to be fixed. Also when you create a comic with more than one image the app saves the image to a very low resolution. Please fix and you'll get a sparkling 5 star review from me.",
        "Honestly my favorite sketch/pencil/ink/comic rendering app ive tried. Done installing and almost immediately uninstalling(granted i prefer not to have to pay) 30-50 3$-$15 deals seem to stack up into the three digits easily anymore what with a charge for everything, seems like nobody can have anything anymore unless they take it/and or get it from someone else. And so many better things i could do with that money. There's always a good app out there like this. Even if you cant find it immediatel",
        "Cons. No editing after applying speach balloon. No multiple pages. Can't export to pdf, etc. Speech bubble use scale so can't fit different space. (Example, can't do wide and tall.) Can't adjust layout panel. Pros. Easy to pick pictures. Easy to apply one speech balloon.",
        "Does a good job at placing filters. Only 4 Stars though, but inly because theres not a lot of options. id like to see morevin the future. Oh and also the app pic needs to chagey. its just an android picture.",
        "Great app, I love creating content is so amazing how app designer's make this apps for us to enjoy, is just cool to me to find apps, n I've been using since 2013. Love this app do.",
        "Does alright. Brightness and Contrast are quite jumpy, and I didn't see any option to do accent coloring - you choose Cartoon for full color or Comic for B&W. Might be helpful if you can't afford Adobe products or only use a phone. As someone advanced with CS tools, it's clunky for me. Recommend for fun only, or memes.",
        "incredible ! wish things were easier for a completely straight fowrward work flow, but, with a bit of work on my part, this is a legit pro level tool ( for a person with limited artistic ability outside of music and stick figures)",
        "Works just like it's supposed to so far it's an awesome app as long as it stays the way it is the way things change with money grubbing people who knows because there are allot of stuff on apps that used to be free that aren't anymore so as long as it stays as it is now it is awesome !!!!",
        "I think it's an awesome way to lay out your daily journal but I'm still learning this comic app so 4 stars is now but I'm not going to say it's going to stay at 4",
        "I've only used this app once so far and it really came out good my girlfriend loved it and she hates everything. I think she even hates me? I'm not sure yet. but I'll tell you what? the cartoon animation I sent her? I think it's having a positive effect!! now, I'm not saying this app will save your relationship - I'm just saying it's possible. aside from that? it really has some awesome features so download it give it a try and tell em- Kevin S Gallagher Sent ya!",
        "I've been looking to use my own images for a comic book this app has been helpful with that, I give it five stars with educating me own my life and have fun with it..thanks,I've only been in here for 3 days on free version,Best ever love it",
        "I'm knocking it down to ONE stars. They fixed the issue with the images always saving. Unfortunately, when they fixed this, they ADDED an ad when you send a comic as a text/MMS message. I have to delete their \"My comic Send from my phone\" with a link to app every time I send a comic as a text/MMS. I PAID for the app to be ad-free. I PAID for the app. I did NOT PAY TO BE THEIR UNPAID ADVERTISER. This should be a five star review. The app is great. It's intuitive and easy to use. I haven't sent a non-comic/non-cartoon text message in months. I'm only giving it four stars instead of the five it deserves because even if you don't save an image, even if you click on \"confirm\" when it says this image hasn't been saved, it saves it anyways and you end up with a load of comic/cartoon images cluttering up your phone. Because I send almost every text message in cartoon/comic form, I have to go in daily to delete all of the extra images it saved even though I told it not to. Fix this and I'll update the review to five stars.",
        "Fun, I like it. No matter what the ad, my personal policy is to buy nothing online. All my monies go to local merchants... I despise the internet hustle...",
        "Only issue with the free portion of the program is when you back out of a photot if you didn't take it with your original camera, all the work that was done is erased if not saved.",
        "I'm blown away by this app. I can not believe what I am able to create W/O interrupting the creative process with the hours and days of illustration, cost of supplys.. creativity is now a tool and skill that, before just a few years ago, was a privilege and ability to only a small percentage of those with artistic Skills. I've tried many other apps since I DL'd this. NO OTHER APP COMES EVEN CLOSE TO THIS ONE. Try this app first",
        "SAMSUNG GALAXY A11: I realllllly 💖 💙 💞💖 💜 this app. It works on photos u have already on your device plus on the new photos u take. I even 💖 💙 💖 how it has less permissions so that your device do not get hit with background file junk 👍🏽 . Gr8 work u guys 🤗 🤗 🤗 .",
        "I really liked this app a lot the first few days I had it. But now I cannot change the background like before and it really took away a lot of the excitement for me.",
        "Absolutely love this app. Just downloaded it yesterday and I'm having a blast. I've made funny cartoons and comics using pics of my pets. Just caught them at the perfect moment to capture a funny pose or face expression and I came up with my own text toake it funny. I definitely recommend it. 👍👍",
        "Easy to use simple FX on the fly ---annoying ads but hey --it's worth it for what you get on the fly and the qaulity.",
        "Makes everything look like waterpainting not cartoon. And the ads you can't get out of, gotta love that.",
        "Very good for adding text to meme in word/thought balloons, but needs more text editing options (center alignment, for example).",
        "2022/01/08 - When posting to social media from the app, it spams with a link to app store. 2021/10/03 - Is this app abandoned by the developers? Latest update still causes intermittent lockups on Android 11. Still spams shared links.",
        "Very nice filters, honestly if you mix it with regular phone filters using a screenshot it makes it look even better.",
        "Was 5 star. Now keeps hitting me for ad free. I paid it AND the additional features. One was ability to pull in Pexels. Don't get me wrong GREAT APP. Would pay far more even for subscription. BUT if I pay for something I want it and feel cheated. Reinstalling didn't fix",
        "Very Clever easy to use app and if you're creative there's ways to not be forced into specific presets. Very fun",
        "I could spend hours in Photoshop trying to match the quality of these filters.",
        "Unbelievable! The best art enhancement program I've ever seen hands down! Thank you",
        "Does exactly as it states it does, turns photos into lined art. Very useful in learning and practicing how to draw better. Helps me to understand the shapes and shading which i cannot grasp from a normal real life photo. Great way to learn",
        "Immediately gave me an ad that pops up again after you close it. Literally unusable",
        "Decent app but it's horrible how this wordscapes game keeps forcing you to the play store and won't let you get back to the app! Sleazy AF",
        "Pretty average. Lacking and features but what do you expect for free. It will allow you to cartoonize any photos you take but the face quality is pretty average or less.",
        "Been great especially since paid 1.49 for no ads! SOS can somebody tell me how to use the multi feature? I can't get images into the frames! Much appreciated! I don't find a pro version!?",
        "This app is so amazing. Hand claps to the team! Not much ads.",
        "Hello! I recently bought the pro version of this but it seems I can't find the section to get back the benefits I bought within the app. I'll need help to get back the payment I've placed on the item back, to repurchase it again.",
        "I love this app. It works really well for promo flyer material I create",
        "I would open up the app. and try picking at the beginning then it would stop on me I tried several more times and same thing so I uninstalled it.",
        "Excellent app . Needs an easier way to check out filters then it would be perfect",
        "Would be great if it didn't crash & return to the title screen on me over and over again. I would love to try to actually do 3 or 4 pictures and put them in a collage so it looks like a comic. But i can't get past 1 filter. I'm lucky when i get that far. Gotta click on it and hit the checkmark quick before it goes home on me. Most times I can't even do that. Idk if its the OnePlus phone, or Android 10, because I see all the other good reviews. But it's not working for me. 3* for what I can see"
    ],
    "editorsChoice": false,
    "similarApps": [
        "com.manboker.headportrait",
        "com.thmobile.cartoonme.artphotoeditor",
        "com.gamebrain.cartoonpro",
        "io.moonlighting.painnt",
        "de.nextsol.deeparteffects.app"
    ],
    "moreByDeveloper": null,
    "appId": "gr.gamebrain.comica",
    "url": "https://play.google.com/store/apps/details?id=gr.gamebrain.comica&hl=en_US&gl=US"
}